Современный учебник JavaScript
	https://learn.javascript.ru
	f:\js\courses\JS-Learn-JS\textes\Learn-JS-оглавление.txt
	f:\js\courses\JS-Learn-JS\textes\Learn-JS1.js
	начат: 18.12.24

ЧАСТЬ 1. Язык JavaScript (96 уроков) - f:\js\courses\JS-Learn-JS\textes\Learn-JS1.js
ЧАСТЬ 2. Браузер: документ, события, интерфейсы (32 урока)
ЧАСТЬ 3. Тематические разделы (66 уроков)

"javascript - один из немногих языков, которые заставляют радоваться пользователей"

Оглавление:

ЧАСТЬ 1. Язык JavaScript

	1.1. Введение
#1. 1.1.1. Введение в JavaScript
#2. 1.1.2. Справочники и спецификации
#3. 1.1.3. Редакторы кода
#4. 1.1.4. Консоль разработчика
	
	1.2. Основы JavaScript
#5. 1.2.1. Привет, мир!
#6. 1.2.2. Структура кода
#7. 1.2.3. Строгий режим — "use strict"
#8. 1.2.4. Переменные
#9. 1.2.5. Типы данных
#10. 1.2.6. Взаимодействие: alert, prompt, confirm
#11. 1.2.7. Преобразование типов
#12. 1.2.8. Базовые операторы, математика
#13. 1.2.9. Операторы сравнения
#14. 1.2.10. Условное ветвление: if, '?'
#15. 1.2.11. Логические операторы
#16. 1.2.12. Операторы нулевого слияния и присваивания: '??', '??='
#17. 1.2.13. Циклы while и for
#18. 1.2.14. Конструкция "switch"
#19. 1.2.15. Функции
#20. 1.2.16. Function Expression
#21. 1.2.17. Стрелочные функции, основы
#22. 1.2.18. Особенности JavaScript
	
	1.3. Качество кода
#23. 1.3.1. Отладка в браузере
#24. 1.3.2. Советы по стилю кода
#25. 1.3.3. Комментарии
#26. 1.3.4. Ниндзя-код
#27. 1.3.5. Автоматическое тестирование c использованием фреймворка Mocha
#28. 1.3.6. Полифилы
	
	1.4. Объекты: основы
#29. 1.4.1. Объекты
#30. 1.4.2. Копирование объектов и ссылки
#31. 1.4.3. Сборка мусора
#32. 1.4.4. Методы объекта, "this"
#33. 1.4.5. Конструктор, оператор "new"
#34. 1.4.6. Опциональная цепочка '?.'
#35. 1.4.7. Тип данных Symbol
#36. 1.4.8. Преобразование объектов в примитивы
	
	1.5. Типы данных
#37. 1.5.1. Методы примитивов
#38. 1.5.2. Числа
#39. 1.5.3. Строки
#40. 1.5.4. Массивы
#41. 1.5.5. Методы массивов
#42. 1.5.6. Перебираемые объекты
#43. 1.5.7. Map и Set
#44. 1.5.8. WeakMap и WeakSet
#45. 1.5.9. Object.keys, values, entries
#46. 1.5.10. Деструктурирующее присваивание
#47. 1.5.11. Дата и время
#48. 1.5.12. Формат JSON, метод toJSON
	
	1.6. Продвинутая работа с функциями 
#49. 1.6.1. Рекурсия и стек
#50. 1.6.2. Остаточные параметры и оператор расширения
#51. 1.6.3. Область видимости переменных, замыкание
#52. 1.6.4. Устаревшее ключевое слово "var"
#53. 1.6.5. Глобальный объект
#54. 1.6.6. Объект функции, NFE
#55. 1.6.7. Синтаксис "new Function"
#56. 1.6.8. Планирование: setTimeout и setInterval
#57. 1.6.9. Декораторы и переадресация вызова, call/apply
#58. 1.6.10. Привязка контекста к функции
#59. 1.6.11. Повторяем стрелочные функции
	
	1.7. Свойства объекта, их конфигурация
#60. 1.7.1. Флаги и дескрипторы свойств
#61. 1.7.2. Свойства - геттеры и сеттеры
	
	1.8. Прототипы, наследование
#62. 1.8.1. Прототипное наследование
#63. 1.8.2. F.prototype
#64. 1.8.3. Встроенные прототипы
#65. 1.8.4. Методы прототипов, объекты без свойства __proto__
	
	1.9. Классы
#66. 1.9.1. Класс: базовый синтаксис
#67. 1.9.2. Наследование классов
#68. 1.9.3. Статические свойства и методы
#69. 1.9.4. Приватные и защищённые методы и свойства
#70. 1.9.5. Расширение встроенных классов
#71. 1.9.6. Проверка класса: "instanceof"
#72. 1.9.7. Примеси
	
	1.10. Обработка ошибок
#73. 1.10.1. Обработка ошибок, "try..catch"
#74. 1.10.2. Пользовательские ошибки, расширение Error
	
	1.11. Промисы, async/await
#75. 1.11.1. Введение: колбэки
#76. 1.11.2. Промисы
#77. 1.11.3. Цепочка промисов
#78. 1.11.4. Промисы: обработка ошибок
#79. 1.11.5. Promise API
#80. 1.11.6. Промисификация
#81. 1.11.7. Микрозадачи
#82. 1.11.8. Async/await
	
	1.12. Генераторы, продвинутая итерация
#83. 1.12.1. Генераторы
#84. 1.12.2. Асинхронные итераторы и генераторы
	
	1.13. Модули
#85. 1.13.1. Модули, введение
#86. 1.13.2. Экспорт и импорт
#87. 1.13.3. Динамические импорты
	
	1.14. Разное
#88. 1.14.1. Proxy и Reflect
#89. 1.14.2. Eval: выполнение строки кода
#90. 1.14.3. Каррирование
#91. 1.14.4. Ссылочный тип
#92. 1.14.5. Побитовые операторы
#93. 1.14.6. BigInt
#94. 1.14.7. Юникод, внутреннее устройство строк
#95. 1.14.8. Intl: интернационализация в JavaScript
#96. 1.14.9. WeakRef и FinalizationRegistry

=> всего: 96

#1.1. Введение
#1.1.1. Введение в JavaScript
2.1.25 - https://learn.javascript.ru/intro
Изначально JavaScript (JS) был создан, чтобы "сделать веб-страницы живым". Программы на этом языке называются скриптами. Они могут встраиваться в HTML и выполняться автоматически при загрузке веб-страницы.
Скрипты распространяются и выполняются, как простой текст. Им не нужна специальная подготовка или компиляция для запуска.
Это отличает JavaScript от другого языка – Java (своего прародителя).
// Когда JavaScript создавался, у него было другое имя – "LiveScript". Однако, язык Java был очень популярен в то время, и было решено, что позиционирование JavaScript как "младшего брата" Java будет полезно. Со временем JavaScript стал полностью независимым языком со своей собственной спецификацией, называющейся ECMAScript, и сейчас не имеет никакого отношения к Java.
Сегодня JavaScript может выполняться не только в браузере, но и на сервере или на любом другом устройстве, которое имеет специальную программу, называющуюся движком JS. У браузера есть собственный движок, который иногда называют "виртуальная машина JavaScript".
Разные движки JS имеют разные "кодовые имена":
	- V8 : в Chrome, Opera и Edge;
	- SpiderMonkey : в Firefox;
	- Chakra : IE, 
	- JavaScriptCore, Nitro и SquirrelFish : для Safari, и т.д.
основы работы движков JS:
	- Движок (встроенный, если это браузер) читает (парсит) текст скрипта.
	- Затем он преобразует (компилирует) скрипт в машинный код.
	- После этого машинный код запускается и работает достаточно быстро.
Движок применяет оптимизации на каждом этапе. Он даже просматривает скомпилированный скрипт во время его работы, анализируя проходящие через него данные, и применяет оптимизации к машинному коду, полагаясь на полученные знания. В результате скрипты работают очень быстро.

Современный JavaScript – это "безопасный" язык программирования. Он не предоставляет низкоуровневый доступ к памяти или процессору, потому что изначально был создан для браузеров, не требующих этого.
Возможности JS сильно зависят от окружения, в котором он работает. Например, Node.js поддерживает функции чтения/записи произвольных файлов, выполнения сетевых запросов и т.д. В браузере для JS доступно всё, что связано с манипулированием веб-страницами, взаимодействием с пользователем и веб-сервером.
Например, в браузере JS может:
	- Добавлять новый HTML-код на страницу, изменять существующее содержимое, модифицировать стили.
	- Реагировать на действия пользователя, щелчки мыши, перемещения указателя, нажатия клавиш.
	- Отправлять сетевые запросы на удалённые сервера, скачивать и загружать файлы (технологии AJAX и COMET).
	- Получать и устанавливать куки, задавать вопросы посетителю, показывать сообщения.
	- Запоминать данные на стороне клиента (local storage).
Возможности JS в браузере ограничены ради безопасности пользователя. Чего НЕ может JS в браузере:
	- JavaScript на веб-странице не может читать/записывать произвольные файлы на жёстком диске, копировать их или запускать программы. Он не имеет прямого доступа к системным функциям ОС. // Современные браузеры позволяют JS работать с файлами, но с ограниченным доступом, и предоставляют его, только если пользователь выполняет определённые действия, такие как "перетаскивание" файла в окно браузера или его выбор с помощью тега <input>.
	- Существуют способы взаимодействия с камерой/микрофоном и другими устройствами, но они требуют явного разрешения пользователя. // Таким образом, страница с поддержкой JavaScript не может незаметно включить веб-камеру, наблюдать за происходящим и отправлять информацию куда-либо, например в ФСБ.
	- Различные окна/вкладки не знают друг о друге. Иногда одно окно, используя JS, открывает другое окно. Но даже в этом случае JS с одной страницы не имеет доступа к другой, если они пришли с разных сайтов (с другого домена, протокола или порта). // Это называется "Политика одинакового источника" (Same Origin Policy). Чтобы обойти это ограничение, обе страницы должны согласиться с этим и содержать JS-код, который специальным образом обменивается данными. Это ограничение необходимо, опять же, для безопасности пользователя. Страница https://anysite.com, которую открыл пользователь, не должна иметь доступ к другой вкладке браузера с URL https://gmail.com и воровать информацию оттуда.
	- JavaScript может легко взаимодействовать с сервером, с которого пришла текущая страница. Но его способность получать данные с других сайтов/доменов ограничена. // Хотя это возможно в принципе, для чего требуется явное согласие (выраженное в заголовках HTTP) с удалённой стороной. Опять же, это ограничение безопасности.
Подобные ограничения не действуют, если JS используется вне браузера, например — на сервере. Современные браузеры предоставляют плагины/расширения, с помощью которых можно запрашивать дополнительные разрешения.

Есть как минимум, три сильные стороны JS:
	- Полная интеграция с HTML/CSS.
	- Простые вещи делаются просто.
	- Поддерживается всеми основными браузерами и включён по умолчанию.
JS – это единственная браузерная технология, сочетающая в себе все эти три вещи. Вот почему это самый распространённый инструмент для создания интерфейсов в браузере. Хотя, конечно, JS позволяет делать приложения не только в браузерах, но и на сервере, на мобильных устройствах и т.п.

Синтаксис JS подходит не под все нужды. Разные люди хотят иметь разные возможности. Так, в последнее время появилось много новых языков, которые транспилируются (конвертируются) в JS, прежде чем запустятся в браузере. Современные инструменты делают транспиляцию очень быстрой и прозрачной, фактически позволяя разработчикам писать код на другом языке, автоматически преобразуя его в JS под капотом.
Примеры таких языков:
	- CoffeeScript добавляет "синтаксический сахар" для JS. Он вводит более короткий синтаксис, который позволяет писать чистый и лаконичный код. Обычно такое нравится Ruby-программистам.
	- TypeScript концентрируется на добавлении "строгой типизации" для упрощения разработки и поддержки больших и сложных систем. Разработан Microsoft.
	- Flow тоже добавляет типизацию, но иначе. Разработан Facebook.
	- Dart стоит особняком, потому что имеет собственный движок, работающий вне браузера (например, в мобильных приложениях). Первоначально был предложен Google, как замена JS, но на данный момент необходима его транспиляция для запуска так же, как для вышеперечисленных языков.
	- Brython транспилирует Python в JS, что позволяет писать приложения на чистом Python без JS.
// Есть и другие. Но даже если мы используем один из этих языков, мы должны знать JS, чтобы действительно понимать, что мы делаем.

#1.1.2. Справочники и спецификации
2.1.25 - https://learn.javascript.ru/manuals-specifications
Спецификации.
Спецификация ECMA-262 содержит самую глубокую, детальную и формализованную информацию о JavaScript. Она определяет сам язык. https://www.ecma-international.org/publications-and-standards/standards/ecma-262/
Новая версия спецификации появляется каждый год. А пока она не вышла официально, все желающие могут ознакомиться с текущим черновиком на https://tc39.es/ecma262/ .
Чтобы почитать о самых последних возможностях, включая те, которые «почти в стандарте» (так называемые "stage 3 proposals"), посетите https://github.com/tc39/proposals .
Если вы разрабатываете под браузеры, то существуют и другие спецификации, о которых рассказывается во второй части этого учебника.

Справочники.
- MDN (Mozilla) JavaScript Reference – это справочник с примерами и другой информацией. Хороший источник для получения подробных сведений о функциях языка, методах встроенных объектов и так далее. Располагается по адресу https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference .
// Хотя зачастую вместо их сайта удобнее использовать какой-нибудь интернет-поисковик.

Таблицы совместимости.
JavaScript – это развивающийся язык, в который постоянно добавляется что-то новое. Посмотреть, какие возможности поддерживаются в разных браузерах и других движках, можно в следующих источниках:
	- caniuse.com – таблицы с информацией о поддержке по каждой возможности языка. Например, чтобы узнать, какие движки поддерживают современные криптографические функции, посетите: https://caniuse.com/#feat=cryptography .
	- kangax.github.io/compat-table – таблица с возможностями языка и движками, которые их поддерживают и не поддерживают.
Эти ресурсы полезны в ежедневной работе программиста, так как они содержат ценную информацию о возможностях использования языка, их поддержке и так далее.

#1.1.3. Редакторы кода
2.1.25 - https://learn.javascript.ru/code-editors
Есть два основных типа редакторов: IDE и "лёгкие" редакторы. Многие используют по одному инструменту каждого типа.

IDE
IDE (Integrated Development Environment, "интегрированная среда разработки") называют мощные редакторы с множеством функций, которые работают в рамках целого проекта. Как видно из названия, это не просто редактор, а нечто большее. IDE загружает проект (который может состоять из множества файлов), позволяет переключаться между файлами, предлагает автодополнение по коду всего проекта (а не только открытого файла), также она интегрирована с системой контроля версий (например, такой как git), средой для тестирования и другими инструментами на уровне всего проекта.
Наиболее известные:
	- Visual Studio Code, VSCode, (кросс-платформенная, бесплатная). https://code.visualstudio.com/
	- WebStorm (кросс-платформенная, бесплатная для некоммерческого использования). https://www.jetbrains.com/webstorm/
	- Visual Studio – это платная мощная среда разработки, которая работает только на Windows. Она хорошо подходит для .NET платформы. У неё есть бесплатная версия, которая называется Visual Studio Community. https://www.visualstudio.com/vs/community/
// Многие IDE платные, но у них есть пробный период. Их цена обычно незначительна по сравнению с зарплатой квалифицированного разработчика, так что пробуйте и выбирайте ту, что вам подходит лучше других.

Лёгкие редакторы
Они менее мощные, чем IDE, но они отличаются скоростью, удобным интерфейсом и простотой. В основном их используют для того, чтобы быстро открыть и отредактировать нужный файл.
На практике лёгкие редакторы могут иметь множество плагинов, включая автодополнение и анализаторы синтаксиса на уровне директории, поэтому границы между IDE и лёгкими редакторами размыты.
Наиболее известные:
	- Notepad++ (Windows, бесплатный). https://notepad-plus-plus.org/
	- Sublime Text (кроссплатформенный, условно-бесплатный). https://www.sublimetext.com/
	- Vim и Emacs тоже хороши, если знать, как ими пользоваться. https://www.vim.org/ ; https://www.gnu.org/software/emacs/

Также сущесвуют онлайн-редакторы:
	- JavaScript Online Compiler https://playcode.io/javascript
	- CodePen https://codepen.io
	- {JS Editor} https://jseditor.io
	и др.

#1.1.4. Консоль разработчика
2.1.25 - https://learn.javascript.ru/devtools
Для отлова ошибок в браузер встроены так называемые Инструменты разработки (Developer tools, или сокращённо — devtools).

Chrome, Firefox, Edge и др. - F12, (Cmd+Opt+J для Mac).
Opera - Ctrl+Shift+C.
Safari (Mac) - сначала нужно включить Меню разработки (Developer menu) в Продвинутых настройках (Preferences -> Advanced). Теперь консоль можно активировать нажатием Cmd+Opt+C.

#1.2. Основы JavaScript
#1.2.1. Тег script
2.1.25 Привет, мир! - https://learn.javascript.ru/hello-world
Программы на JS могут быть вставлены в любое место HTML-документа с помощью тега <script>.
	<script>alert( 'Привет, мир!' );</script>

Тег script <script> (от англ. script — скрипт, сценарий) предназначен для описания скриптов, может содержать ссылку на программу или её текст на определённом языке (JavaScript). Скрипты могут располагаться во внешнем файле и связываться с любым HTML-документом. Такой подход позволяет использовать одни и те же общие функции на многих веб-страницах и ускоряет их загрузку, т. к. внешний файл кэшируется при первой загрузке, и скрипт вызывается быстрее при последующих вызовах. <script></script> может располагаться в заголовке или теле HTML-документа в неограниченном количестве. В большинстве случаев местоположение скрипта никак не сказывается на работу программы. Однако скрипты, которые должны выполняться в первую очередь, обычно помещают в заголовок документа. Закрывающий тег обязателен. Атрибуты необязательны.
		<script>...JS-код...</script>
		<script src="адрес-файла-с-кодом"></script>
	async - Загружает скрипт асинхронно. При наличии атрибута async браузер при возможности запускает скрипт асинхронно. Это означает, что указанный в атрибуте src файл будет выполняться без ожидания загрузки и отображения веб-страницы. В то же время и страница не ожидает результата выполнения скрипта, а продолжает загружаться как обычно. Если задано сразу два атрибута — async и defer, то атрибут async игнорируется. Значений нет. По умолчанию этот атрибут выключен.
		<script async>...</script>
	defer - Откладывает выполнение скрипта до тех пор, пока вся страница не будет загружена полностью. Работает только при наличии атрибута src. Значений нет. По умолчанию этот атрибут выключен.
		<script src="<адрес>" defer>...</script>
	src - Адрес скрипта из внешнего файла для импорта в текущий документ. Загружает файл со скриптом из внешнего файла. Как только внешние инструкции полностью загружаются, браузер обрабатывает их, словно они были внедрены в текущий документ. Файлы со скриптами JavaScript обычно имеют расширение js и могут размещаться в любом доступном месте. Преимуществ использования внешних файлов несколько. Внешний файл после первого обращения сохраняется в кэше браузера и при последующих вызовах загружается быстрее. Кроме того, вызываемые функции удобно править в одном месте и код проще контролировать. Это особенно актуально, когда множество веб-страниц используют одни и те же скрипты. Значения: в качестве значения принимается полный или относительный путь к файлу. Файл должен иметь расширение .js. Значения по умолчанию нет.
	// Если атрибут src установлен, содержимое тега <script>...</script> будет игнорироваться. В одном теге <script> нельзя использовать одновременно атрибут src и код внутри.
		<script src="<адрес>">...</script> 
		<script src="/path/to/script.js"></script> // src - абсолютный путь от корневой папки до необходимого файла.
		<script src="./script.js"></script> // src - путь относительно текущей страницы. 
		<script src="script.js"></script> // src - файл находится в той же папке чо и текущая страница. 
	type - Определяет тип содержимого скрипта. Указывает MIME-тип для определённого языка. Значения: атрибут type не чувствителен к регистру и обычно принимает следующие значения:
		text/javascript — Для языка программирования JavaScript (по умолчанию). <script type="text/javascript">
		text/vbscript — Для языка VBScript.
		module - JavaScript модуль.
		<script type="<MIME-тип>">...</script>
	language - <script language="значение">. Этот атрибут должен был задавать язык, на котором написан скрипт. Но так как JavaScript является языком по умолчанию, в этом атрибуте уже нет необходимости.

В старых книгах и руководствах вы сможете найти комментарии внутри тега <script><!--...--></script>, Этот комментарий скрывал JS-код в старых браузерах, которые не знали, как обрабатывать тег <script>. Поскольку все браузеры, выпущенные за последние 15 лет, не имеют данной проблемы, такие комментарии уже не нужны. Если они есть, то это признак, что перед нами очень древний код.

Для подключения нескольких скриптов используется несколько тегов <script>,

Как правило, только простейшие скрипты помещаются в HTML. Более сложные выделяются в отдельные файлы. Польза отдельных файлов в том, что браузер загрузит скрипт отдельно и сможет хранить его в кеше. Другие страницы, которые подключают тот же скрипт, смогут брать его из кеша вместо повторной загрузки из сети. И таким образом файл будет загружаться с сервера только один раз. Это сокращает расход трафика и ускоряет загрузку страниц.

#1.2.2. Структура кода
2.1.25 - https://learn.javascript.ru/structure
Инструкции – это синтаксические конструкции и команды, которые выполняют действия, и разделяются точкой с запятой.
В большинстве случаев точку с запятой можно не ставить, если есть переход на новую строку. В этом случае JS интерпретирует перенос строки как неявную точку с запятой, и это называется автоматическая вставка точки с запятой. https://tc39.github.io/ecma262/#sec-automatic-semicolon-insertion
В большинстве случаев новая строка подразумевает точку с запятой. Но "в большинстве случаев" не значит "всегда"!
Есть ситуации, где JS "забывает" вставить точку с запятой там, где она нужна. Ошибки, которые при этом появляются, достаточно сложно обнаруживать и исправлять.

Однострочные комментарии начинаются с двойной косой черты //.
Многострочные комментарии начинаются косой чертой со звёздочкой /* и заканчиваются звёздочкой с косой чертой */.
// В большинстве редакторов строку кода можно закомментировать, нажав комбинацию клавиш Ctrl+/ для однострочного комментария и что-то вроде Ctrl+Shift+/ – для многострочных комментариев (выделите кусок кода и нажмите комбинацию клавиш). 

#1.2.3. Строгий режим — "use strict"
2.1.25 - https://learn.javascript.ru/strict-mode
На протяжении долгого времени JS развивался без проблем с обратной совместимостью. Новые функции добавлялись в язык, в то время как старая функциональность не менялась. Преимуществом данного подхода было то, что существующий код продолжал работать. А недостатком – что любая ошибка или несовершенное решение, принятое создателями JS, застревали в языке навсегда.
Так было до 2009 года, когда появился ECMAScript 5 (ES5). Он добавил новые возможности в язык и изменил некоторые из существующих. Чтобы устаревший код работал, как и раньше, по умолчанию подобные изменения не применяются. Поэтому нужно явно их активировать с помощью специальной директивы: "use strict" (строгий режим).
"Строгий режим" - это строгий режим с ограничениями, не пропускающий ряд ошибок и вводящий некоторые правила. Обычно в строгом режиме скрипт работает как на момент последнего оффициального релиза ECMAScript (ES#). Сейчас это ES6 (2015).
Обычно используется чтобы обеспечить совместимость со старыми скриптами.
Когда "use strict" | 'use strict' находится в начале скрипта, весь сценарий работает в строгом режиме. Обычно используется для всего файла.
Если "use strict" находится в первой исполняемой строке скрипта, строгий режим может не включиться. Над "use strict" могут быть записаны только комментарии.
Нет никакого способа отменить use strict. Нет директивы типа "no use strict", которая возвращала бы движок к старому поведению. Как только мы входим в строгий режим, отменить это невозможно.
В консоли браузера use strict по умолчанию выключен. Можно включить его вручную, используя Shift+Enter для ввода нескольких строк, или поместить код в обёртку самозапускаемой функции в строгом режиме:
	(function() {'use strict'; /* ...ваш код... */})();
Современный JS поддерживает классы и модули, которые автоматически включают строгий режим. Поэтому в них нет нужды добавлять директиву "use strict".
Обычно желательно добавлять "use strict"; в начале скриптов, но если весь код состоит из классов и модулей, директиву можно опускать.

#1.2.4. Переменные
2.1.25 Переменные и постоянные - https://learn.javascript.ru/variables
Переменная – это именованное хранилище данных. Можно использовать переменные для хранения различных типов данных.
Для создания переменной в JS используется ключевое слово let.
Поместить данные в переменную (другими словами, определить переменную), можно используя оператор присваивания = .
Строка сохраняется в области памяти, связанной с переменной. Мы можем получить к ней доступ, используя имя переменной.
Объявление переменной и запись данных можно совместить в одну строку.
	let message = 'some text'; // определяем переменную и присваиваем ей значение
Также можно объявить несколько переменных в одной строке:
	let user = 'John', age = 25, message = 'some text';
// Для лучшей читаемости (?) нужно объявлять каждую переменную на новой строке.

В старых скриптах вы также можно найти другое ключевое слово: var вместо let:
	var message = 'some text';
Ключевое слово var – почти то же самое, что и let. Оно объявляет переменную, но немного по-другому, устаревшим способом. Есть тонкие различия между let и var, которые Мы подробно рассмотрим в главе Устаревшее ключевое слово "var". https://learn.javascript.ru/var

Переменная может быть объявлена только один раз. Повторное объявление той же переменной является ошибкой: SyntaxError: 'message' has already been declared.
// Примечательно, что существуют функциональные языки программирования, такие как Scala или Erlang, которые запрещают изменять значение переменной. В таких языках однажды сохранённое "в коробку" значение остаётся там навсегда. 

В JS есть два ограничения, касающиеся имён переменных:
	- Имя переменной должно содержать только буквы, цифры или символы $ и _.
	- Первый символ не должен быть цифрой.
Если имя содержит несколько слов, обычно используется верблюжий стиль (CamelCase), то есть, слова следуют одно за другим, где каждое следующее слово начинается с заглавной буквы: myVeryLongName; или змеиный стиль (snake_case), где слова пишутся через подчёркивание. 
Знак доллара '$' и подчёркивание '_' можно использовать в названиях; в JS это обычные символы, как и буквы, без особого значения, однако  дефис '-' в именах не разрешён.
Регистр имеет значение: переменные с именами apple и APPLE – это две разные переменные.
Нелатинские буквы разрешены, но не рекомендуются; можно использовать любой язык, включая кириллицу или даже иероглифы, например:
	let имя = '...'; let 我 = '...';
Технически здесь нет ошибки, такие имена разрешены, но есть международная традиция использовать английский язык в именах переменных. Даже если мы пишем небольшой скрипт, у него может быть долгая жизнь впереди. Людям из других стран, возможно, придётся прочесть его не один раз.
Существует список зарезервированных слов, которые нельзя использовать в качестве имён переменных, потому что они используются самим языком. 
Например: let, class, return и function зарезервированы.

Создание переменной без использования use strict.
Обычно нужно определить переменную перед её использованием. Но раньше можно было создать переменную простым присвоением значения без использования let. Это все ещё работает, если мы не включаем use strict, чтобы обеспечить совместимость со старыми скриптами.
Это плохая практика, т.к. приводит к ошибке в строгом режиме.

Константы.
Чтобы объявить постоянную (неизменяемую переменную), надо использовать const вместо let.
Переменные, объявленные с помощью const, называются константами, и их нельзя изменить. Попытка сделать это приведёт к ошибке.
Широко распространена практика использования констант в качестве псевдонимов для трудно запоминаемых значений, которые известны до начала исполнения скрипта. Названия таких констант обычно пишутся с использованием заглавных букв и подчёркивания.
	const COLOR_RED = "#F00";
Есть константы, которые известны до выполнения (например, шестнадцатеричное значение для красного цвета), а есть константы, которые вычисляются во время выполнения сценария, но не изменяются после их первоначального назначения, напр.:
	const pageLoadTime = /* время, потраченное на загрузку веб-страницы */;
Значение pageLoadTime неизвестно до загрузки страницы, поэтому её имя записано обычными, а не прописными буквами. Но это всё ещё константа, потому что она не изменяется после назначения. Другими словами, константы с именами, записанными заглавными буквами, используются только как псевдонимы для «жёстко закодированных» значений.
С помощью ключевого слова const можно также объявлять объекты и массивы, элементы которых впоследствии могут меняться, неизменным остаётся только их тип.

Название переменной должно иметь ясный и понятный смысл, говорить о том, какие данные в ней хранятся.
Несколько хороших правил:
	- Используйте легко читаемые имена, такие как userName или shoppingCart.
	- Избегайте использования аббревиатур или коротких имён, таких как a, b, c, за исключением тех случаев, когда вы точно знаете, что так нужно.
	- Делайте имена максимально описательными и лаконичными. Примеры плохих имён: data и value. Такие имена ничего не говорят. Их можно использовать только в том случае, если из контекста кода очевидно, какие данные хранит переменная.
	- Договоритесь с вашей командой об используемых терминах. Если посетитель сайта называется «user», тогда мы должны называть связанные с ним переменные currentUser или newUser, а не, к примеру, currentVisitor или newManInTown.
Дополнительная переменная – это добро, а не зло. Современные JS-минификаторы и браузеры оптимизируют код достаточно хорошо, поэтому он не создаёт проблем с производительностью. Использование разных переменных для разных значений может даже помочь движку оптимизировать ваш код.

#1.2.5. Типы данных
6.1.25 - https://learn.javascript.ru/types
Значение в JS всегда относится к данным определённого типа. Например, это может быть строка или число.
Переменная в JS может содержать любые данные. В один момент там может быть строка, а в следующий – число.
Такие языки программирования называются динамически типизированными. Это значит, что типы данных есть, но переменные не привязаны ни к одному из них.

В JS есть восемь основных типов данных:
Семь из них называют "примитивными" типами данных:
	1. число / number // для любых чисел: целых или с плавающей точкой; целочисленные значения ограничены диапазоном ±((2^53)-1).
	2. большое число / bigint // для целых чисел произвольной длины.
	3. строка / string // для строк. Строка может содержать ноль или больше символов.
	4. логический тип / boolean // для true/false.
	5. нулевой тип (значение ноль) / null // для неизвестных значений – отдельный тип, имеющий одно значение null.
	6. неопределённое значение / undefined // для неприсвоенных значений – отдельный тип, имеющий одно значение undefined.
	7. символ / symbol // для уникальных идентификаторов.
И один не является "примитивным" и стоит особняком:
	8. объект / object // для более сложных структур данных.

1. Числа (number).
Числовой тип данных (number) представляет как целочисленные значения, так и числа с плавающей точкой. 
Существует множество операций для чисел, например, умножение *, деление /, сложение +, вычитание - и так далее.
Кроме обычных чисел, есть так называемые "специальные числовые значения", которые относятся к этому типу данных: Infinity, -Infinity и NaN.
	Infinity представляет собой математическую бесконечность ∞. Это особое значение, которое больше любого числа. Мы можем получить его в результате деления на ноль, или задать его явно:
		let a = Infinity;
		console.log(a); // Infinity
	-Infinity - отрицательная бесконечность.
		let b = -Infinity;
		console.log(b); // -Infinity
	NaN (Not-a-Number) означает вычислительную ошибку. Это результат неправильной или неопределённой математической операции, например: строка / число.
		Значение NaN "прилипчиво". Любая математическая операция с NaN возвращает NaN. Если где-то в математическом выражении есть NaN, то оно распространяется на весь результат (есть только одно исключение: NaN ** 0 равно 1).
		console.log(a+b); // NaN
Математические операции в JS безопасны. Мы можем делать что угодно: делить на ноль, обращаться с нечисловыми строками как с числами и т.д. Скрипт никогда не остановится с фатальной ошибкой (не умрёт). В худшем случае мы получим NaN как результат выполнения.

2. Большие числа (BigInt).
Тип number не может безопасно работать с числами, большими, чем (2^53)-1 (т. е. 9007199254740991) или меньшими, чем -((2^53)-1) для отрицательных чисел.
Если говорить совсем точно, то, технически, тип number может хранить большие целые числа (до 1.7976931348623157 * 10^308), но за пределами безопасного диапазона целых чисел ±((2^53)-1) будет ошибка точности, так как не все цифры помещаются в фиксированную 64-битную память. Поэтому можно хранить "приблизительное" значение.
Например, эти два числа (прямо за пределами безопасного диапазона) совпадают:
	console.log(9007199254740991 + 1); // 9007199254740992
	console.log(9007199254740991 + 2); // 9007199254740992
То есть все нечетные целые числа, большие чем ((2^53)-1), вообще не могут храниться в типе number.
В большинстве случаев безопасного диапазона чисел от -((2^53)-1) до ((2^53)-1) вполне достаточно, но иногда нам требуется весь диапазон действительно гигантских целых чисел без каких-либо ограничений или пропущенных значений внутри него. Например, в криптографии или при использовании метки времени (timestamp) с микросекундами.
Тип BigInt был добавлен в JS, чтобы дать возможность работать с целыми числами произвольной длины.
Чтобы создать значение типа BigInt, необходимо добавить n в конец числового литерала:
	const bigInt = 1234567890123456789012345678901234567890n; // символ "n" в конце означает, что это BigInt
// В данный момент BigInt поддерживается только в браузерах Firefox, Chrome, Edge и Safari, но не поддерживается в IE.

3. Строка (string).
Строка (string) в JS должна быть заключена в кавычки.
	let str = "Привет";
	let str2 = 'Одинарные кавычки тоже подойдут';
	let phrase = `Обратные кавычки позволяют встраивать переменные ${str}`;
В JS существует три типа кавычек:
	- Двойные кавычки: "Привет".
	- Одинарные кавычки: 'Привет'.
	- Обратные кавычки: `Привет`.
Двойные или одинарные кавычки являются простыми, между ними нет разницы в JS. 
Обратные же кавычки имеют расширенную функциональность, они позволяют нам встраивать выражения в строку, заключая их в ${…}.
	console.log(`результат: ${1 + 2}`); // результат: 3
Выражение внутри ${…} вычисляется, и его результат становится частью строки. Мы можем положить туда всё, что угодно: переменную name, или выражение 1 + 2, или что-то более сложное.
// Обратите внимание, что это можно делать только в обратных кавычках. Другие кавычки не имеют такой функциональности встраивания.

В JS нет отдельного типа данных для одного символа.
В некоторых языках, например C и Java, для хранения одного символа, например "a" или "%", существует отдельный тип. В языках C и Java это char. В JS подобного типа нет, есть только тип string. Строка может содержать ноль символов (быть пустой), один символ или множество.

4. Булевый (логический) тип (boolean).
Булевый тип (boolean) может принимать только два значения: true (истина) и false (ложь).
Такой тип, как правило, используется для хранения значений да/нет: true значит да (верно), а false значит нет (не верно).
Булевые значения также могут быть результатом сравнений.

5. Нулевой тип (значение ноль) (null).
Специальное значение null не относится ни к одному из типов, описанных выше.
Оно формирует отдельный тип, который содержит только значение null: 
	let age = null;
В JS null не является "ссылкой на несуществующий объект" или нулевым указателем, как в некоторых других языках. Это просто специальное значение, которое представляет собой "ничего", "пусто" или "значение неизвестно". В приведённом выше примере указано, что значение переменной age неизвестно.

6. Неопределённое значение (undefined).
Специальное значение undefined также стоит особняком. Оно формирует тип из самого себя так же, как и null. Оно означает, что "значение не было присвоено". Если переменная объявлена, но ей не присвоено никакого значения, то её значением будет undefined.
Технически мы можем присвоить значение undefined любой переменной, …но так делать не рекомендуется. Обычно null используется для присвоения переменной "пустого" или "неизвестного" значения, а undefined – для проверок, была ли переменная назначена.

7. Символ (symbol).
Тип symbol (символ) используется для создания уникальных идентификаторов в объектах. Мы упоминаем здесь о нём для полноты картины, изучим этот тип после объектов.

8. Объект (Object).
Тип object (объект) – особенный. Все остальные основные типы называются "примитивными", потому что их значениями могут быть только простые значения (будь то строка, или число, или что-то ещё). В объектах же хранят коллекции данных или более сложные структуры. Массивы и функции относятся к объектному типу. 
Объект - это последовательность значений: let obj = {elem1, elem2, ...}; // элементы могут быть любых типов данных.

Оператор typeof.
Оператор typeof возвращает тип аргумента. Это полезно, когда мы хотим обрабатывать значения различных типов по-разному или просто хотим сделать проверку. У него есть две синтаксические формы:
	- Обычный синтаксис: typeof 5 // вернёт: number
	- Синтаксис, напоминающий вызов функции (встречается реже): typeof(5) // Также выведет "number"
Если передается выражение, то нужно заключать его в скобки, т.к. typeof имеет более высокий приоритет, чем бинарные операторы:
	typeof 50 + " Квартир"; // вернёт: number Квартир
	typeof (50 + " Квартир"); // вернёт: string
Другими словами, скобки необходимы для определения типа значения, которое получилось в результате выполнения выражения в них.
Например:
	typeof undefined // undefined
	typeof 0 // number
	typeof 10n // bigint
	typeof true // boolean
	typeof 'foo' // string
	typeof Symbol('id') // symbol
	typeof Math // object (Math — это встроенный объект, который предоставляет математические операции и константы. Мы рассмотрим его подробнее в главе Числа. Здесь он служит лишь примером объекта.)
	typeof null // object (Результатом вызова typeof null является "object". Это официально признанная ошибка в typeof, ведущая начало с времён создания JS и сохранённая для совместимости. Конечно, null не является объектом. Это специальное значение с отдельным типом.)
	typeof alert // function (Вызов typeof alert возвращает "function", потому что alert является функцией. Мы изучим функции в следующих главах, где заодно увидим, что в JS нет специального типа функция. Функции относятся к объектному типу. Но typeof обрабатывает их особым образом, возвращая "function". Так тоже повелось от создания JS. Формально это неверно, но может быть удобным на практике.)
Оператор typeof позволяет нам увидеть, какой тип данных сохранён в переменной. Имеет две формы: typeof x или typeof(x). Возвращает строку с именем типа. Например, "string". Для null возвращается "object" – это ошибка в языке, на самом деле это не объект.

#1.2.6. Взаимодействие: alert, prompt, confirm
10.1.25 - https://learn.javascript.ru/alert-prompt-confirm
Функции интерфейса браузера: alert, prompt, confirm:

alert - показывает сообщение.
alert("выводимый тескт"); //  показывает сообщение "выводимый тескт" и ждёт, пока пользователь нажмёт кнопку ОК.
// Это окно с сообщением называется модальным окном. Понятие модальное означает, что пользователь не может взаимодействовать с интерфейсом остальной части страницы, нажимать на другие кнопки и т.д. до тех пор, пока взаимодействует с окном. В данном случае – пока не будет нажата кнопка OK.

prompt - показывает сообщение и запрашивает ввод текста от пользователя. Возвращает напечатанный в поле ввода текст или null, если была нажата кнопка Отмена или Esc с клавиатуры.
result = prompt(title, [default]); // отобразит модальное окно с текстом, полем для ввода текста и кнопками OK/Отмена.
	// title - Текст для отображения в окне.
	// default - Необязательный второй параметр, который устанавливает начальное значение в поле для текста в окне.
Пользователь может напечатать что-либо в поле ввода и нажать OK. Введённый текст будет присвоен переменной result. Пользователь также может отменить ввод нажатием на кнопку Отмена или нажав на клавишу Esc. В этом случае значением result станет null.
Вызов prompt возвращает текст, указанный в поле для ввода, или null, если ввод отменён.
// Второй параметр является необязательным, но не для IE; и если не указать его, то IE вставит строку "undefined" в поле для ввода.

confirm - показывает сообщение и ждёт, пока пользователь нажмёт OK или Отмена. Возвращает true, если нажата OK, и false, если нажата кнопка Отмена или Esc с клавиатуры.
result = confirm(question); // отображает модальное окно с текстом вопроса question и двумя кнопками: OK и Отмена. Возвращает true, если нажата кнопка OK, иначе – false.

Все эти методы являются модальными: останавливают выполнение скриптов и не позволяют пользователю взаимодействовать с остальной частью страницы до тех пор, пока окно не будет закрыто.
На все указанные методы распространяются два ограничения:
	- Расположение окон определяется браузером. Обычно окна находятся в центре.
	- Визуальное отображение окон зависит от браузера, и мы не можем изменить их вид.
Такова цена простоты. Есть другие способы показать более приятные глазу окна с богатой функциональностью для взаимодействия с пользователем, но если "навороты" не имеют значения, то данные методы работают отлично.

#1.2.7. Преобразование типов
10.1.25 - https://learn.javascript.ru/type-conversions
Разберём преобразование примитивных значений.

Строковое преобразование происходит, когда требуется представление чего-либо в виде строки.
Функция String(value), преобразует значение в строкe:
	value = String(value); // value становится строкой

Численное преобразование происходит в математических функциях и выражениях.
Например, когда операция деления / применяется не к числу:
	console.log("6" / "2"); // 3, строки преобразуются в числа
Можно использовать функцию Number(value), чтобы явно преобразовать value к числу:
	let num = Number(str); // str становится числом num
Явное преобразование часто применяется, когда мы ожидаем получить число из строкового контекста, например из текстовых полей форм.
Если строка не может быть явно приведена к числу, то результатом преобразования будет NaN.

Правила численного преобразования:
Значение		Преобразуется в…
undefined		NaN
null			0
true / false	1 / 0
string			Пробельные символы (пробелы, знаки табуляции \t, знаки новой строки \n и т. п.) по краям обрезаются. Далее, если остаётся пустая строка, то получаем 0, иначе из непустой строки считывается число. При ошибке результат NaN.
// Учтите, что null и undefined ведут себя по-разному. Так, null становится нулём, тогда как undefined приводится к NaN.

Логическое преобразование.
Происходит в логических операциях, но также может быть выполнено явно с помощью функции Boolean(value).
	value = Boolean(value); // value становится boolean
Правило преобразования:
	- Значения, которые интуитивно пустые, вроде 0, пустой строки, null, undefined и NaN, становятся false.
	// строка с нулём "0" или с пробелом " " — это true
	- Все остальные значения становятся true.
// Заметим, что строка с нулём "0" — это true; Некоторые языки (к примеру, PHP) воспринимают строку "0" как false. Но в JS, если строка не пустая, то она всегда true.
		Значение						Становится…
	0, null, undefined, NaN, ""		false
	любое другое значение			true

Особые случаи, в которых часто допускаются ошибки:
	undefined при численном преобразовании становится NaN, не 0.
	"0" и строки из одних пробелов типа " " при логическом преобразовании всегда true.

#1.2.8. Базовые операторы, математика
13.1.25 - https://learn.javascript.ru/operators
Операнд – то, к чему применяется оператор. 
// Например, в умножении 5 * 2 есть два операнда: левый операнд равен 5, а правый операнд равен 2. Иногда их называют аргументами.
Унарным называется оператор, который применяется к одному операнду.
// Например, оператор унарный минус "-" меняет знак числа на противоположный.
Бинарным называется оператор, который применяется к двум операндам.
// бинарный минус выполняет вычитание. 
// Формально, в последних примерах мы говорим о двух разных операторах, использующих один символ: оператор отрицания (унарный оператор, который обращает знак) и оператор вычитания (бинарный оператор, который вычитает одно число из другого).

Поддерживаются следующие математические операторы:
	Сложение +,
	Вычитание -,
	Умножение *,
	Деление /,
	Взятие остатка от деления %,
	Возведение в степень **.

Взятие остатка %.
Оператор взятия остатка %, несмотря на обозначение, никакого отношения к процентам не имеет.
Результат a % b – это остаток от целочисленного деления a на b.
	console.log(5 % 2); // 1, остаток от деления 5 на 2

Возведение в степень **.
Оператор возведения в степень a ** b возводит a в степень b.
// В других языках это записывается как a^b.
	console.log(9 ** (1/2)); // 3 (степень 1/2 эквивалентна взятию квадратного корня)

Особенности оператора +.
Если бинарный оператор сложения '+' применить к строкам, то он их объединяет в одну.
	console.log('одна' + 'строка'); // однастрока
Если хотя бы один операнд является строкой, то второй будет также преобразован в строку.
	console.log(2 + 2 + '1' ); // "41", а не "221"
Сложение и преобразование строк — это особенность бинарного плюса +. 
Другие арифметические операторы (например, вычитание и деление) работают только с числами и всегда преобразуют операнды в числа:
	console.log("6" / "2"); // 3
Плюс + существует в двух формах: бинарной, которую мы использовали выше, и унарной.
Унарный, то есть применённый к одному значению, плюс + ничего не делает с числами. Но если операнд не число, унарный плюс преобразует его в число.
	console.log( +true ); // 1
	console.log( +"" ); // 0
// На самом деле это то же самое, что и Number(...), только короче.

Приоритет операторов
В том случае, если в выражении есть несколько операторов – порядок их выполнения определяется приоритетом, или, другими словами, существует определённый порядок выполнения операторов.
Например, в математике умножение имеет более высокий приоритет, чем сложение.
Скобки важнее, чем приоритет, поэтому можно использовать их, чтобы изменить приоритет. Например: (1 + 2) * 2.

Отрывок из таблицы приоритетов :
Приоритет	Название		Обозначение
	15		унарный плюс			+
	15		унарный минус			-
	14		возведение в степень	**
	13		умножение				*
	13		деление					/
	12		сложение				+
	12		вычитание				-
	2		присваивание			=
// Каждый оператор имеет соответствующий номер приоритета. Тот, у кого это число больше, – выполнится раньше. Если приоритет одинаковый, то порядок выполнения – слева направо.
// приоритет унарных операторов выше, чем соответствующих бинарных

Полная таблица приоритетов:
https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Operator_precedence
Приоритет	Тип оператора				Ассоциативность		Конкретные операторы
	18		Группировка					не определено		( … )
	17		Доступ к свойствам			слева направо		… . …
			Доступ к свойствам с возможностью вычисления	… [ … ]
			new (со списком аргументов)	не определено		new … ( … )
			Вызов функции				слева направо		… ( … )
			Оператор опциональной последовательности (?.)	?.
	16		new (без списка аргументов)	справа налево		new …
	15		Постфиксный инкремент		не определено		… ++
			Постфиксный декремент							… --
	14		Логическое отрицание (!)	справа налево		! …
			Побитовое отрицание 							(~)	~ …
			Унарный плюс									+ …
			Унарный минус									- …
			Префиксный инкремент							++ …
			Префиксный декремент							-- …
			typeof											typeof …
			void											void …
			delete											delete …
			await											await …
	13		Возведение в степень (**)	справа налево		… ** …
	12		Умножение (*)				слева направо		… * …
			Деление /										… / …
			Остаток от деления (%)							… % …
	11		Сложение (+)				слева направо		… + …
			Вычитание (-)									… - …
	10		Побитовый сдвиг влево (<<)	слева направо		… << …
			Побитовый сдвиг вправо (>>)						… >> …
			Сдвиг вправо с заполнением нулей (>>>)			… >>> …
	9		Меньше (<)					слева направо		… < …
			Меньше или равно (<=)							… <= …
			Больше (>)										… > …
			Больше или равно (>=)							… >= …
			in												… in …
			instanceof										… instanceof …
	8		Равенство (==)				слева направо		… == …
			Неравенство (!=)								… != …
			Строгое равенство (===)							… === …
			Строгое неравенство (!==)						… !== …
	7		Побитовое «И» (&)			слева направо		… & …
	6		Побитовое исключающее «ИЛИ» (^)	слева направо	… ^ …
	5		Побитовое «ИЛИ» (|)			слева направо		… | …
	4		Логическое «И» (&&)			слева направо		… && …
	3		Логическое «ИЛИ» (||)		слева направо		… || …
			Оператор нулевого слияния (??)					… ?? …
	2		Присваивание				справа налево		… = …
															… += …
															… -= …
															… **= …
															… *= …
															… /= …
															… %= …
															… <<= …
															… >>= …
															… >>>= …
															… &= …
															… ^= …
															… |= …
															… &&= …
															… ||= …
															… ??= …
			Условный (тернарный) оператор	справа налево	… ? … : …
			yield						справа налево		yield …
			yield*											yield* …
	1		Запятая / Последовательность	слева направо	… , …

Присваивание =
У оператора присваивания = один из самых низких приоритетов: 2.
Именно поэтому, когда переменной что-либо присваивают, например, x = 2 * 2 + 1, то сначала выполнится арифметика, а уже затем произойдёт присваивание = с сохранением результата в x.
Оператор присваивания = возвращает значение.
Большинство операторов в JS возвращают значение. Для некоторых это очевидно, например сложение + или умножение *. Но и оператор присваивания не является исключением.
Вызов x = value записывает value в x и возвращает его.
Благодаря этому присваивание можно использовать как часть более сложного выражения.
	console.log(c = 3 - (a = (b = 2) + 1)); // 0
// Однако писать самим в таком стиле не рекомендуется. 

Присваивание по цепочке.
В JS есть интересная возможность: цепочка присваиваний.
Например: 
	a = b = c = 2 + 2;
	console.log(a, b, c); // 4 4 4
// Такое присваивание работает справа налево. Сначала вычисляется самое правое выражение 2 + 2, и затем результат присваивается переменным слева: c, b и a. В конце у всех переменных будет одно значение.

Сокращённая арифметика с присваиванием.
Часто нужно применить оператор к переменной и сохранить результат в ней же.
Например:
	let n = 2;
	n = n + 5;
	n = n * 2;
Эту запись можно укоротить при помощи совмещённых операторов += и *=:
	n += 5; // теперь n = 7 (работает как n = n + 5)
	n *= 2; // теперь n = 14 (работает как n = n * 2)
	console.log(n); // 14
Подобные краткие формы записи существуют для всех арифметических и побитовых операторов: /=, -=, **= и так далее.
Вызов с присваиванием имеет в точности такой же приоритет, как обычное присваивание, то есть выполнится после большинства других операций.

Инкремент/декремент.
Одной из наиболее частых числовых операций является увеличение или уменьшение на единицу.
Для этого существуют специальные операторы:
	Инкремент ++ увеличивает переменную на 1: n++
	Декремент -- уменьшает переменную на 1: n--
Инкремент/декремент можно применить только к переменной. Попытка использовать его на значении, типа 5++, приведёт к ошибке.
Операторы ++ и -- могут быть расположены не только после, но и до переменной.
Когда оператор идёт после переменной — это постфиксная форма: n++.
Префиксная форма — это когда оператор идёт перед переменной: ++n.
Обе эти инструкции делают одно и то же: увеличивают n на 1, но есть отличия:
	Операторы инкремента/декремента возвращают значения. Префиксная форма возвращает новое значение, в то время как постфиксная форма возвращает старое (до увеличения/уменьшения числа). Поэтому если результат оператора не используется, а нужно только увеличить/уменьшить переменную, тогда без разницы, какую форму использовать.
	Если хочется тут же использовать результат, то нужна префиксная форма: ++n.
	Если нужно увеличить и при этом получить значение переменной до увеличения – нужна постфиксная форма: n++.
Инкремент/декремент можно использовать в любых выражениях. Операторы ++/-- могут также использоваться внутри выражений. Их приоритет выше, чем у большинства других арифметических операций.

Побитовые операторы.
Побитовые операторы работают с 32-разрядными целыми числами (при необходимости приводят к ним), на уровне их внутреннего двоичного представления. Эти операторы не являются чем-то специфичным для JS, они поддерживаются в большинстве языков программирования.
Поддерживаются следующие побитовые операторы:
	AND(и) ( & )
	OR(или) ( | )
	XOR(побитовое исключающее или) ( ^ )
	NOT(не) ( ~ )
	LEFT SHIFT(левый сдвиг) ( << )
	RIGHT SHIFT(правый сдвиг) ( >> )
	ZERO-FILL RIGHT SHIFT(правый сдвиг с заполнением нулями) ( >>> )
Они используются редко, когда возникает необходимость оперировать с числами на очень низком (побитовом) уровне. В ближайшем времени они нам не понадобятся, так как веб-разработчики редко к ним прибегают, хотя в некоторых сферах (например, в криптографии) они полезны.
Вы можете прочитать о них в главе Побитовые операторы, когда возникнет реальная необходимость.

Оператор запятая.
Оператор запятая (,) редко применяется и является одним из самых необычных. Иногда он используется для написания более короткого кода.
Оператор запятая предоставляет возможность вычислять несколько выражений, разделяя их запятой ,. Каждое выражение выполняется, но возвращается результат только последнего.
Например:
	let a = (1 + 2, 3 + 4);
	console.log(a); // 7 (результат вычисления 3 + 4)
// Первое выражение 1 + 2 выполняется, а результат отбрасывается. Затем идёт 3 + 4, выражение выполняется и возвращается результат.

console.log("" + 1 + 0); // 10
console.log("" - 1 + 0); // -1 (пустая строка, становится 0 после численного преобразования).
console.log(true + false); // 1
console.log(6 / "3"); // 2
console.log("2" * "3"); // 6
console.log(4 + 5 + "px"); // 9px
console.log("$" + 4 + 5); // $45
console.log("4" - 2); // 2
console.log("4px" - 2); // NaN
console.log("  -9  " + 5); //   -9  5
console.log("  -9  " - 5); // -14
console.log(null + 1); // 1 (null становится 0 после численного преобразования).
console.log(undefined + 1); // NaN (undefined становится NaN после численного преобразования).
console.log(" \t \n" - 2); // -2 (строка " \t \n", аналогично пустой строке, становится 0 после численного преобразования).
=> 11.5 из 14

#1.2.9. Операторы сравнения
14.1.25 - https://learn.javascript.ru/comparison
Операторы сравнения в JS записываются так:
	Больше/меньше: a > b, a < b.
	Больше/меньше или равно: a >= b, a <= b.
	Равно: a == b. Для сравнения используется двойной знак равенства ==. Один знак равенства a = b означал бы присваивание.
	Не равно. В математике обозначается символом ≠, но в JS записывается как a != b.
Все операторы сравнения возвращают значение логического типа:
	true – означает да, верно, истина.
	false – означает нет, неверно, ложь.
Результат сравнения можно присвоить переменной, как и любое значение.

Сравнение строк.
Чтобы определить, что одна строка больше другой, JS использует алфавитный или лексикографический порядок.
Другими словами, строки сравниваются посимвольно. Например:
	console.log( 'Я' > 'А' ); // true
	console.log( 'Коты' > 'Кода' ); // true
	console.log( 'Сонный' > 'Сон' ); // true
Алгоритм сравнения двух строк довольно прост:
	1. Сначала сравниваются первые символы строк.
	2. Если первый символ первой строки больше (меньше), чем первый символ второй, то первая строка больше (меньше) второй. Сравнение завершено.
	3. Если первые символы равны, то таким же образом сравниваются уже вторые символы строк.
	4. Сравнение продолжается, пока не закончится одна из строк.
	5. Если обе строки заканчиваются одновременно, то они равны. Иначе, большей считается более длинная строка.
При этом используется кодировка Unicode, а не настоящий алфавит. 
// Например, в JS имеет значение регистр символов. Заглавная буква "A" не равна строчной "a". Какая же из них больше? Строчная "a". Почему? Потому что строчные буквы имеют больший код во внутренней таблице кодирования, которую использует JS (Unicode). 

Сравнение разных типов.
При сравнении значений разных типов JS приводит каждое из них к числу.
Логическое значение true становится 1, а false – 0.
Например:
	console.log( '2' > 1 ); // true (строка '2' становится числом 2)
	console.log( '01' == 1 ); // true (строка '01' становится числом 1)
	console.log( true == 1 ); // true
	console.log( false == 0 ); // true
Возможна следующая ситуация:
Два значения равны, но одно из них true как логическое значение, а другое – false. Например:
	let a = 0;
	console.log( Boolean(a) ); // false
	let b = "0";
	console.log( Boolean(b) ); // true
	console.log(a == b); // true!
Равенство преобразует значения, используя числовое преобразование, поэтому "0" становится 0. В то время как явное преобразование с помощью Boolean использует другой набор правил.

Строгое сравнение ===.
Оператор строгого равенства === проверяет равенство без приведения типов. Другими словами, если a и b имеют разные типы, то проверка a === b немедленно возвращает false без попытки их преобразования.
Также есть оператор строгого неравенства !==, аналогичный !=.
Оператор строгого равенства дольше писать, но он делает код более очевидным и оставляет меньше места для ошибок.

Сравнение с null и undefined.
Поведение null и undefined при сравнении с другими значениями — особое:
	1. При строгом равенстве === эти значения различны, так как различны их типы.
		console.log( null === undefined ); // false
	2. При нестрогом равенстве == эти значения равны друг другу и не равны никаким другим значениям. Это специальное правило языка.
		console.log( null == undefined ); // true
	3. При использовании математических операторов и других операторов сравнения < > <= >= значения null/undefined преобразуются к числам: null становится 0, а undefined – NaN.
Странный результат сравнения null и 0.
Сравним null с нулём:
	console.log( null > 0 );  // (1) false
	console.log( null == 0 ); // (2) false
	console.log( null >= 0 ); // (3) true
С точки зрения математики это странно. Результат последнего сравнения говорит о том, что null больше или равно нулю, тогда результат одного из сравнений выше должен быть true, но они оба ложны. Причина в том, что нестрогое равенство и сравнения > < >= <= работают по-разному. Сравнения преобразуют null в число, рассматривая его как 0. Поэтому выражение (3) null >= 0 истинно, а null > 0 ложно. С другой стороны, для нестрогого равенства == значений undefined и null действует особое правило: эти значения ни к чему не приводятся, они равны друг другу и не равны ничему другому. Поэтому (2) null == 0 ложно.
// null и 0 имеют разные типы данных (null и number соответственно), и алгоритм абстрактного равенства не считает их равными.

Значение undefined несравнимо с другими значениями:
	console.log( undefined > 0 ); // false (1)
	console.log( undefined < 0 ); // false (2)
	console.log( undefined == 0 ); // false (3)
Почему же сравнение undefined с нулём всегда ложно? На это есть следующие причины:
	- Сравнения (1) и (2) возвращают false, потому что undefined преобразуется в NaN, а NaN – это специальное числовое значение, которое возвращает false при любых сравнениях.
	- Нестрогое равенство (3) возвращает false, потому что undefined равно только null, undefined и ничему больше.

Можно избежать проблем, если следовать надёжным правилам:
	- Относитесь очень осторожно к любому сравнению с undefined/null, кроме случаев строгого равенства ===.
	- Не используйте сравнения >= > < <= с переменными, которые могут принимать значения null/undefined, разве что вы полностью уверены. Если переменная может принимать эти значения, то добавьте для них отдельные проверки.

Итого:
- Операторы сравнения возвращают значения логического типа.
- Строки сравниваются посимвольно в лексикографическом порядке.
- Значения разных типов при сравнении приводятся к числу. Исключением является сравнение с помощью операторов строгого равенства/неравенства.
- Значения null и undefined равны == друг другу и не равны любому другому значению.
- Будьте осторожны при использовании операторов сравнений вроде > и < с переменными, которые могут принимать значения null/undefined. Хорошей идеей будет сделать отдельную проверку на null/undefined.

console.log(5 > 4); // true
console.log("ананас" > "яблоко"); // false
console.log("2" > "12"); // true
console.log(undefined == null); // true
console.log(undefined === null); // false
console.log(null == "\n0\n"); // false
console.log(null === +"\n0\n"); // false
=> 5 из 7

#1.2.10. Условное ветвление: if, '?'
17.1.25 - https://learn.javascript.ru/ifelse
Инструкция if (...) вычисляет условие в скобках и, если результат true, то выполняет блок кода далее.
Если мы хотим выполнить более одной инструкции, то нужно заключить блок кода в фигурные скобки.
Рекомендуется всегда использовать фигурные скобки {}, даже если выполняется только одна команда. Это улучшает читаемость кода.
Инструкция if (…) вычисляет выражение в скобках и преобразует результат к логическому типу.
	- Число 0, пустая строка "", null, undefined и NaN становятся false. Из-за этого их называют ложными (falsy) значениями.
	- Остальные значения становятся true, поэтому их называют правдивыми (truthy).
Т.о. код при таком условии никогда не выполнится:
	if (0) {...} // 0 is falsy
…а при таком – выполнится всегда:
	if (1) {...} // 1 is truthy
Инструкция if может содержать необязательный блок else (иначе). Он выполняется, когда условие ложно.
Иногда нужно проверить несколько вариантов условия. Для этого используется блок else if.
Блоков else if может быть несколько. Присутствие блока else не является обязательным.

Тернарный оператор, единственный в своём роде, имеет три аргумента. Синтаксис:
	let result = условие ? если_истинно : если_ложно;
Оператор ? имеет низкий приоритет, поэтому он выполняется после других арифметических операторов, однако в случае сложных выражений условия его надо записывать в скобках.
Cкобки делают код более простым для восприятия, поэтому рекомендуется их использовать.
Последовательность операторов вопросительного знака ? позволяет вернуть значение, которое зависит от более чем одного условия.
	let message = (login == 'Сотрудник') ? 'Привет' :
		(login == 'Директор') ? 'Здравствуйте' :
		(login == '') ? 'Нет логина' : '';
Иногда оператор ? используется в качестве замены if.
	let company = prompt('Какая компания создала JavaScript?', '');
	(company == 'Netscape') ? alert('Верно!') : alert('Неправильно.');
Не рекомендуется использовать оператор ? таким образом, т.к. несмотря на то, что такая запись короче, она хуже читается.
	if (company == 'Netscape') {
		alert('Верно!');
	} else {
		alert('Неправильно.');
	};
При чтении глаза сканируют код по вертикали. Блоки кода, занимающие несколько строк, воспринимаются гораздо легче, чем длинный горизонтальный набор инструкций.
Смысл оператора "вопросительный знак" ? – вернуть то или иное значение, в зависимости от условия. Используйте его именно для этого. Когда вам нужно выполнить разные ветви кода – используйте if.

#1.2.11. Логические операторы
18.1.25 - https://learn.javascript.ru/logical-operators
В JS есть семь логических операторов:
	1. || (Оператор логического ИЛИ)
	2. ||= (Оператор логического присваивания ИЛИ)
	3. && (Оператор логического И)
	4. &&= (Оператор логического присваивания И)
	5. ! (Оператор логического НЕ)
	6. ?? (Оператор нулевого слияния)
	7. ??= (Оператор нулевого присваивания)
Несмотря на своё название, данные операторы могут применяться к значениям любых типов. Полученные результаты также могут иметь различный тип.

1. || (Логическое ИЛИ)
Оператор ИЛИ выглядит как двойной символ вертикальной черты:
	result = a || b;
Традиционно в программировании ИЛИ предназначено только для работы с булевыми значениями: в случае, если какой-либо из аргументов true, он вернёт true, в противоположной ситуации возвращается false.
Существует всего четыре возможные логические комбинации:
	console.log( true || true ); // true
	console.log( false || true ); // true
	console.log( true || false ); // true
	console.log( false || false ); // false
Если значение не логического типа, то оно к нему приводится в целях вычислений. Например, число 1 будет воспринято как true, а 0 – как false.

ИЛИ "||" находит первое истинное значение.
При выполнении ИЛИ || с несколькими значениями:
	result = value1 || value2 || value3;
Оператор || выполняет следующие действия:
	- Вычисляет операнды слева направо.
	- Каждый операнд конвертирует в логическое значение. Если результат true, останавливается и возвращает исходное значение этого операнда.
	- Если все операнды являются ложными (false), возвращает последний из них.
Значение возвращается в исходном виде, без преобразования.
Другими словами, цепочка ИЛИ || возвращает первое истинное значение или последнее, если такое значение не найдено.
	console.log( 1 || 0 ); // 1 (1 - истинное значение)
	console.log( true || 'какая-то строка' ); // true
	console.log( null || 1 ); // 1 (первое истинное значение)
	console.log( null || 0 || 1 ); // 1 (первое истинное значение)
	console.log( undefined || null || 0 ); // 0 (поскольку все ложно, возвращается последнее значение)
Это делает возможным более интересное применение оператора по сравнению с "чистым, традиционным, только булевым ИЛИ".
(1) Получение первого истинного значения из списка переменных или выражений.
	Например, есть необязательные переменные firstName, lastName и nickName, т.е. они могут быть неопределенными или иметь ложные значения.
		console.log( firstName || lastName || nickName || "Аноним"); 
	Если все переменные будут ложными, в качестве результата будет "Аноним".
(2) Сокращённое вычисление.
	Это означает, что ИЛИ || обрабатывает свои операнды до тех пор, пока не будет достигнуто первое истинностное значение, и затем это значение сразу же возвращается, даже не затрагивая другие операнды. Важность этой особенности становится очевидной, если операнд – это не просто значение, а выражение с сопутствующим эффектом, как, например, присваивание переменной или вызов функции.
	В приведенном примере срабатывает только второй alert:
		true || alert("никогда не сработает");
		false || alert("сработает");
	В первой строке оператор ИЛИ || останавливает выполнение сразу после того, как сталкивается с истинным значением (true), поэтому сообщение не показывается. Иногда используют эту возможность для выполнения инструкций только в том случае, если условие в левой части является ложным.

2. ||= (Логическое присваивание ИЛИ)
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Оператор логического присваивания ИЛИ ||= записывается как обычный ИЛИ || с добавлением символа присваивания =. Результат выполнения данного оператора напрямую зависит от действий уже известного ||.
	синтаксис: a ||= b; (равнозначно: a || (a = b);)
Оператор ||= принимает два операнда и выполняет следующие действия:
	- Вычисляет операнды слева направо.
	- Конвертирует a в логическое значение.
	- Если a ложно, присваивает a значение b.
Концепция оператора ||= заключается в "сокращённом вычислении", принцип работы которого мы разобрали ранее.
Перепишем a ||= b под вид "сокращённого вычисления": a || (a = b);
Как известно, ИЛИ || возвращает первое истинное значение, поэтому, если a является таковым, вычисление до правой части выражения не дойдёт.
Например:
	manufacturer ||= "Неизвестный производитель"; // если значения нет (false), то manufacturer = "Неизвестный производитель" ;
	// то же что и: false || (manufacturer = "Неизвестный производитель");
Оператор логического присваивания ИЛИ ||= – это "синтаксический сахар", добавленный в качестве более короткого варианта if-выражений с присваиванием.

3. && (Логическое И)
Оператор И пишется как два амперсанда &&:
	result = a && b;
В традиционном программировании оператор И возвращает true, если оба аргумента истинны, а иначе – false:
	console.log( true && true ); // true
	console.log( false && true ); // false
	console.log( true && false ); // false
	console.log( false && false ); // false
Как и в случае с ИЛИ, любое значение допускается в качестве операнда И:
	if (1 && 0) {alert("не сработает, т.к. результат ложный")} // вычисляется как true && false

Оператор И (&&) находит первое ложное значение.
При нескольких подряд операторах И: 
	result = value1 && value2 && value3;
Оператор && выполняет следующие действия:
- Вычисляет операнды слева направо.
- Каждый операнд преобразует в логическое значение. Если результат false, останавливается и возвращает исходное значение этого операнда.
- Если все операнды были истинными, возвращается последний.
=> И возвращает первое ложное значение (или последнее, если ничего не найдено), а ИЛИ – первое истинное.
Например:
	console.log( 1 && 0 ); // 0
	console.log( 1 && 5 ); // 5
	console.log( null && 5 ); // null
	console.log( 0 && "какая-то строка" ); // 0
Можно передать несколько значений подряд. В таком случае возвратится первое ложное значение, на котором остановились вычисления.
	console.log( 1 && 2 && null && 3 ); // null
Когда все значения верны, возвращается последнее
	console.log( 1 && 2 && 3 ); // 3
Приоритет оператора И && больше, чем ИЛИ ||, так что он выполняется раньше. Т.о. код a && b || c && d по существу такой же, как если бы выражения && были в круглых скобках: (a && b) || (c && d).
Не заменяйте if на || или &&. Несмотря на то, что вариант с && кажется более коротким, if более нагляден и читабелен. Поэтому рекомендуется использовать каждую конструкцию по назначению: использовать if, если нужно if, и использовать &&, если нужно И.

4. &&= (Логическое присваивание И).
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Оператор логического присваивания И &&= записывается как два амперсанда && и символ присваивания =.
	синтаксис: a &&= b; (равнозначно: a && (a = b);)
Принцип действия &&= практически такой же, как и у оператора логического присваивания ИЛИ ||=. Единственное отличие заключается в том, что &&= присвоит a значение b только в том случае, если a истинно.
Концепция оператора логического присваивания И &&= также основывается на "сокращённом вычислении": a && (a = b);
Оператор логического присваивания И &&= также как и ||= является "синтаксическим сахаром", и его можно переписать с использованием привычного if:
	let greeting = "Привет", userName = 'John';
	greeting &&= greeting + ", " + userName; // аналогично true && (greeting = greeting + ", " + userName)
	if (greeting) {greeting = greeting + ", " + userName}; // то же самое
	console.log(greeting); // Привет, John
На практике, в отличие от ||=, оператор &&= используется достаточно редко – обычно, в комбинации с более сложными языковыми конструкциями.

5. ! (Логическое НЕ)
Оператор НЕ представлен восклицательным знаком !.
Синтаксис довольно прост:
	result = !value;
Оператор принимает один аргумент и выполняет следующие действия:
	- Сначала приводит аргумент к логическому типу true/false.
	- Затем возвращает противоположное значение.
Например:
	console.log( !true ); // false
	console.log( !0 ); // true
В частности, двойное НЕ !! используют для преобразования значений к логическому типу:
	console.log( !!"непустая строка" ); // true
	console.log( !!null ); // false
Т.е. первое НЕ преобразует значение в логическое значение и возвращает обратное, а второе НЕ снова инвертирует его. В конце мы имеем простое преобразование значения в логическое.
Есть немного более подробный способ сделать то же самое – встроенная функция Boolean:
	console.log( Boolean("непустая строка") ); // true
	console.log( Boolean(null) ); // false
Приоритет НЕ ! является наивысшим из всех логических операторов, поэтому он всегда выполняется первым, перед && или ||.

console.log( null || 2 || undefined ); // 2
console.log( console.log(1) || 2 || console.log(3) ); // 1 2
// alert() и console.log() возвращают undefined.
console.log( 1 && null && 2 ); // null
console.log( console.log(1) && console.log(2) ); // 1 undefined
console.log( null || 2 && 3 || 4 ); // 3
// Напишите условие if для проверки, что переменная age находится в диапазоне между 14 и 90 включительно.
let age = 40;
if (age >= 14 && age <= 90) {console.log('valid')} else {console.log('error')}; // valid
// Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
if (age < 14 || age > 90) {console.log('valid')} else {console.log('error')}; // error
if (!(age >= 14 && age <= 90)) {console.log('valid')} else {console.log('error')}; // error

let login = prompt('кто там?', '');
if (login === 'admin') {
    let pass = prompt('пароль?', '');
    if (pass === 'admin') {alert('здравствуйте')} 
    else {!pass ? alert('отменено') : alert('неверный пароль')};
} else {!login ? alert('отмена') : alert('я вас не знаю')};

#1.2.12. Операторы нулевого слияния и присваивания: '??', '??='
21.1.25 - https://learn.javascript.ru/nullish-operators
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Оператор нулевого слияния (??).
Оператор нулевого слияния представляет собой два вопросительных знака ??. Он обрабатывает null и undefined одинаковым образом. Для краткости будем говорить, что значение определено, если оно не равняется ни null, ни undefined.
Результат выражения a ?? b будет следующим:
	- если a определено, то a,
	- если a не определено, то b.
Иначе говоря, оператор ?? возвращает первый аргумент, если он не null/undefined, иначе второй.
т.е. для result = a ?? b; result = a - если a есть, иначе result = b.
Оператор нулевого слияния не является чем-то принципиально новым. Это всего лишь удобный синтаксис, как из двух значений получить одно, которое определено.
Выражение result = a ?? b, можно переписать используя уже знакомые операторы:
	result = (a !== null && a !== undefined) ? a : b;
Как правило, оператор ?? нужен для того, чтобы задать значение по умолчанию для потенциально неопределённой переменной.
Например:
	console.log(user ?? "Аноним"); // Аноним (user не существует)
Кроме этого, можно записать последовательность из операторов ??, чтобы получить первое значение из списка, которое не является null/undefined:
	console.log(firstName ?? lastName ?? nickName ?? "Аноним");
// если в приведённом выше коде заменить ?? на ||, то будет тот же самый результат.

Исторически сложилось так, что оператор ИЛИ || появился первым. Он существует с самого начала в JS, поэтому разработчики долгое время использовали его для таких целей. С другой стороны, сравнительно недавно в язык был добавлен оператор нулевого слияния ?? – как раз потому, что многие были недовольны оператором ||.
Важное различие между ними заключается в том, что:
	- || возвращает первое истинное значение.
	- ?? возвращает первое определённое значение.
Проще говоря, оператор || не различает false, 0, пустую строку "" и null/undefined. Для него они все одинаковы, т.е. являются ложными значениями. Если первым аргументом для оператора || будет любое из перечисленных значений, то в качестве результата мы получим второй аргумент. Однако на практике часто требуется использовать значение по умолчанию только тогда, когда переменная является null/undefined. Ведь именно тогда значение действительно неизвестно/не определено.
Например:
	let height = 0;
	console.log(height || 100); // 100
	console.log(height ?? 100); // 0
На практике нулевая высота часто является вполне нормальным значением, которое не следует заменять значением по умолчанию. Таким образом, ?? здесь как раз работает так, как нужно.
Приоритет оператора ?? такой же, как и у ||. Они оба равны 3 в таблице на MDN. Это означает, что, как и ||, оператор нулевого слияния ?? вычисляется до = и ?, но после большинства других операций, таких как +, *.
Например:
	let height = null;
	let width = null;
	console.log((height ?? 100) * (width ?? 50)); // 5000
	console.log(height ?? 100 * width ?? 50); // 0

По соображениям безопасности JavaScript запрещает использование оператора ?? вместе с && и ||, если приоритет явно не указан при помощи круглых скобок.
Выполнение следующего кода приведёт к синтаксической ошибке:
	let x = 1 && 2 ?? 3; // Синтаксическая ошибка Uncaught SyntaxError: Unexpected token '??'
Это, безусловно, спорное ограничение было добавлено в спецификацию языка с целью избежать программные ошибки, при переходе с || на ??.
Используйте скобки, чтобы обойти это ограничение:
	let x = (1 && 2) ?? 3; // Работает без ошибок (x = 2)

Оператор нулевого присваивания (??=).
синтаксис:
	x ??= y
Оператор ??= присвоит x значение y только в том случае, если x не определено (null/undefined).
Предположим, нам необходимо проверить, равна ли переменная null или undefined, и если это так — присвоить этой переменной какое-либо другое значение.
	ранее: 	if (userAge === null || userAge === undefined) userAge = 18;
	теперь:	userAge ??= 18;
Если бы userAge не был равен null/undefined, то выражение справа от ??= никогда бы не выполнилось.

Итого:
- Оператор нулевого слияния ?? — это быстрый способ выбрать первое определённое значение из списка.
- Используется для присвоения переменным значений по умолчанию.
- Оператор ?? имеет очень низкий приоритет, лишь немного выше, чем у ? и =, поэтому при использовании его в выражении, скорее всего, потребуются скобки.
- Запрещено использовать вместе с || или && без явно указанного приоритета, то есть без скобок.
- Для присвоения переменной значения в зависимости от того, определена она или нет, используется оператор нулевого присваивания ??=.

console.log(undefined ?? NaN ?? null ?? "" ?? " "); // NaN

let num1 = 10, num2 = 20, result;
if (result === null || result === undefined) {
    if (num1 !== null && num1 !== undefined) {
        result = num1;
    } else {
        result = num2;
    }
}
result ??= num1 ?? num2; // тоже самое что и if
console.log(result); // 10

#1.2.13. Циклы while и for
22.1.25 - https://learn.javascript.ru/while-for
Для многократного повторения одного участка кода предусмотрены циклы.
Рассмотрим базовые циклы: while, do..while и for(..;..;..).
1. Цикл while.
синтаксис:
	while (условие) {/* код тела цикла */};
Код из тела цикла выполняется, пока условие истинно.
Одно выполнение тела цикла называется итерация. 
Любое выражение или переменная может быть условием цикла: условие while вычисляется и преобразуется в логическое значение.
Например, while (i) – более краткий вариант while (i != 0)
Фигурные скобки не требуются для тела цикла из одной строки. Если тело цикла состоит лишь из одной инструкции, мы можем опустить фигурные скобки {…}.
Например: 
	let i = 3;
	while (i) console.log(i--); // когда i будет равно 0, условие станет ложным, и цикл остановится

2. Цикл do..while.
синтаксис:
	do {/* код тела цикла */} while (условие);
Цикл сначала выполнит тело, а затем проверит условие, и пока его значение равно true, он будет выполняться снова и снова.
Такая форма синтаксиса оправдана, если вы хотите, чтобы тело цикла выполнилось хотя бы один раз, даже если условие окажется ложным. На практике чаще используется форма с предусловием: while(…) {…}.

3. Цикл for.
синтаксис:
	for (начало; условие; шаг) {/* код тела цикла */};
например:
	for (let i = 0; i < 3; i++) console.log(i); // 0 1 2
Алгоритм работы цикла for выглядит следующим образом:
	Выполнить начало
	→ (Если условие == true → Выполнить тело, Выполнить шаг)
	→ ...
	→ (Если условие == false → Закончить работу)
Переменная счётчика i была объявлена прямо в цикле. Это так называемое "встроенное" объявление переменной. Такие переменные существуют только внутри цикла. Вместо объявления новой переменной мы можем использовать уже существующую.
Любая часть for может быть пропущена:
	let i = 0;
	for (; i < 3;) console.log(i++);
Это сделает цикл аналогичным while (i < 3).
А можно и вообще убрать всё, получив бесконечный цикл:
	for (;;) {/* будет выполняться вечно */};
При этом сами точки с запятой ; обязательно должны присутствовать, иначе будет ошибка синтаксиса.

Прерывание цикла: break.
Директива break в строке тела цикла полностью прекращает выполнение цикла и передаёт управление на строку за его телом.
Вообще, сочетание "бесконечный цикл + break" – отличная штука для тех ситуаций, когда условие, по которому нужно прерваться, находится не в начале или конце цикла, а посередине или даже в нескольких местах его тела.
например:
	let sum = 0;
	while (true) {
		let value = +prompt("Введите число", '');
		if (!value) break; // прекращение выполнения цикла
		sum += value;
	}
	alert( 'Сумма: ' + sum );
// код подсчитывает сумму вводимых чисел до тех пор, пока посетитель их вводит, а затем – выдаёт её.

Переход к следующей итерации: continue.
Директива continue прекращает выполнение тела цикла и передаёт управление на следующую итерацию.
Директива continue – облегчённая версия break. При её выполнении цикл не прерывается, а переходит к следующей итерации (если условие все ещё равно true). Её используют, если понятно, что на текущем повторе цикла делать больше нечего.
Например:
	for (let i = 0; i < 10; i++) {
		if (i % 2 == 0) continue; // если true, пропустить оставшуюся часть тела цикла
		console.log(i); // 1, 3, 5, 7, 9
	}; // цикл выводит только нечётные значения
Директива continue позволяет избегать вложенности и делает код более читаемым.

Нельзя использовать break/continue справа от тернарного оператора ?, и их использование вызовет ошибку.
Это ещё один повод не использовать оператор вопросительного знака ? вместо if.

Метки для break/continue.
Метка имеет вид идентификатора с двоеточием перед циклом:
	labelName: for (...) {...}
Вызов break <labelName> в цикле ищет ближайший внешний цикл с такой меткой и переходит в его конец.
Метки используются, когда нужно выйти одновременно из нескольких уровней цикла сразу.
Например:
	outer: for (let i = 0; i < 3; i++) {
		for (let j = 0; j < 3; j++) {
			let input = prompt(`Значение на координатах (${i},${j})`, '');
			if (!input) break outer; // (*) если пустая строка или Отмена, то выйти из обоих циклов
			// сделать что-нибудь со значениями...
		}
	}
	alert('Готово!');
// вызовом break outer будет разорван внешний цикл до метки с именем outer; т.о. управление перейдёт со строки, помеченной (*), к alert('Готово!').
Можно размещать метку на отдельной строке:
	outer:
	for (let i = 0; i < 3; i++) { ... }
Директива continue также может быть использована с меткой. В этом случае управление перейдёт на следующую итерацию цикла с меткой.
Метки не позволяют "прыгнуть" куда угодно. Метки не дают возможности передавать управление в произвольное место кода.
Директива break должна находиться внутри блока кода. Технически, подойдет любой маркированный блок кода.
К слову, continue возможно только внутри цикла.

Итого:
Мы рассмотрели 3 базовых вида циклов:
	while – Проверяет условие перед каждой итерацией.
	do..while – Проверяет условие после каждой итерации.
	for (;;) – Проверяет условие перед каждой итерацией, есть возможность задать дополнительные настройки.
Чтобы организовать бесконечный цикл, используют конструкцию while (true). При этом он, как и любой другой цикл, может быть прерван директивой break.
Если на данной итерации цикла делать больше ничего не надо, но полностью прекращать цикл не следует – используют директиву continue.
Обе этих директивы поддерживают метки, которые ставятся перед циклом. Метки – единственный способ для break/continue выйти за пределы текущего цикла, повлиять на выполнение внешнего.
Заметим, что метки не позволяют прыгнуть в произвольное место кода, в JS нет такой возможности.

let i = 0;
while (++i < 5) console.log(i); // 1 2 3 4
i = 0;
while (i++ < 5) console.log(i); // 1 2 3 4 5
for (let i = 0; i < 5; i++) console.log(i); // 0 1 2 3 4
for (let i = 0; i < 5; ++i) console.log(i); // 0 1 2 3 4

// При помощи цикла for выведите чётные числа от 2 до 10.
for (i = 2; i <= 10; i++) {
    if (i % 2 == 0) console.log(i);
}; // 2 4 6 8 10

// Перепишите код, заменив цикл for на while, без изменения поведения цикла.
for (let i = 0; i < 3; i++) {
    console.log(`number ${i}`);
}; // number 0 number 1 number 2
while (i < 3) console.log(`number ${i++}`); // number 0 number 1 number 2

// Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.
let value;
do {
    value = +prompt("Введите число больше 100", '');
    console.log(value);
} while (value <= 100 && value); 

// все простые числа из интервала от 2 до n.
let n = 2;
n = +prompt('введите число', '');
next: for (i = 2; i <= n; i++) {
    for (j = 2; j < i; j++) {
        if (i % j == 0) continue next;
    };
    console.log(i);
};
1+ 2+ 3+ 4+? 5+ 6- 7-

#1.2.14. Конструкция "switch"
23.1.25 - https://learn.javascript.ru/switch
Конструкция switch заменяет собой сразу несколько if.
Она представляет собой более наглядный способ сравнить выражение сразу с несколькими вариантами.
Конструкция switch имеет один или более блок case и необязательный блок default.
Синтаксис:
	switch(x) {
		case 'value1':  // if (x === 'value1')
			... [break]
		case 'value2':  // if (x === 'value2')
			... [break]
		default:
			... [break]
	};
- Переменная x проверяется на строгое равенство первому значению value1, затем второму value2 и так далее.
- Если соответствие установлено – switch начинает выполняться от соответствующей директивы case и далее, до ближайшего break (или до конца switch).
- Если ни один case не совпал – выполняется (если есть) вариант default.
Любое выражение может быть аргументом для switch/case. И switch и case допускают любое выражение в качестве аргумента.

Группировка case.
Несколько вариантов case, использующих один код, можно группировать.
Возможность группировать case – это побочный эффект того, как switch/case работает без break.

Тип имеет значение.
Нужно отметить, что проверка на равенство всегда строгая. Значения должны быть одного типа, чтобы выполнялось равенство.

// Напишите if..else, соответствующий следующему switch:
В JS есть стандартный объект, называемый navigator, который содержит данные об используемом браузере. Объект navigator имеет множество свойств, но свойство .userAgent — строка, содержащая данные о браузере, операционной системе и многом другом.
console.log(navigator.userAgent); // Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 Safari/537.36 OPR/109.0.0.0 (Edition beta)
switch (browser) {
    case 'Edge':
        console.log("You've got the Edge!");
        break;
    case 'Chrome':
    case 'Firefox':
    case 'Safari':
    case 'Opera':
        console.log('Okay we support these browsers too');
        break;
    default:
        console.log('We hope that this page looks ok!');
};
if (browser == 'Edge') {
    console.log("You've got the Edge!");
} else if (browser == 'Chrome' || browser == 'Firefox' || browser == 'Safari' || browser == 'Opera') {
    console.log('Okay we support these browsers too');
} else {console.log('We hope that this page looks ok!')};
// для NodeJS есть библиотека detect.js https://github.com/darcyclarke/Detect.js/tree/master

// Перепишите код с использованием одной конструкции switch:
const number = +prompt('Введите число между 0 и 3', '');
if (number === 0) console.log('Вы ввели число 0');
if (number === 1) console.log('Вы ввели число 1');
if (number === 2 || number === 3) console.log('Вы ввели число 2 или 3');

switch (number) {
    case 0: console.log('Вы ввели число 0'); break;
    case 1: console.log('Вы ввели число 1'); break;
    case 2:
    case 3: console.log('Вы ввели число 2 или 3'); break;
    default: console.log('вы ввели другое число');
}; 

1+ 2+

#1.2.15. Функции
24.1.25 - https://learn.javascript.ru/function-basics
Функции являются основными строительными блоками программ (скриптов).
Примеры встроенных функций – это alert(message), prompt(message, default) и confirm(question). Но можно создавать и свои.

Объявление функции.
Синтаксис:
	function funcName(параметры[, ...]) {/* ...тело функции... */};
Вначале идёт ключевое слово function, после него имя функции, затем список параметров в круглых скобках через запятую (в вышеприведённом примере он пустой) и, наконец, код функции, также называемый "телом функции", внутри фигурных скобок.
Вызов funcName() выполняет код функции. 

Локальные переменные.
Переменные, объявленные внутри функции, являются локальными и видны только внутри этой функции.

Внешние переменные.
У функции есть доступ к внешним переменным. Функция обладает полным доступом к внешним переменным и может изменять их значение.
Внешняя переменная используется, только если внутри функции нет такой локальной. Если одноимённая переменная объявляется внутри функции, тогда она перекрывает внешнюю.

Глобальные переменные.
Переменные, объявленные снаружи всех функций – называются глобальными.
Глобальные переменные видимы для любой функции (если только их не перекрывают одноимённые локальные переменные).
Желательно сводить использование глобальных переменных к минимуму. В современном коде обычно мало или совсем нет глобальных переменных. Хотя они иногда полезны для хранения важнейших "общепроектовых" данных.

Параметры и аргументы.
Значение, передаваемое в качестве параметра функции, также называется аргументом.
	- Параметр – это переменная, указанная в круглых скобках в объявлении функции.
	- Аргумент – это значение, которое передаётся функции при её вызове.
Мы объявляем функции со списком параметров, затем вызываем их, передавая аргументы.
Мы можем передать внутрь функции любую информацию, используя параметры и аргументы.
При вызове функции, переданные значения копируются в локальные переменные, и затем они используются в теле функции. 
Функция изменяет значение переменной, но это изменение не видно снаружи. Функция всегда получает только копию значения.

Значения по умолчанию.
Если при вызове функции аргумент не был указан, то его значением становится undefined.
Если мы хотим задать параметру значение по умолчанию, мы должны указать его после = :
	function funcName(param = 'default') {/* ...тело функции... */};
Теперь, если параметр param не указан, его значением будет "default".
На месте значения может быть и более сложное выражение, которое вычисляется и присваивается при отсутствии параметра. 
	function funcName(param1, param2 = anotherFunction()) {
	  // anotherFunction() выполнится только если не передан param2
	};
В JS параметры по умолчанию вычисляются только тогда, когда функция вызывается без соответствующего аргумента.

Альтернативные параметры по умолчанию.
Ранние версии JS не поддерживали параметры по умолчанию. Поэтому существуют альтернативные способы проверки, которые могут встречаться в старых скриптах (через  if или ||).
Иногда имеет смысл присваивать значения по умолчанию для параметров не в объявлении функции, а на более позднем этапе.
Для этого можно использовать проверки через if, || или ??:
	if (text === undefined) text = 'пустое сообщение'; // если значение text отсутствует то присвоить 'пустое сообщение'
	text = text || 'пусто'; // если значение text ложно или undefined, тогда присвоить text значение 'пусто'
	func(param ?? "неизвестно"); // если param равен undefined или null, показать "неизвестно"

Возврат значения.
Функция может вернуть результат, который будет передан в вызвавший её код, через директиву return.
Директива return может находиться в любом месте тела функции. Как только выполнение доходит до этого места, функция останавливается, и значение возвращается в вызвавший её код.
Вызовов return может быть несколько.
Возможно использовать return и без значения. Это приведёт к немедленному выходу из функции.
Результат функции с пустым return или без него – undefined.
Если функция не возвращает значения, это всё равно, как если бы она возвращала undefined:
	function doNothing() { /* пусто */ }
	console.log( doNothing() === undefined ); // true
Пустой return аналогичен return undefined:
	function doNothing() {return};
	console.log( doNothing() === undefined ); // true
Никогда не добавляйте перевод строки между return и его значением. Такой код не выполнится, потому что интерпретатор JS подставит точку с запятой после return, и т.о. это фактически станет пустым return.
Если нужно чтобы возвращаемое выражение занимало несколько строк, его надо начать на той же строке, что и return; или написать его в скобках.

Выбор имени функции.
Функция – это действие. Поэтому имя функции обычно является глаголом. Оно должно быть кратким, точным и описывать действие функции, чтобы программист, который будет читать код, получил верное представление о том, что делает функция.
Как правило, используются глагольные префиксы, обозначающие общий характер действия, после которых следует уточнение. Обычно в командах разработчиков действуют соглашения, касающиеся значений этих префиксов.
Обычно, функции начинающиеся с:
	calc… – что-то вычисляют,
	create… – что-то создают,
	check… – что-то проверяют и возвращают логическое значение, 
	do… - что-то делают,
	get… – возвращают значение,
	show… - что-то показывают,
	set… - что-то устанавливают, и т.д.
Примеры таких имён:
	showMessage(..)     // показывает сообщение
	getAge(..)          // возвращает возраст (получая его каким-то образом)
	calcSum(..)         // вычисляет сумму и возвращает результат
	createForm(..)      // создаёт форму (и обычно возвращает её)
	checkPermission(..) // проверяет доступ, возвращая true/false
Благодаря префиксам, при первом взгляде на имя функции становится понятным, что делает её код, и какое значение она может возвращать.

Одна функция – одно действие.
Функция должна делать только то, что явно подразумевается её названием. И это должно быть одним действием.
Два независимых действия обычно подразумевают две функции, даже если предполагается, что они будут вызываться вместе (в этом случае мы можем создать третью функцию, которая будет их вызывать).

Сверхкороткие имена функций.
Имена функций, которые используются очень часто, иногда делают сверхкороткими.
Например, фреймворк jQuery определяет функцию с помощью $. В библиотеке Lodash основная функция представлена именем _.
Это исключения. В основном имена функций должны быть в меру краткими и описательными.

Функции должны быть короткими и делать только что-то одно. Если это что-то большое, имеет смысл разбить функцию на несколько меньших. Иногда следовать этому правилу непросто, но это определённо хорошее правило.
Небольшие функции не только облегчают тестирование и отладку – само существование таких функций выполняет роль хороших комментариев! Т.о., допустимо создавать функции, даже если мы не планируем повторно использовать их. Такие функции структурируют код и делают его более понятным.

Для того, чтобы сделать код более чистым и понятным, рекомендуется использовать локальные переменные и параметры функций, не пользоваться внешними переменными. Функция, которая получает параметры, работает с ними и затем возвращает результат, гораздо понятнее функции, вызываемой без параметров, но изменяющей внешние переменные, что чревато побочными эффектами.

// Перепишите функцию, используя оператор '?' или '||'
let age = +prompt('сколько вам лет', '');
function checkAge(age) {
    if (age > 18) {return true} 
	else {return confirm('Родители разрешили?')};
};
function checkAge(age) {return (age > 18) ? true : confirm('Родители разрешили?')};
function checkAge(age) {return (age > 18) || confirm('Родители разрешили?')};
checkAge(age);

// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.
// Функция min(a, b)
let numb1 = +prompt('введите первое число:', '');
let numb2 = +prompt('введите второе число:', '');
function min(a, b) {
    if (a == b) return 'нет, a равно b';
    return (a > b) ? b : a;
};
console.log('меньшее число:', min(numb1, numb2));

// Напишите функцию pow(x,n), которая возводит x в степень n и возвращает результат.
function pow(x, deg){
    let numb = x;
    for (i = 1; i < deg; i++) {numb *= x;}
    return numb;
}
let x = +prompt('введите число:', '');
let n = +prompt('введите степень числа:', '');
if (n >= 1 && n % 1 == 0) {
    alert(pow(x, n));
} else {
    alert(`Степень ${n} не поддерживается, используйте натуральное число`);
};

1+ 2+- 3+ 4+-

#1.2.16. Function Expression
25.1.25 - https://learn.javascript.ru/function-expressions
Функция в JS – это не магическая языковая структура, а особого типа значение. Синтаксис, который мы использовали до этого, называется Function Declaration (Объявление Функции).
	function funcName(параметры[, ...]) {/* ...тело функции... */};
Существует ещё один синтаксис создания функций, который называется Function Expression (Функциональное Выражение).
Данный синтаксис позволяет нам создавать новую функцию в середине любого выражения:
	let func = function ([параметры, ...]) {/* ...тело функции... */};
Поскольку создание функции происходит в контексте выражения присваивания (с правой стороны от =), это Function Expression.
Обратите внимание, что после ключевого слова function нет имени. Для Function Expression допускается его отсутствие.
Здесь мы сразу присваиваем её переменной, так что смысл этих примеров кода один и тот же: создать функцию и поместить её в переменную. В более сложных ситуациях, функция может быть создана и немедленно вызвана, или запланирована для дальнейшего выполнения, нигде не сохраняясь, таким образом, оставаясь анонимной.

Функция – это значение.
Независимо от того, как создаётся функция – она является значением и может храниться в переменной.
Существуют языки программирования, в которых любое упоминание имени функции приводит к её выполнению, но JS к таким не относится. В JS функция – это значение, поэтому мы можем обращаться с ней как со значением. 
Конечно, функция – это особое значение, в том смысле, что мы можем вызвать её как func(). Но всё же это значение. Поэтому мы можем работать с ней так же, как и с другими видами значений.
Можно скопировать функцию в другую переменную, и вызвать её под новым именем.
Может возникнуть вопрос: Почему в Function Expression ставится точка с запятой ; на конце, а в Function Declaration нет.
Ответ прост: Function Expression создаётся как function(...) {...} внутри выражения присваивания: let func = …;. Точку с запятой ; рекомендуется ставить в конце выражения, она не является частью синтаксиса функции. Точка с запятой нужна там для более простого присваивания, такого как let func = 5;, а также для присваивания функции.

Функции-колбэки.
Например, давайте напишем функцию ask(question, yes, no) с тремя параметрами:
	question - Текст вопроса
	yes - Функция, которая будет вызываться, если ответ будет «Yes»
	no - Функция, которая будет вызываться, если ответ будет «No»
Функция должна задать вопрос question и, в зависимости от того, как ответит пользователь, вызвать yes() или no():
	function ask(question, yes, no) {
		if (confirm(question)) yes()
		else no();
	}
	function showOk() {alert( "Вы согласны." )}
	function showCancel() {alert( "Вы отменили выполнение." );}
	ask("Вы согласны?", showOk, showCancel);// использование: функции showOk, showCancel передаются в качестве аргументов ask
Аргументы showOk и showCancel функции ask называются функциями-колбэками или просто колбэками.
Ключевая идея в том, что мы передаём функцию и ожидаем, что она вызовется обратно (от англ. call back – обратный вызов) когда-нибудь позже, если это будет необходимо. В нашем случае, showOk становится колбэком для ответа yes, а showCancel – для ответа no.
Мы можем переписать этот пример значительно короче, используя Function Expression:
	ask("Вы согласны?", function(){alert("Вы согласились.")}, function(){alert("Вы отменили выполнение.")});
Здесь функции объявляются прямо внутри вызова ask(...). У них нет имён, поэтому они называются анонимными. Такие функции недоступны снаружи ask (потому что они не присвоены переменным), но это как раз то, что нужно.

Функция – это значение, представляющее действие.
Обычные значения, такие как строки или числа представляют собой данные. Функции, с другой стороны, можно воспринимать как действия. Мы можем передавать их из переменной в переменную и запускать, когда захотим.

Function Expression в сравнении с Function Declaration.
Давайте разберём ключевые отличия Function Declaration от Function Expression.
(1) синтаксис: как отличить их друг от друга в коде.
	- Function Declaration: функция объявляется отдельной конструкцией function... в основном потоке кода.
	- Function Expression: функция, созданная внутри другого выражения или синтаксической конструкции. В данном случае функция создаётся в правой части выражения присваивания =.
Более тонкое отличие состоит в том, когда создаётся функция движком JS.
Function Expression создаётся, когда выполнение доходит до него, и затем уже может использоваться. После того, как поток выполнения достигнет правой части выражения присваивания let sum = function... – с этого момента, функция считается созданной и может быть использована (присвоена переменной, вызвана и т.д. ).
С Function Declaration всё иначе. Function Declaration может быть вызвана раньше, чем она объявлена.
Другими словами, когда движок JS готовится выполнять скрипт или блок кода, прежде всего он ищет в нём Function Declaration и создаёт все такие функции. Можно считать этот процесс "стадией инициализации". И только после того, как все объявления Function Declaration будут обработаны, продолжится выполнение. В результате функции, созданные как Function Declaration, могут быть вызваны раньше своих определений.
Функции, объявленные при помощи Function Expression, создаются тогда, когда выполнение доходит до них. 
Ещё одна важная особенность Function Declaration заключается в их блочной области видимости.
В строгом режиме, когда Function Declaration находится в блоке {...}, функция доступна везде внутри блока. Но не снаружи него.
Объявление Function Declaration видимо только внутри блока кода, в котором располагается.
Например функция объявленная внутри блока if не будет определена снаружи этого блока в режиме 'use strict'. В таком случае, верным подходом будет воспользоваться функцией, объявленной при помощи Function Expression, и присвоить её значение переменной, объявленной снаружи if, что обеспечит нужную видимость снаружи блока if.

Когда использовать Function Declaration, а когда Function Expression?
Как правило, если нам понадобилась функция, в первую очередь нужно рассматривать синтаксис Function Declaration, который мы использовали до этого. Он даёт нам больше свободы в том, как мы можем организовывать код. Функции, объявленные таким образом, можно вызывать до их объявления. Также функции вида function f(…) {…} чуть более заметны в коде, чем let f = function(…) {…}. Function Declaration легче "ловятся глазами". 
Но если Function Declaration нам не подходит по какой-то причине, или нам нужно условное объявление, то следует использовать Function Expression.

Итого:
	- Функции – это значения. Они могут быть присвоены, скопированы или объявлены в любом месте кода.
	- Если функция объявлена как отдельная инструкция в основном потоке кода, то это “Function Declaration”.
	- Если функция была создана как часть выражения, то это “Function Expression”.
	- Function Declaration обрабатываются перед выполнением блока кода. Они видны во всём блоке.
	- Функции, объявленные при помощи Function Expression, создаются только когда поток выполнения достигает их.
В большинстве случаев, когда нам нужно объявить функцию, Function Declaration предпочтительнее, т.к функция будет видна до своего объявления в коде. Это даёт нам больше гибкости в организации кода, и, как правило, делает его более читабельным.
Исходя из этого, мы должны использовать Function Expression только тогда, когда Function Declaration не подходит для нашей задачи. Мы рассмотрели несколько таких примеров в этой главе, и увидим ещё больше в будущем.

#1.2.17. Стрелочные функции, основы
26.1.25 - https://learn.javascript.ru/arrow-functions-basics
Стрелочные функции (Arrow Functions):
	let func = ([arg1, arg2, ...argN]) => {/* ...тело функции... */};
это сокращённая версия Function Expression:
	let func = function([arg1, arg2, ...argN]) {return /* ...тело функции... */;};
Например:
	let sum = (a, b) => a + b;
	/* Эта стрелочная функция представляет собой более короткую форму: let sum = function(a, b) {return a + b;}; */
	console.log(sum(1, 2)); // 3
Если у нас только один аргумент, то круглые скобки вокруг параметров можно опустить.
	let double = n => n * 2;
Если аргументов нет, круглые скобки будут пустыми, но они должны присутствовать.
	let sayHi = () => console.log("Hello!");
Стрелочные функции можно использовать так же, как и Function Expression.

Многострочные стрелочные функции.
Стрелочные функции, которые мы видели до этого, были очень простыми. Они брали аргументы слева от => и вычисляли и возвращали выражение справа.
Иногда нам нужна более сложная функция, с несколькими выражениями и инструкциями. Это также возможно, нужно лишь заключить их в фигурные скобки. При этом важное отличие – в том, что в таких скобках для возврата значения нужно использовать return (как в обычных функциях).
/** Здесь мы представили главной целью стрелочных функций краткость. Но это ещё не всё!
Стрелочные функции обладают и другими интересными возможностями. Чтобы изучить их более подробно, нам сначала нужно познакомиться с некоторыми другими аспектами JS, поэтому мы вернёмся к стрелочным функциям позже, в главе Повторяем стрелочные функции. А пока мы можем использовать их для простых однострочных действий и колбэков.*/

Стрелочные функции очень удобны для простых действий, особенно для однострочных.
Они бывают двух типов:
	- Без фигурных скобок: (...args) => expression; // правая сторона выражения: функция вычисляет его и возвращает результат. Скобки можно не ставить, если аргумент только один: n => n * 2.
	- С фигурными скобками: (...args) => { body }; // скобки позволяют нам писать несколько инструкций внутри функции, но при этом необходимо явно вызывать return, чтобы вернуть значение.

#1.2.18. Особенности JavaScript
27.1.25 - https://learn.javascript.ru/javascript-specials
Структура кода.
Инструкции разделяются точкой с запятой.
Как правило, перевод строки также интерпретируется как разделитель. Это так называемая "автоматическая вставка точки с запятой". Впрочем, она не всегда срабатывает.
Большинство руководств по стилю кода рекомендуют ставить точку с запятой после каждой инструкции.
Точка с запятой не требуется после блоков кода {…} и синтаксических конструкций с ними, таких как, например, циклы.
	function f() {...} // после объявления функции необязательно ставить точку с запятой
	for(;;) {...} // после цикла точка с запятой также необязательна
Впрочем, если даже мы и поставим «лишнюю» точку с запятой, ошибки не будет. Она просто будет проигнорирована.

Строгий режим.
Чтобы по максимуму использовать возможности современного JavaScript, все скрипты рекомендуется начинать с добавления директивы 
'use strict';.
Эту директиву следует размещать в первой строке скрипта или в начале тела функции. Без "use strict" код также запустится, но некоторые возможности будут работать в "режиме совместимости" со старыми версиями языка JavaScript. Нам же предпочтительнее современное поведение.
Некоторые конструкции языка (например, классы, которые нам ещё предстоит изучить) включают строгий режим по умолчанию.

Переменные.
Можно объявить при помощи:
	let
	const (константа, т.е. изменению не подлежит)
	var (устаревший способ, подробности позже)
Имя переменной может включать:
	Буквы и цифры, однако цифра не может быть первым символом.
	Символы $ и _ используются наряду с буквами.
	Иероглифы и символы нелатинского алфавита также допустимы, но обычно не используются.
Переменные типизируются динамически. В них могут храниться любые значения.
Всего существует 8 типов данных:
	number для целых и вещественных чисел,
	bigint для работы с целыми числами произвольной длины,
	string для строк,
	boolean для логических значений истинности или ложности: true/false,
	null – тип с единственным значением null, т.е. «пустое значение» или «значение не существует»,
	undefined – тип с единственным значением undefined, т.е. «значение не задано»,
	object и symbol – сложные структуры данных и уникальные идентификаторы; их мы ещё не изучили.
Оператор typeof возвращает тип значения переменной, с двумя исключениями:
	typeof null == "object" // ошибка в языке
	typeof function(){} == "function" // именно для функций

Взаимодействие с посетителем.
В качестве рабочей среды мы используем браузер, так что простейшими функциями взаимодействия с посетителем являются:
prompt(question, [default]); // Задаёт вопрос question и возвращает то, что ввёл посетитель, либо null, если посетитель нажал на кнопку Отмена.
confirm(question); // Задаёт вопрос question и предлагает выбрать ОК или Отмена. Выбор возвращается в формате true/false.
alert(message); // Выводит сообщение message.
Все эти функции показывают модальные окна, они останавливают выполнение кода и не позволяют посетителю взаимодействовать со страницей, пока не будет дан ответ на вопрос.

Операторы.
JS поддерживает следующие операторы:
(1) Арифметические
Простые * + - "/", а также деление по модулю % и возведение в степень **.
Бинарный плюс + объединяет строки. А если одним из операндов является строка, то второй тоже будет конвертирован в строку.
(2) Операторы присваивания
Простые a = b и составные a *= 2.
(3) Битовые операции
Битовые операторы работают с 32-битными целыми числами на самом низком, побитовом уровне. Подробнее об их использовании можно прочитать на ресурсе MDN и в разделе Побитовые операторы.
(4) Условный оператор
Единственный оператор с тремя параметрами: cond ? resultA : resultB. Если условие cond истинно, возвращается resultA, иначе – resultB.
(5) Логические операторы
Логические И &&, ИЛИ || используют так называемое "ленивое вычисление" и возвращают значение, на котором оно остановилось (не обязательно true или false). Логическое НЕ ! конвертирует операнд в логический тип и возвращает инвертированное значение.
(6) Оператор нулевого слияния
Оператор ?? предоставляет способ выбора определённого значения из списка переменных. Результатом a ?? b будет a, если только оно не равно null/undefined, тогда b.
(7) Сравнение
Проверка на равенство == значений разных типов конвертирует их в число (за исключением null и undefined, которые могут равняться только друг другу).

Другие операторы сравнения тоже конвертируют значения разных типов в числовой тип.
Оператор строгого равенства === не выполняет конвертирования: разные типы для него всегда означают разные значения.
Значения null и undefined особенные: они равны == только друг другу, но не равны ничему ещё.
Операторы сравнения больше/меньше сравнивают строки посимвольно, остальные типы конвертируются в число.
Существуют и другие операторы, такие как запятая.

Циклы.
три базовых вида циклов:
	while (condition) {...} // 1
	do {...} while (condition); // 2
	for (let i = 0; i < 10; i++) {...} // 3
Переменная, объявленная в цикле for (let...), видна только внутри цикла. Но мы также можем опустить let и переиспользовать существующую переменную.
Директивы break/continue позволяют выйти из цикла/текущей итерации. Используйте метки для выхода из вложенных циклов.

Конструкция switch.
Конструкция switch может заменить несколько проверок if. При сравнении она использует оператор строгого равенства ===.

Функции.
три способа создания функции в JS:
(1) Function Declaration: функция в основном потоке кода
	function sum(a, b) {let result = a + b; return result;}
(2) Function Expression: функция как часть выражения
	let sum = function(a, b) {let result = a + b; return result;};
(3) Стрелочные функции:
	let sum = (a, b) => a + b; // выражение в правой части
	let sum = (a, b) => {/*код*/; return a + b;} // многострочный код в фигурных скобках { ... }, здесь нужен return
	let sayHi = () => alert("Hi"); // без аргументов
	let double = n => n * 2; // с одним аргументом
- У функций могут быть локальные переменные: т.е. объявленные в теле функции. Такие переменные видимы только внутри функции.
- У параметров могут быть значения по умолчанию: function sum(a = 1, b = 2) {...}.
- Функции всегда что-нибудь возвращают. Если нет оператора return, результатом будет undefined.

#1.3. Качество кода
#1.3.1. Отладка в браузере
28.1.25 - https://learn.javascript.ru/debugging-chrome
Отладка – это процесс поиска и исправления ошибок в скрипте. Все современные браузеры и большинство других сред разработки поддерживают инструменты для отладки – специальный графический интерфейс, который сильно упрощает отладку. Он также позволяет по шагам отследить, что именно происходит в нашем коде.

Панель Исходный код / Источники (Sources).
Интерфейс состоит из трёх зон:
- В зоне File Navigator (панель для навигации файлов) показаны файлы HTML, JavaScript, CSS, включая изображения, используемые на странице. Здесь также могут быть файлы различных расширений Chrome.
- Зона Code Editor (редактор кода) показывает исходный код.
- Зона JavaScript Debugging (панель отладки JavaScript) отведена для отладки.

Консоль (Console).
При нажатии на клавишу Esc в нижней части экрана вызывается консоль, где можно вводить команды и выполнять их клавишей Enter.
Результат выполнения инструкций сразу же отображается в консоли.

Точки останова (breakpoints)
Точка останова – это участок кода, где отладчик автоматически приостановит исполнение JS.
Пока исполнение поставлено "на паузу", мы можем просмотреть текущие значения переменных, выполнить команды в консоли, другими словами, выполнить отладку кода.
В правой части графического интерфейса мы видим список точек останова. А когда таких точек выставлено много, да ещё и в разных файлах, этот список поможет эффективно ими управлять:
	Быстро перейдите к точке останова в коде (нажав на неё на правой панели).
	Временно отключите точку останова, сняв с неё галочку.
	Удалите точку останова, щёлкнув правой кнопкой мыши и выбрав Remove (Удалить).
	…и так далее.

Условные точки останова.
Щелчок правой кнопкой мыши по номеру строки позволяет создать условную точку останова. Она сработает только в тот момент, когда выражение, которое вы должны указать при создании такой точки, истинно.
Это удобно, когда нам нужно остановиться только при определённом значении переменной или для определённых параметров функции.

Команда debugger
Выполнение кода можно также приостановить с помощью команды debugger прямо изнутри самого кода:
	function hello(name) {
		let phrase = `Привет, ${name}!`;
		debugger;  // <-- тут отладчик остановится
		say(phrase);
	}
Такая команда сработает только если открыты инструменты разработки, иначе браузер ее проигнорирует.

В нашем примере функция вызывается во время загрузки страницы, поэтому для начала отладки (после того, как мы поставили точки останова) проще всего её перезагрузить. Нажмите F5 (Windows, Linux) или Cmd+R (Mac).
Выполнение прервётся там, где находится точка останова.

Чтобы понять, что происходит в коде, щёлкните по стрелочкам справа:
1. Watch – показывает текущие значения для любых выражений.
	Вы можете нажать на + и ввести выражение. Отладчик покажет его значение, автоматически пересчитывая его в процессе выполнения.
2. Call Stack (стек вызовов) – показывает цепочку вложенных вызовов.
	В текущий момент отладчик находится внутри вызова hello(), вызываемого скриптом в index.html (там нет функции, поэтому она называется “анонимной”).
	Если вы нажмёте на элемент стека (например, «anonymous»), отладчик перейдёт к соответствующему коду, и нам представляется возможность его проанализировать.
3. Scope (область действия) показывает текущие переменные.
	Local (местные переменные) показывает локальные переменные функций, а их значения подсвечены прямо в исходном коде.
	В Global перечисляются глобальные переменные (то есть вне каких-либо функций).
	Там также есть ключевое слово this.

Пошаговое выполнение скрипта.
Для этого есть кнопки в верхней части правой панели. Давайте рассмотрим их.
|> – Resume: продолжить выполнение, быстрая клавиша F8.
Возобновляет выполнение кода. Если больше нет точек останова, то выполнение просто продолжается, без контроля отладчиком.
 – «Step»: выполнить следующую команду, быстрая клавиша F9. Выполняет следующую инструкцию. Нажатие на эту кнопку снова и снова приведёт к пошаговому выполнению всех инструкций скрипта одного за другим.
 – «Step over»: выполнить следующую команду, но не заходя внутрь функции, быстрая клавиша F10. Работает аналогично предыдущей команде «Step», но ведёт себя по-другому, если следующая инструкция является вызовом функции. Если сравнить, то команда «Step» переходит во вложенный вызов функцию и приостанавливает выполнение в первой строке, в то время как «Step over» выполняет вызов вложенной функции незаметно для нас, пропуская её внутренний код. Затем выполнение приостанавливается сразу после вызова функции. Это хорошо, если нам не интересно видеть, что происходит внутри вызова функции.
 – «Step into», быстрая клавиша F11. Это похоже на «Step», но ведёт себя по-другому в случае асинхронных вызовов функций. Если вы только начинаете изучать JS, то можете не обращать внимания на разницу, так как у нас ещё нет асинхронных вызовов. На будущее просто помните, что команда «Step» игнорирует асинхронные действия, такие как setTimeout (вызов функции по расписанию), которые выполняются позже. «Step into» входит в их код, ожидая их, если это необходимо. См. DevTools manual для получения более подробной информации.
 – «Step out»: продолжить выполнение до завершения текущей функции, быстрая клавиша Shift+F11. Продолжает выполнение и останавливает его в самой последней строке текущей функции. Это удобно, когда мы случайно вошли во вложенный вызов, используя , но это нас не интересует, и мы хотим продолжить его до конца как можно скорее.
 – активировать/деактивировать все точки останова(breakpoints). Эта кнопка не влияет на выполнение кода, она лишь позволяет массово включить/отключить точки останова.
(||) – включить/отключить автоматическую паузу в случае ошибки. При включении, если открыты инструменты разработчика, ошибка при выполнении скрипта автоматически приостанавливает его. Затем мы можем проанализировать переменные в отладчике, чтобы понять, что пошло не так. Поэтому, если наш скрипт умирает с ошибкой, мы можем открыть отладчик, включить эту опцию и перезагрузить страницу, чтобы увидеть, где он умирает и каков контекст в этот момент.

Continue to here.
Щелчок правой кнопкой мыши по строке кода открывает контекстное меню с отличной опцией под названием "Continue to here" (продолжить до этого места). Это удобно, когда мы хотим перейти на несколько шагов вперёд к строке, но лень устанавливать точку останова (breakpoint).

Логирование.
Чтобы вывести что-то на консоль из нашего кода, существует функция console.log().
Обычный пользователь сайта не увидит такой вывод, так как он в консоли. Чтобы увидеть его, либо откройте консольную панель инструментов разработчика, либо нажмите Esc, находясь в другой панели: это откроет консоль внизу.
Если правильно выстроить логирование в приложении, то можно и без отладчика разобраться, что происходит в коде.

Итого:
Приостановить выполнение скрипта можно тремя способами:
- Точками останова (breakpoints).
- Использованием в коде команд debugger.
- При ошибке (если инструменты разработчика открыты и кнопка авт.пауза включена).
При остановке мы можем отлаживать: анализировать переменные и пошагово пройти по процессу, чтобы отыскать проблему.
В инструментах разработчика гораздо больше опций, чем описано здесь. С полным руководством можно ознакомиться на https://developers.google.com/web/tools/chrome-devtools .

#1.3.2. Советы по стилю кода
3.2.25 - https://learn.javascript.ru/coding-style
Искусство программирования – взять сложную задачу и написать такой код для её решения, который и правильно работает, и легко читается, понятен для людей. Для этого нужен хороший стиль написания кода.

Правила Синтаксиса.
Ни одно правило не является жёстко обязательным. Здесь нет железных правил. Это стилевые предпочтения, а не религиозные догмы.

Фигурные скобки.
В большинстве JS-проектов фигурные скобки пишутся в так называемом "египетском" стиле с открывающей скобкой на той же строке, что и соответствующее ключевое слово – не на новой строке. Перед открывающей скобкой должен быть пробел.
- если запись однострочная, фигурные скобки не нужны.
- никогда не разделяйте строки без фигурных скобок, можно ненароком сделать ошибку при добавлении строк.
- в одну строку без скобок – приемлемо, если эта строка короткая.
Для очень короткого кода допустима одна строка. Например: if (cond) return null;
// (по-моему) полотенце с кучей пустых строк и переносов на несколько страниц читается ХУЖЕ чем компактный код на одной странице...

Длина строки.
Никто не любит читать длинные горизонтальные строки кода. Лучше всего разбивать их, на несколько.
Максимальную длину строки согласовывают в команде. Обычно это 80 или 120 символов.

Отступы.
Существует два типа отступов: 
Горизонтальные отступы: 2 или 4 пробела. Горизонтальный отступ выполняется с помощью 2 или 4 пробелов, или символа табуляции (клавиша Tab). Какой из них выбрать – это уже на ваше усмотрение. Пробелы больше распространены. Одно из преимуществ пробелов над табуляцией заключается в том, что пробелы допускают более гибкие конфигурации отступов, чем символ табуляции. Например, мы можем выровнять аргументы относительно открывающей скобки.
Вертикальные отступы: пустые строки для разбивки кода на логические блоки. Даже одну функцию часто можно разделить на логические блоки. Можно вставлять дополнительный перевод строки туда, где это сделает код более читаемым. Не рекомендуется более 9 строк кода подряд без вертикального отступа.

Точка с запятой.
Точки с запятой должны присутствовать после каждого выражения, даже если их, казалось бы, можно пропустить.
Есть языки, в которых точка с запятой необязательна и редко используется. Однако в JS бывают случаи, когда перенос строки не интерпретируется, как точка с запятой, что может привести к ошибкам. Подробнее об этом – в главе о структуре кода. Если вы – опытный разработчик на JS, то можно выбрать стиль кода без точек с запятой, например StandardJS. В ином случае, лучше будет использовать точки с запятой, чтобы избежать подводных камней. Большинство разработчиков их ставят.

Уровни вложенности.
Уровней вложенности должно быть немного.
Например, в цикле бывает полезно использовать директиву continue, чтобы избежать лишней вложенности.
Например, вместо добавления вложенного условия if, как здесь:
	for (let i = 0; i < 10; i++) {
		if (cond) {
			... // <- ещё один уровень вложенности
		}
	}
Мы можем написать:
	for (let i = 0; i < 10; i++) {
		if (!cond) continue;
		...  // <- нет лишнего уровня вложенности
	}
Аналогичная ситуация – с if/else и return.
Например, две нижеследующие конструкции идентичны.
первая:
	function pow(x, n) {
		if (n < 0) {
			alert("Отрицательные значения 'n' не поддерживаются");
		} else {
			let result = 1;
			for (let i = 0; i < n; i++) {
				result *= x;
			}
			return result;
		}
	}
вторая:
	function pow(x, n) {
		if (n < 0) {
			alert("Отрицательные значения 'n' не поддерживаются");
			return;
		}
		let result = 1;
		for (let i = 0; i < n; i++) {
			result *= x;
		}
		return result;
	}
Второй вариант является более читабельным, потому что особый случай n < 0 обрабатывается на ранней стадии. После проверки можно переходить к основному потоку кода без необходимости увеличения вложенности.

Размещение функций.
Если вы пишете несколько вспомогательных функций, а затем используемый ими код, то существует три способа организации функций.
(1) Объявить функции перед кодом, который их вызовет.
(2) Сначала код, затем функции.
(3) Смешанный стиль: функция объявляется там, где она используется впервые.
В большинстве случаев второй вариант является предпочтительным.
Это потому, что при чтении кода мы сначала хотим знать, что он делает. Если сначала идёт код, то это тут же становится понятно. И тогда, может быть, нам вообще не нужно будет читать функции, особенно если их имена хорошо подобраны.

Руководства по стилю кода.
Руководство по стилю содержит общие правила о том, как писать код, например: какие кавычки использовать, сколько пробелов отступать, максимальную длину строки и так далее – в общем, множество мелочей.
Когда все участники команды используют одно и то же руководство по стилю, код выглядит одинаково, независимо от того, кто из команды его написал.
Конечно, команда всегда может написать собственное руководство по стилю, но обычно в этом нет необходимости. Существует множество уже готовых.
Некоторые популярные руководства:
	Google JavaScript Style Guide - https://google.github.io/styleguide/javascriptguide.xml
	Airbnb JavaScript Style Guide - https://github.com/airbnb/javascript (есть перевод https://leonidlebedev.github.io/javascript-airbnb/)
	Idiomatic.JS - https://github.com/rwaldron/idiomatic.js (есть перевод https://github.com/rwaldron/idiomatic.js/tree/master/translations/ru_RU)
	StandardJS - https://standardjs.com/
	(и ещё множество других)

Автоматизированные средства проверки (линтеры).
Автоматизированные средства проверки, так называемые линтеры – это инструменты, которые могут автоматически проверять стиль вашего кода и вносить предложения по его улучшению. Самое замечательное в них то, что проверка стиля может также найти программные ошибки, такие как опечатки в именах переменных или функций. Из-за этой особенности использовать линтер рекомендуется, даже если вы не хотите придерживаться какого-то конкретного стиля кода.
Вот некоторые известные инструменты для проверки:
	JSLint – проверяет код на соответствие стилю JSLint, в онлайн-интерфейсе вверху можно ввести код, а внизу – различные настройки проверки, чтобы попробовать её в действии. https://www.jslint.com/
	JSHint – больше проверок, чем в JSLint. https://jshint.com/
	ESLint – пожалуй, самый современный линтер. https://eslint.org/
Все они, в общем-то, работают. Автор пользуется ESLint.
Большинство линтеров интегрированы со многими популярными редакторами: просто включите плагин в редакторе и настройте стиль.
Например, для усьановки ESLint вы должны выполнить следующее:
	1. Установите Node.js.
	2. Установите ESLint с помощью команды npm install -g eslint (npm – установщик пакетов JavaScript).
	3. Создайте файл конфигурации с именем .eslintrc в корне вашего JavaScript-проекта (в папке, содержащей все ваши файлы).
	4. Установите/включите плагин для вашего редактора, который интегрируется с ESLint. У большинства редакторов он есть.
Кроме того, возможно загрузить наборы правил стиля из сети и расширить их. Смотрите "https://eslint.org/docs/user-guide/getting-started" для получения более подробной информации об установке.

Итого.
Все правила синтаксиса, описанные в этой главе (и в ссылках на руководства по стилю), направлены на повышение читаемости вашего кода. О любых можно поспорить.
Когда мы думаем о написании "лучшего" кода, мы должны задать себе вопросы: "Что сделает код более читаемым и лёгким для понимания?" и "Что может помочь избегать ошибок?". Это – основные моменты, о которых следует помнить при выборе и обсуждении стилей кода.
Чтение популярных руководств по стилю позволит вам быть в курсе лучших практик и последних идей и тенденций в стилях написания кода.

#1.3.3. Комментарии
6.2.25 - https://learn.javascript.ru/comments
Комментарии могут быть однострочными, начинающимися с //, и многострочными: /* ... */.
Обычно их используют, чтобы описать, как и почему работает код.
В хорошем коде количество объясняющих комментариев должно быть минимальным, код должен быть таким, чтобы его можно было понять без комментариев.
Про это есть хорошее правило: "Если код настолько запутанный, что требует комментариев, то, может быть, его стоит переделать?".

Рецепт: выносите код в функции.
Иногда выгодно заменить часть кода функцией, например, в таком случае:
	function showPrimes(n) {
		nextPrime:
		for (let i = 2; i < n; i++) { // проверяем, является ли i простым числом
			for (let j = 2; j < i; j++) {
			  if (i % j == 0) continue nextPrime;
			}
			alert(i);
		}
	}
Лучший вариант – использовать отдельную функцию isPrime:
	function showPrimes(n) {
		for (let i = 2; i < n; i++) {
			if (!isPrime(i)) continue;
			alert(i);
		}
	}
	function isPrime(n) {
		for (let i = 2; i < n; i++) {
			if (n % i == 0) return false;
		}
		return true;
	}
Теперь код легче понять. Функция сама становится комментарием. Такой код называется самодокументированным.

Рецепт: создавайте функции.
И если мы имеем длинный кусок кода, то будет лучше отрефакторить его с использованием функций (разделить между функциями).
Структура кода лучше, когда он разделён на части. Понятно, что делает каждая функция, что она принимает и что возвращает.
В реальности мы не можем полностью избежать объясняющих комментариев. Существуют сложные алгоритмы, и есть хитрые уловки для оптимизации. Но в целом нужно стараться писать простой и самодокументированный код.

Хорошие комментарии.
Итак, обычно объясняющие комментарии – это плохо. Но тогда какой комментарий считается хорошим?
- Описывайте архитектуру. 
	Сделайте высокоуровневый обзор компонентов, того, как они взаимодействуют, каков поток управления в различных ситуациях… Если вкратце – обзор кода с высоты птичьего полёта. Существует специальный язык UML ("https://ru.wikipedia.org/wiki/UML") для создания диаграмм, разъясняющих архитектуру кода. Его определённо стоит изучить.
- Документируйте параметры и использование функций.
	Есть специальный синтаксис JSDoc ("https://ru.wikipedia.org/wiki/JSDoc") для документирования функций: использование, параметры, возвращаемое значение.
	Например:
		/**
		 * Возвращает x, возведённое в n-ную степень.
		 *
		 * @param {number} x Возводимое в степень число.
		 * @param {number} n Степень, должна быть натуральным числом.
		 * @return {number} x, возведённое в n-ную степень.
		 */
		function pow(x, n) {...}
	Подобные комментарии позволяют нам понимать назначение функции и правильно её использовать без необходимости заглядывать в код.
	Кстати, многие редакторы, такие как WebStorm ("https://www.jetbrains.com/webstorm/"), прекрасно их распознают для того, чтобы выполнить автодополнение ввода и различные автоматические проверки кода.
	Также существуют инструменты, например, JSDoc 3 ("https://github.com/jsdoc/jsdoc"), которые умеют генерировать HTML-документацию из комментариев. Получить больше информации о JSDoc вы можете здесь: https://jsdoc.app.
- Почему задача решена именно таким способом?
	Важно то, что написано. Но то, что не написано, может быть даже более важным, чтобы понимать происходящее. Почему задача решена именно этим способом? Код не даёт ответа. Если есть несколько способов решить задачу, то почему вы выбрали именно этот? Особенно если ваш способ – не самый очевидный.
	Без подобных комментариев возможна следующая ситуация:
		Вы (или ваш коллега) открываете написанный некоторое время назад код и видите, что в нём есть, что улучшить.
		Вы думаете: "Каким глупым я раньше был и насколько умнее стал сейчас", и переписываете его на "более правильный и оптимальный" вариант.
		…Желание переписать код – это хорошо. Но в процессе вы понимаете, что оптимальное решение на самом деле не такое уж и оптимальное. Вы даже смутно припоминаете, почему, так как в прошлый раз вы уже его пробовали. Вы возвращаетесь к правильному варианту, потратив время зря.
	Комментарии, объясняющие решение, очень важны. Они помогают продолжать разработку в правильном направлении.
- В коде есть какие-то тонкости? Где они используются?
	Если в коде есть какие-то тонкости и неочевидные вещи, его определённо нужно комментировать.

Итого.
Комментарии – важный признак хорошего разработчика, причём как их наличие, так и отсутствие.
Хорошие комментарии позволяют нам поддерживать код, дают возможность вернуться к нему после перерыва и эффективнее его использовать.
Комментируйте:
	- Общую архитектуру, вид "с высоты птичьего полёта".
	- Использование функций.
	- Неочевидные решения, важные детали.
Избегайте комментариев:
	- Которые объясняют, как работает код, и что он делает.
	- Используйте их только в тех случаях, когда невозможно сделать настолько простой и самодокументированный код, что он не потребует комментариев.
Средства для генерации документации по коду, такие как JSDoc3, также используют комментарии: они их читают и генерируют HTML-документацию (или документацию в другом формате).

#1.3.4. Ниндзя-код
7.2.25 - https://learn.javascript.ru/ninja-code

Объединение нескольких смежных действий в одну функцию защитит ваш код от повторного использования.

#1.3.5. Автоматическое тестирование c использованием фреймворка Mocha
8.2.25 - https://learn.javascript.ru/testing-mocha
Зачем нам нужны тесты?
При тестировании кода ручными перезапусками легко упустить что-нибудь важное.
Автоматическое тестирование означает, что тесты пишутся отдельно, в дополнение к коду. Они по-разному запускают наши функции и сравнивают результат с ожидаемым.

Behavior Driven Development (BDD).
Начнём с техники под названием Behavior Driven Development или, коротко, BDD. BDD – это три в одном: и тесты, и документация, и примеры использования. Чтобы понять BDD – рассмотрим практический пример разработки.
("https://ru.wikipedia.org/wiki/BDD_(%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5)")

Разработка функции возведения в степень — pow(): спецификация.
Допустим, мы хотим написать функцию pow(x, n), которая возводит x в целочисленную степень n. Мы предполагаем, что n ≥ 0.
Эта задача взята в качестве примера (в JS есть оператор **, который служит для возведения в степень). Мы сосредоточимся на процессе разработки, который также можно применять и для более сложных задач.
Перед тем, как начать писать код функции pow, мы можем представить себе, что она должна делать, и описать её.
Такое описание называется спецификацией (specification). Она содержит описания различных способов использования и тесты для них, например:
	describe("pow", function() {
		it("возводит в степень n", function() {
			assert.equal(pow(2, 3), 8);
		});
	});
Спецификация состоит из трёх основных блоков:
	- describe("заголовок", function() { ... }) // Какую функциональность мы описываем. В нашем случае мы описываем функцию pow. Используется для группировки рабочих лошадок – блоков it.
	- it("описание", function() { ... }) // В первом аргументе блока it мы человеческим языком описываем конкретный способ использования функции, а во втором – пишем функцию, которая тестирует данный случай.
	- assert.equal(value1, value2) // Код внутри блока it, если функция работает верно, должен выполняться без ошибок.
Функции вида assert.* используются для проверки того, что функция pow работает так, как мы ожидаем. В этом примере мы используем одну из них – assert.equal, которая сравнивает переданные значения и выбрасывает ошибку, если они не равны друг другу. Существуют и другие типы сравнений и проверок, которые мы добавим позже.
Спецификация может быть запущена, и при этом будет выполнена проверка, указанная в блоке it, мы увидим это позднее.

Процесс разработки.
Процесс разработки обычно выглядит следующим образом:
	1. Пишется начальная спецификация с тестами, проверяющими основную функциональность.
	2. Создаётся начальная реализация.
	3. Для запуска тестов мы используем фреймворк Mocha ("https://mochajs.org/", подробнее о нём чуть позже). Пока функция не готова, будут ошибки. Вносим изменения до тех пор, пока всё не начнёт работать так, как нам нужно.
	4. Теперь у нас есть правильно работающая начальная реализация и тесты.
	5. Мы добавляем новые способы использования в спецификацию, возможно, ещё не реализованные в тестируемом коде. Тесты начинают падать (выдавать ошибки).
	6. Возвращаемся на шаг 3, дописываем реализацию до тех пор, пока тесты не начнут завершаться без ошибок.
	7. Повторяем шаги 3-6, пока требуемая функциональность не будет готова.
Таким образом, разработка проходит итеративно. Мы пишем спецификацию, реализуем её, проверяем, что тесты выполняются без ошибок, пишем ещё тесты, снова проверяем, что они проходят и т.д.
Давайте посмотрим этот поток разработки на нашем примере.
Первый шаг уже завершён. У нас есть спецификация для функции pow. Теперь, перед тем, как писать реализацию, давайте подключим библиотеки для пробного запуска тестов, просто чтобы убедиться, что тесты работают (разумеется, они завершатся ошибками).

Спецификация в действии.
В этой главе мы будем пользоваться следующими JavaScript-библиотеками для тестов:
	- Mocha ("https://mochajs.org/") – основной фреймворк. Он предоставляет общие функции тестирования, такие как describe и it, а также функцию запуска тестов.
	- Chai ("https://chaijs.com/") – библиотека, предоставляющая множество функций проверки утверждений. Пока мы будем использовать только assert.equal.
	- Sinon ("https://sinonjs.org/") – библиотека, позволяющая наблюдать за функциями, эмулировать встроенные функции и многое другое. Нам она пригодится позднее.
Эти библиотеки подходят как для тестирования внутри браузера, так и на стороне сервера. Мы рассмотрим вариант с браузером.

index.html:
	<!DOCTYPE html>
	<html lang="en">
	<head>
		<meta charset="UTF-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1.0" />
		<title>возведение в степень</title>
		<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/mocha/3.2.0/mocha.css"
		/> <!-- добавим стили mocha для отображения результатов -->
		<!-- добавляем фреймворк mocha -->
		<script src="https://cdnjs.cloudflare.com/ajax/libs/mocha/3.2.0/mocha.js"></script>
		<script>
			mocha.setup("bdd"); // включаем режим тестирования в стиле BDD
		</script>
		<!-- добавляем chai (предоставляет большое количество функций) -->
		<script src="https://cdnjs.cloudflare.com/ajax/libs/chai/3.5.0/chai.js"></script>
		<script>
			let assert = chai.assert; // объявляем assert глобально
		</script>
	</head>
	<body>
		<script>
			function pow(x, n) {
				/* Здесь будет реализация функции, пока пусто */
			}
		</script>
		<script src="./test.js"></script> <!-- скрипт со спецификацией -->
		<div id="mocha"></div> <!-- результаты тестов -->
		<script>
			mocha.run();
		</script> <!-- запускаем тесты! -->
	</body>
	</html>
Условно страницу можно разделить на пять частей:
	1. Тег <head> содержит сторонние библиотеки и стили для тестов.
	2. Тег <script> содержит тестируемую функцию, в нашем случае – pow.
	3. Тесты – в нашем случае внешний скрипт test.js, который содержит спецификацию describe("pow", ...).
	4. HTML-элемент <div id="mocha"> будет использован фреймворком Mocha для вывода результатов тестирования.
	5. Запуск тестов производится командой mocha.run().

test.js:
	describe("pow", function() {
		it("возводит в степень n", function() {
			assert.equal(pow(2, 3), 8);
		});
	});

=> "http://127.0.0.1:5500/index.html" : 
	pow
		x возводит в степень n
			AssertionError: expected undefined to equal 8
				at Context.<anonymous> (test.js:3:16)
Пока что тест завершается ошибкой. Это логично, потому что у нас пустая функция pow, так что pow(2,3) возвращает undefined вместо 8.
На будущее отметим, что существуют более высокоуровневые фреймворки для тестирования, такие как karma ("https://karma-runner.github.io/") и другие. С их помощью легко сделать автозапуск множества тестов.

Улучшаем спецификацию.
Дополним спецификацию тестами:
test.js:
	describe("pow", function () {
		it("2 в степени 3 будет 8", function () {
			assert.equal(pow(2, 3), 8);
		});
		it("3 в степени 3 будет 27", function () {
			assert.equal(pow(3, 3), 27);
		});
	});
Разделим тесты; т.к. если первый assert выбросит ошибку, результат работы второго assert мы уже не узнаем. Разделять тесты нужно чтобы получить больше информации о том, что конкретно пошло не так.
Один тест проверяет одну вещь.
Если вы посмотрите на тест и увидите в нём две независимые проверки, то такой тест лучше разделить на два более простых.

Улучшаем реализацию.
Давайте напишем что-то более похожее на функцию возведения в степень, чтобы заставить тесты проходить.
index.html:+
    <script>
        function pow(x, n) {
            let result = 1;
            for (let i = 0; i < n; i++) result *= x;
            return result;
        }
    </script>
Чтобы убедиться, что эта реализация работает нормально, давайте протестируем её на большем количестве значений. Чтобы не писать вручную каждый блок it, мы можем генерировать их в цикле for:
test.js:
	describe("pow", function () {
		function makeTest(x) {
			let expected = x * x * x;
			it(`${x} в степени 3 будет ${expected}`, function () {
				assert.equal(pow(x, 3), expected);
			});
		}
		for (let x = 1; x <= 5; x++) makeTest(x);
	});
=> http://127.0.0.1:5500/index.html :
	pow
		1 в степени 3 будет 1
		2 в степени 3 будет 8
		3 в степени 3 будет 27
		4 в степени 3 будет 64
		5 в степени 3 будет 125

Вложенные блоки describe.
Мы собираемся добавить больше тестов. Однако, перед этим стоит сгруппировать вспомогательную функцию makeTest и цикл for. Нам не нужна функция makeTest в других тестах, она нужна только в цикле for. Её предназначение – проверить, что pow правильно возводит число в заданную степень.
Группировка производится вложенными блоками describe:
test.js:
	describe("pow", function () {
		describe("возводит x в степень 3", function() {
			function makeTest(x) {
				let expected = x * x * x;
				it(`${x} в степени 3 будет ${expected}`, function () {
					assert.equal(pow(x, 3), expected);
				});
			}
			for (let x = 1; x <= 5; x++) makeTest(x);
		});
	});
Вложенные describe образуют новую подгруппу тестов. В результатах мы можем видеть дополнительные отступы в названиях.
=> http://127.0.0.1:5500/index.html :
	pow
		возводит x в степень 3
			1 в степени 3 будет 1
			2 в степени 3 будет 8
			3 в степени 3 будет 27
			4 в степени 3 будет 64
			5 в степени 3 будет 125
В будущем мы можем написать новые it и describe блоки на верхнем уровне со своими собственными вспомогательными функциями. Им не будет доступна функция makeTest из примера выше.

before/after и beforeEach/afterEach.
Мы можем задать before/after функции, которые будут выполняться до/после тестов, а также функции beforeEach/afterEach, выполняемые до/после каждого it. Например:
test.js:+
	describe("тест", function() {
		before(() => alert("Тестирование началось – перед тестами"));
		after(() => alert("Тестирование закончилось – после всех тестов")); 
		beforeEach(() => alert("Перед тестом – начинаем выполнять тест"));
		afterEach(() => alert("После теста – заканчиваем выполнение теста"));
		it('тест 1', () => alert(1));
		it('тест 2', () => alert(2));
	});
=> http://127.0.0.1:5500 :
	тест
		тест 1 1137ms
		тест 2 1016ms
Порядок выполнения будет таким:
	1. Тестирование началось – перед тестами (before)
	2. Перед тестом – начинаем выполнять тест (beforeEach)
	3. 1
	4. После теста – заканчиваем выполнение теста (afterEach)
	5. Перед тестом – начинаем выполнять тест (beforeEach)
	6. 2
	7. После теста – заканчиваем выполнение теста (afterEach)
	8. Тестирование закончилось – после всех тестов (after)
Обычно beforeEach/afterEach и before/after используются для инициализации, обнуления счётчиков или чего-нибудь ещё между тестами (или группами тестов).

Расширение спецификации.
Основная функциональность pow реализована. Первая итерация разработки завершена. Когда мы закончим отмечать и пить шампанское, давайте продолжим работу и улучшим pow. 
Как было сказано, функция pow(x, n) предназначена для работы с целыми положительными значениями n.
Для обозначения математических ошибок функции JS обычно возвращают NaN. Давайте делать также для некорректных значений n.
Сначала давайте опишем это поведение в спецификации:
test.js:
	describe("pow", function () {
		it("для отрицательных n возвращает NaN", function () {
			assert.isNaN(pow(2, -1));
		});
		it("для дробных n возвращает NaN", function () {
			assert.isNaN(pow(2, 1.5));
		});
		describe("возводит x в степень 3", function () {
			function makeTest(x) {
				let expected = x * x * x;
				it(`${x} в степени 3 будет ${expected}`, function () {
					assert.equal(pow(x, 3), expected);
				});
			}
			for (let x = 1; x <= 5; x++) makeTest(x);
		});
	});
Новые тесты падают, потому что наша реализация не поддерживает их. Так работает BDD. Сначала мы добавляем тесты, которые падают, а уже потом пишем под них реализацию.

Другие функции сравнения.
Обратите внимание на assert.isNaN. Это проверка того, что переданное значение равно NaN.
Библиотека Chai содержит множество других подобных функций, например:
	assert.equal(value1, value2); // проверяет равенство value1 == value2.
	assert.strictEqual(value1, value2); // проверяет строгое равенство value1 === value2.
	assert.notEqual, assert.notStrictEqual; // проверяет неравенство и строгое неравенство соответственно.
	assert.isTrue(value); // проверяет, что value === true
	assert.isFalse(value); // проверяет, что value === false
…с полным списком можно ознакомиться в документации - https://chaijs.com/api/assert/

Итак, нам нужно добавить пару строчек в функцию pow:
	if (n < 0) return NaN;
	if (Math.round(n) != n) return NaN;
Теперь работает, все тесты проходят:
=> http://127.0.0.1:5500 :
	pow
		для отрицательных n возвращает NaN‣
		для дробных n возвращает NaN‣
		возводит x в степень 3
			1 в степени 3 будет 1‣
			2 в степени 3 будет 8‣
			3 в степени 3 будет 27‣
			4 в степени 3 будет 64‣
			5 в степени 3 будет 125

Итого:
В BDD сначала пишут спецификацию, а потом реализацию. В конце у нас есть и то, и другое.
Спецификацию можно использовать тремя способами:
	1. Как Тесты – они гарантируют, что функция работает правильно.
	2. Как Документацию – заголовки блоков describe и it описывают поведение функции.
	3. Как Примеры – тесты, по сути, являются готовыми примерами использования функции.
Имея спецификацию, мы можем улучшить, изменить и даже переписать функцию с нуля, и при этом мы будем уверены, что она продолжает работать правильно.
Это особенно важно в больших проектах, когда одна функция может быть использована во множестве мест. Когда мы вносим в такую функцию изменения, у нас нет никакой возможности вручную проверить, что она продолжает работать правильно во всех местах, где её используют.
Не имея тестов, людям приходится выбирать один из двух путей:
	1. Внести изменения, и неважно, что будет. Потом у наших пользователей станут проявляться ошибки, ведь мы наверняка что-то забудем проверить вручную.
	2. Или же, если наказание за ошибки в коде серьёзное, то люди просто побоятся вносить изменения в такие функции. Код будет стареть, «зарастать паутиной», и никто не захочет в него лезть. Это нехорошо для разработки.
Автоматическое тестирование кода позволяет избежать этих проблем!
Если проект покрыт тестами, то вышеупомянутые проблемы не возникают. После любых изменений мы можем запустить тесты и увидеть результаты огромного количества проверок, сделанных за секунды.
Кроме того, код, хорошо покрытый тестами, как правило, имеет лучшую архитектуру. Это естественно, ведь такой код легче менять и улучшать. Но не только по этой причине.
Для написания тестов нужно организовать код таким образом, чтобы у каждой функции была ясно поставленная задача и точно определены её аргументы и возвращаемое значение. А это означает, что мы получаем хорошую архитектуру с самого начала.
В реальности это не всегда так просто. Иногда сложно написать спецификацию до того, как будет написана реализация, потому что не всегда чётко понятно, как та или иная функция должна себя вести. Но в общем и целом написание тестов делает разработку быстрее, а итоговый продукт более стабильным.
Далее по книге мы встретим много задач с тестами, так что вы увидите много практических примеров.

Что не так с этим тестом?
важность: 5
Что не так в нижеприведённом тесте функции pow?
	it("Возводит x в степень n", function() {
		let x = 5;
		let result = x;
		assert.equal(pow(x, 1), result);
		result *= x;
		assert.equal(pow(x, 2), result);
		result *= x;
		assert.equal(pow(x, 3), result);
	});
P.S. Тест не содержит синтаксических ошибок и успешно проходит.

решение:
Тест демонстрирует один из соблазнов, с которым сталкиваются разработчики при их написании. У нас тут, по сути, три теста, но они написаны как одна функция с тремя проверками. Иногда так проще писать, но если произойдёт ошибка, то гораздо сложнее понять, что пошло не так. Если ошибка происходит посередине сложного потока выполнения, то нам придётся выяснять, какие данные были в этом месте. По сути, придётся отлаживать тест.
Гораздо лучше разбить тест на несколько блоков it и ясно описать входные и ожидаемые на выходе данные. Примерно так:
	describe("Возводит x в степень n", function() {
		it("5 в степени 1 будет 5", function() {
			assert.equal(pow(5, 1), 5);
		});
		it("5 в степени 2 будет 25", function() {
			assert.equal(pow(5, 2), 25);
		});
		it("5 в степени 3 будет 125", function() {
			assert.equal(pow(5, 3), 125);
		});
	});
Мы заменили один it на describe и группу блоков it. Теперь, если какой-либо из блоков завершится неудачно, мы точно увидим, с какими данными это произошло.
Также мы можем изолировать один тест и запускать только его, написав it.only вместо it:
	describe("Возводит x в степень n", function() {
		it("5 в степени 1 будет 5", function() {
			assert.equal(pow(5, 1), 5);
		});
		it.only("5 в степени 2 будет 25", function() { // Mocha будет запускать только этот блок
			assert.equal(pow(5, 2), 25);
		});
		it("5 в степени 3 будет 125", function() {
			assert.equal(pow(5, 3), 125);
		});
	});

#1.3.6. Полифилы
10.2.25 - https://learn.javascript.ru/polyfills
JS – динамично развивающийся язык программирования. Регулярно появляются предложения о добавлении новых возможностей, они анализируются, и если предложения одобряются, то описания новых возможностей языка переносятся в черновик "https://tc39.github.io/ecma262/", а затем публикуются в спецификации ("https://www.ecma-international.org/publications/standards/Ecma-262.htm").
Разработчики JS-движков сами решают, какие предложения реализовывать в первую очередь. Они могут заранее добавить в браузеры поддержку функций, которые всё ещё находятся в черновике, и отложить разработку функций, которые уже перенесены в спецификацию, потому что они менее интересны разработчикам или более сложные в реализации. Т.о. довольно часто реализуется только часть стандарта.
Можно проверить текущее состояние поддержки различных возможностей JS на странице "https://compat-table.github.io/compat-table/es6/" (нам ещё предстоит изучить многое из этого списка).

Babel.
Когда мы используем современные возможности JS, некоторые движки могут не поддерживать их. Как было сказано выше, не везде реализованы все функции. И тут приходит на помощь Babel. 
Babel ("https://babeljs.io/") – это транспилер. Он переписывает современный JS-код в предыдущий стандарт. 
На самом деле, есть две части Babel:
	(1) Во-первых, транспилер, который переписывает код. Разработчик запускает Babel на своём компьютере. Он переписывает код в старый стандарт. И после этого код отправляется на сайт. Современные сборщики проектов, такие как webpack ("https://webpack.github.io/") или brunch ("https://brunch.io/"), предоставляют возможность запускать транспилер автоматически после каждого изменения кода, что позволяет экономить время.
	(2) Во-вторых, полифил. Новые возможности языка могут включать встроенные функции и синтаксические конструкции. Транспилер переписывает код, преобразовывая новые синтаксические конструкции в старые. Но что касается новых встроенных функций, нам нужно их как-то реализовать. JS является высокодинамичным языком, скрипты могут добавлять/изменять любые функции, чтобы они вели себя в соответствии с современным стандартом.
	Термин "полифил" означает, что скрипт "заполняет" пробелы и добавляет современные функции.
Интересное хранилище полифилов: core-js ("https://github.com/zloirock/core-js") поддерживает много функций, можно подключать только нужные.
Таким образом, чтобы современные функции поддерживались в старых движках, нам надо установить транспилер и добавить полифил.

#1.4. Объекты: основы
#1.4.1. Объекты
11.2.25 - https://learn.javascript.ru/object
Объекты.
Как мы знаем из главы Типы данных, в JS существует 8 типов данных. Семь из них называются примитивными, так как содержат только одно значение (будь то строка, число или что-то другое). Объекты же используются для хранения коллекций различных значений и более сложных сущностей. В JS объекты используются очень часто, это одна из основ языка. Поэтому мы должны понять их, прежде чем углубляться куда-либо ещё.
Объект может быть создан с помощью фигурных скобок {[ключ: значение]} с необязательным списком свойств. Свойство – это пара "ключ: значение", где ключ – это строка (также называемая "именем свойства"), а значение может быть чем угодно.
Мы можем представить объект в виде ящика с подписанными папками. Каждый элемент данных хранится в своей папке, на которой написан ключ. По ключу папку легко найти, удалить или добавить в неё что-либо.
Пустой объект (пустой ящик) можно создать, используя один из двух вариантов синтаксиса:
	let user = new Object(); // синтаксис "конструктор объекта"
	let user = {};  // синтаксис "литерал объекта"
Обычно используют вариант с фигурными скобками {...}. Такое объявление называют литералом объекта или литеральной нотацией.

Литералы и свойства.
При использовании литерального синтаксиса {...} мы сразу можем поместить в объект несколько свойств в виде пар "ключ: значение":
	let user = {     // объект
		name: "John",  // под ключом "name" хранится значение "John"
		age: 30        // под ключом "age" хранится значение 30
	};
У каждого свойства есть ключ (также называемый "имя" или "идентификатор"). После имени свойства следует двоеточие ":", и затем указывается значение свойства. Если в объекте несколько свойств, то они перечисляются через запятую.
В объекте user сейчас находятся два свойства:
	Первое свойство с именем "name" и значением "John".
	Второе свойство с именем "age" и значением 30.
Можно сказать, что наш объект user – это ящик с двумя папками, подписанными name и age.
Мы можем в любой момент добавить в него новые папки, удалить папки или прочитать содержимое любой папки.
Для обращения к свойствам используется запись "через точку":
	// получаем свойства объекта:
	console.log( user.name ); // John
	console.log( user.age ); // 30
Значение может быть любого типа. Давайте добавим свойство с логическим значением:
	user.isAdmin = true;
Для удаления свойства мы можем использовать оператор delete:
	delete user.age;
Имя свойства может состоять из нескольких слов, но тогда оно должно быть заключено в кавычки:
	let user = {
		name: "John",
		age: 30,
		"likes birds": true  // имя свойства из нескольких слов должно быть в кавычках
	};
Последнее свойство объекта может заканчиваться запятой:
	let user = {
		name: "John",
		age: 30,
	}
Это называется "висячая запятая". Такой подход упрощает добавление, удаление и перемещение свойств, так как все строки объекта становятся одинаковыми.

Объект, объявленный как константа (через const), может быть изменён.
Например:
	const user = {name: "John"};
	user.name = "Pete"; // (*)
	console.log(user.name); // Pete
Может показаться, что строка (*) должна вызвать ошибку, но нет, здесь всё в порядке. Дело в том, что объявление const защищает от изменений только саму переменную user, а не её содержимое. Определение const выдаст ошибку только если мы присвоим переменной другое значение: user=....

Квадратные скобки.
Для свойств, имена которых состоят из нескольких слов, доступ к значению "через точку" не работает:
	user.likes birds = true // это вызовет синтаксическую ошибку
JS видит, что мы обращаемся к свойству user.likes, а затем идёт непонятное слово birds. В итоге синтаксическая ошибка.
Точка требует, чтобы ключ был именован по правилам именования переменных. То есть не имел пробелов, не начинался с цифры и не содержал специальные символы, кроме $ и _.
Для таких случаев существует альтернативный способ доступа к свойствам через квадратные скобки. Такой способ сработает с любым именем свойства:
	let user = {};
	user["likes birds"] = true; // присваивание значения свойству
	alert(user["likes birds"]); // true - получение значения свойства
	delete user["likes birds"]; // удаление свойства
Сейчас всё в порядке. Обратите внимание, что строка в квадратных скобках заключена в кавычки (подойдёт любой тип кавычек).
Квадратные скобки также позволяют обратиться к свойству, имя которого может быть результатом выражения. Например, имя свойства может храниться в переменной:
	let key = "likes birds";
	user[key] = true; // то же самое, что и user["likes birds"] = true;
Здесь переменная key может быть вычислена во время выполнения кода или зависеть от пользовательского ввода. После этого мы используем её для доступа к свойству. Это даёт нам большую гибкость.
Запись "через точку" такого не позволяет:
	let user = {name: "John", age: 30};
	let key = "name";
	console.log( user.key ); // undefined
	console.log( user[key] ); // John

Вычисляемые свойства.
Мы можем использовать квадратные скобки в литеральной нотации для создания вычисляемого свойства.
Пример:
	let fruit = prompt("Какой фрукт купить?", "apple");
	let bag = {
		[fruit]: 5, // имя свойства будет взято из переменной fruit
	};
	alert( bag.apple ); // 5, если fruit="apple"
Смысл вычисляемого свойства прост: запись [fruit] означает, что имя свойства необходимо взять из переменной fruit.
И если посетитель введёт слово "apple", то в объекте bag теперь будет лежать свойство {apple: 5}.
По сути, пример выше работает так же, как и bag[fruit] = 5;
Мы можем использовать и более сложные выражения в квадратных скобках:
	let fruit = 'apple';
	let bag = {
		[fruit + 'Computers']: 5 // bag.appleComputers = 5
	};
Квадратные скобки дают намного больше возможностей, чем запись через точку. Они позволяют использовать любые имена свойств и переменные, хотя и требуют более громоздких конструкций кода.
Подведём итог: в большинстве случаев, когда имена свойств известны и просты, используется запись через точку. Если же нужно что-то более сложное, то мы используем квадратные скобки.

Свойство из переменной.
Если название свойств name и age совпадают с названиями переменных, которые мы подставляем в качестве значений этих свойств, то существуют специальные короткие свойства для упрощения. Вместо name:name мы можем написать просто name:
	function makeUser(name, age) {
		return {
			name, // то же самое, что и name: name
			age   // то же самое, что и age: age
		};
	}
Мы можем использовать как обычные свойства, так и короткие в одном и том же объекте:
	let user = {name, /* тоже самое, что и name:name */ age: 30};

Ограничения на имена свойств.
Как мы уже знаем, имя переменной не может совпадать с зарезервированными словами, такими как for, let, return и т.д.
Но для свойств объекта такого ограничения нет. Иными словами, нет никаких ограничений к именам свойств. Они могут быть в виде строк или символов (специальный тип для идентификаторов, который будет рассмотрен позже). Все другие типы данных будут автоматически преобразованы к строке.
Например, если использовать число 0 в качестве ключа, то оно превратится в строку "0".
Есть небольшой подводный камень, связанный со специальным свойством __proto__. Мы не можем установить его в необъектное значение:
	let obj = {};
	obj.__proto__ = 5; // присвоим число
	alert(obj.__proto__); // [object Object], значение - это объект, т.е. не то, что мы ожидали
Как мы видим, присвоение примитивного значения 5 игнорируется.
Мы более подробно исследуем особенности свойства __proto__ в следующих главах (Прототипное наследование), а также предложим способы исправления такого поведения.

Проверка существования свойства, оператор in.
В отличие от многих других языков, особенность JS-объектов в том, что можно получить доступ к любому свойству. Даже если свойства не существует – ошибки не будет! При обращении к свойству, которого нет, возвращается undefined. Это позволяет просто проверить существование свойства:
	let user = {};
	alert( user.noSuchProperty === undefined ); // true означает "свойства нет"
Также существует специальный оператор "in" для проверки существования свойства в объекте.
Синтаксис оператора:
	"key" in object
Пример:
	let user = { name: "John", age: 30 };
	alert( "age" in user ); // true, user.age существует
	alert( "blabla" in user ); // false, user.blabla не существует
Обратите внимание, что слева от оператора in должно быть имя свойства. Обычно это строка в кавычках.
Если мы опускаем кавычки, это значит, что мы указываем переменную, в которой находится имя свойства. Например:
	let user = { age: 30 };
	let key = "age";
	alert( key in user ); // true, имя свойства было взято из переменной key
Для чего вообще нужен оператор in? Разве недостаточно сравнения с undefined?
В большинстве случаев прекрасно сработает сравнение с undefined. Но есть особый случай, когда оно не подходит и нужно использовать in. Это когда свойство существует, но содержит значение undefined:
	let obj = {test: undefined};
	alert( obj.test ); //  выведет undefined, значит свойство не существует?
	alert( "test" in obj ); // true, свойство существует!
В примере выше свойство obj.test технически существует в объекте. Оператор in сработал правильно. Подобные ситуации случаются очень редко, так как undefined обычно явно не присваивается. Для неизвестных или пустых свойств мы используем значение null.

Цикл for..in.
Для перебора всех свойств объекта используется цикл for..in. Этот цикл отличается от изученного ранее цикла for(;;).
Синтаксис:
	for (key in object) {/* тело цикла выполняется для каждого свойства объекта */};
Все конструкции for позволяют нам объявлять переменную внутри цикла, как, например, let key.
Кроме того, мы могли бы использовать другое имя переменной. Например, часто используется вариант for (let prop in obj){...};.

Упорядочение свойств объекта.
Упорядочены ли свойства объекта? Другими словами, если мы будем в цикле перебирать все свойства объекта, получим ли мы их в том же порядке, в котором мы их добавляли? Можем ли мы на это рассчитывать?
Короткий ответ: свойства упорядочены особым образом: свойства с целочисленными ключами сортируются по возрастанию, остальные располагаются в порядке создания.
Например, телефонные коды идут в порядке возрастания, потому что они являются целыми числами: 1, 41, 44, 49.

Целочисленные свойства.
Термин "целочисленное свойство" означает строку, которая может быть преобразована в целое число и обратно без изменений.
То есть, "49" – это целочисленное имя свойства, потому что если его преобразовать в целое число, а затем обратно в строку, то оно не изменится. А вот свойства "+49" или "1.2" таковыми не являются:
	// Math.trunc - встроенная функция, которая удаляет десятичную часть
	alert( String(Math.trunc(Number("49"))) ); // "49", то же самое ⇒ свойство целочисленное
	alert( String(Math.trunc(Number("+49"))) ); // "49", не то же самое, что "+49" ⇒ свойство не целочисленное
	alert( String(Math.trunc(Number("1.2"))) ); // "1", не то же самое, что "1.2" ⇒ свойство не целочисленное

Если ключи не целочисленные, то они перебираются в порядке создания.

Итого:
Объекты – это ассоциативные массивы с рядом дополнительных возможностей.
Они хранят свойства (пары ключ: значение), где:
	- Ключи свойств должны быть строками или символами (обычно строками).
	- Значения могут быть любого типа.
Чтобы получить доступ к свойству, мы можем использовать:
	Запись через точку: obj.property.
	Квадратные скобки obj["property"]. Квадратные скобки позволяют взять ключ из переменной, например, obj[varWithKey].
Дополнительные операторы:
	Удаление свойства: delete obj.prop.
	Проверка существования свойства: "key" in obj.
	Перебор свойств объекта: цикл for..in: for (let key in obj).
То, что мы изучали в этой главе, называется простым объектом (plain object) или просто Object.
В JS есть много других типов объектов:
	Array для хранения упорядоченных коллекций данных,
	Date для хранения информации о дате и времени,
	Error для хранения информации об ошибке.
… и так далее.
У них есть свои особенности, которые мы изучим позже. Иногда люди говорят что-то вроде "тип данных Array" или "тип данных Date", но формально они не являются отдельными типами, а относятся к типу данных Object. Они лишь расширяют его различными способами.
Объекты в JS очень мощные. Здесь мы только немного углубились в действительно огромную тему. 

задачи:
1+. Напишите функцию isEmpty(obj), которая возвращает true, если у объекта нет свойств, иначе false.
	let schedule = {};
	console.log(isEmpty(schedule)); // true
	schedule["8:30"] = "get up";
	console.log(isEmpty(schedule)); // false
	function isEmpty(obj){
		for (let key in obj) return false;
		return true;
	} // в цикле перебираем свойства объекта и возвращаем false, как только встречаем свойство.
2+. Сумма свойств объекта
У нас есть объект, в котором хранятся зарплаты нашей команды: let salaries = {John: 100, Ann: 160, Pete: 130};
Напишите код для суммирования всех зарплат и сохраните результат в переменной sum. Должно получиться 390.
Если объект salaries пуст, то результат должен быть 0.
	let salaries = {John: 100, Ann: 160, Pete: 130};
	let sum = 0;
	for (let key in salaries) {
		sum += salaries[key];
	}
	console.log(sum); // 390
3+. Создайте функцию multiplyNumeric(obj), которая умножает все числовые свойства объекта obj на 2.
	// до вызова функции
	let menu = {width: 200, height: 300, title: "My menu"};
	multiplyNumeric(menu);
	// после вызова функции
	menu = {width: 400, height: 600, title: "My menu"};
Обратите внимание, что multiplyNumeric не нужно ничего возвращать. Следует напрямую изменять объект.
P.S. Используйте typeof для проверки, что значение свойства числовое.
	let menu = {width: 200, height: 300, title: "My menu"};
	console.log(typeof menu.width); // number
	multiplyNumeric(menu);
	function multiplyNumeric(obj){
		for (let key in obj) {
			if (typeof obj[key] == 'number') obj[key] *= 2; 
		}
	}
	// после вызова функции
	console.log(menu); // {width: 400, height: 600, title: 'My menu'}

#1.4.2. Копирование объектов и ссылки
12.2.25 - https://learn.javascript.ru/object-copy
Одно из фундаментальных отличий объектов от примитивов заключается в том, что объекты хранятся и копируются "по ссылке", тогда как примитивные значения: строки, числа, логические значения и т.д. – всегда копируются "как целое значение".
Это легко понять, если мы немного заглянем под капот того, что происходит, когда мы копируем значение. 
Давайте начнём с примитива, такого как строка.
Здесь мы помещаем копию message во phrase:
	let message = "Привет!";
	let phrase = message;
В результате мы имеем две независимые переменные, каждая из которых хранит строку "Привет!".
Объекты ведут себя иначе: Переменная, которой присвоен объект, хранит не сам объект, а его адрес в памяти – другими словами, ссылку на него.
Давайте рассмотрим пример такой переменной:
	let user = {name: "John"};
Объект хранится где-то в памяти, в то время как переменная user имеет лишь ссылку на него.
Мы можем думать о переменной объекта, такой как user, как о листе бумаги с адресом объекта на нем.
Когда мы выполняем действия с объектом, к примеру, берём свойство user.name, движок JS просматривает то, что находится по этому адресу, и выполняет операцию с самим объектом.
Теперь вот почему это важно: При копировании переменной объекта копируется ссылка, но сам объект не дублируется.
Например:
	let user = { name: "John" };
	let admin = user; // копируется ссылка
Теперь у нас есть две переменные, каждая из которых содержит ссылку на один и тот же объект.
Мы можем использовать любую переменную для доступа к объекту и изменения его содержимого:
	let user = { name: 'John' };
	let admin = user;
	admin.name = 'Pete'; // изменено по ссылке из переменной "admin"
	console.log(user.name); // 'Pete', изменения видны по ссылке из переменной "user"
Это как если бы у нас был шкаф с двумя ключами, и мы использовали один из них (admin), чтобы войти в него и внести изменения. А затем, если мы позже используем другой ключ (user), мы все равно открываем тот же шкаф и можем получить доступ к изменённому содержимому.

Сравнение по ссылке.
Два объекта равны только в том случае, если это один и тот же объект.
Например, здесь a и b ссылаются на один и тот же объект, поэтому они равны:
	let a = {};
	let b = a; // копирование по ссылке
	alert( a == b ); // true, обе переменные ссылаются на один и тот же объект
	alert( a === b ); // true
И здесь два независимых объекта не равны, даже если они выглядят одинаково (оба пусты):
	let a = {};
	let b = {}; // два независимых объекта
	alert( a == b ); // false
Для сравнений типа obj1 > obj2 или для сравнения с примитивом obj == 5 объекты преобразуются в примитивы. Очень скоро мы изучим, как работают преобразования объектов, но, по правде говоря, такие сравнения требуются очень редко и обычно они появляются в результате ошибок программиста.

Клонирование и объединение, Object.assign
Итак, копирование объектной переменной создаёт ещё одну ссылку на тот же объект. Но что, если нам всё же нужно дублировать объект? Создать независимую копию, клон?
Это тоже выполнимо, но немного сложнее, потому что в JS для этого нет встроенного метода. Но на самом деле в этом редко возникает необходимость, копирования по ссылке в большинстве случаев вполне хватает. 
Но если мы действительно этого хотим, то нам нужно создать новый объект и воспроизвести структуру существующего, перебрав его свойства и скопировав их на примитивном уровне.
Например так:
	let user = {name: "John", age: 30};
	let clone = {}; // новый пустой объект
	for (let key in user) clone[key] = user[key]; // скопируем все свойства user в него
	// теперь clone это полностью независимый объект с тем же содержимым
	clone.name = "Pete"; // изменим в нём данные
	alert( user.name ); // все ещё John в первоначальном объекте
Также мы можем использовать для этого метод Object.assign ("https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/assign").
Синтаксис:
	Object.assign(dest, [src1, src2, src3...]);
- Первый аргумент dest — целевой объект.
- Остальные аргументы src1, ..., srcN (может быть столько, сколько необходимо) являются исходными объектами
- Метод копирует свойства всех исходных объектов src1, ..., srcN в целевой объект dest. Другими словами, свойства всех аргументов, начиная со второго, копируются в первый объект.
- Возвращает объект dest.
Например, мы можем использовать его для объединения нескольких объектов в один:
	let user = { name: "John" };
	let permissions1 = { canView: true };
	let permissions2 = { canEdit: true };
	Object.assign(user, permissions1, permissions2); // копируем все свойства из permissions1 и permissions2 в user
	// теперь user = { name: "John", canView: true, canEdit: true }
Если скопированное имя свойства уже существует, оно будет перезаписано:
	let user = { name: "John" };
	Object.assign(user, { name: "Pete" });
	alert(user.name); // теперь user = { name: "Pete" }
Мы также можем использовать Object.assign для замены цикла for..in для простого клонирования:
	let user = {name: "John", age: 30};
	let clone = Object.assign({}, user);
Он копирует все свойства user в пустой объект и возвращает его.
Также существуют и другие методы клонирования объекта. Например, с использованием оператора расширения clone = {...user}, рассмотренного далее.

Вложенное клонирование.
До сих пор мы предполагали, что все свойства user примитивныe. Но свойства могут быть и ссылками на другие объекты. Что с ними делать?
Например, есть объект:
	let user = {name: "John", sizes: {height: 182, width: 50}};
	alert( user.sizes.height ); // 182
Теперь недостаточно просто скопировать clone.sizes = user.sizes, потому что user.sizes – это объект, он будет скопирован по ссылке. Таким образом, clone и user будут иметь общий объект sizes:
	let user = {name: "John", sizes: {height: 182, width: 50}};
	let clone = Object.assign({}, user);
	alert( user.sizes === clone.sizes ); // true, тот же объект
	// user и clone обладают общим свойством sizes
	user.sizes.width++;       // изменяем свойства в первом объекте
	alert(clone.sizes.width); // 51, видим результат в другом
Чтобы исправить это, мы должны использовать цикл клонирования, который проверяет каждое значение user[key] и, если это объект, тогда также копирует его структуру. Это называется "глубоким клонированием". Мы можем реализовать глубокое клонирование, используя рекурсию. Или, чтобы не изобретать велосипед заново, возьмите готовую реализацию, например _.cloneDeep(obj) ["https://lodash.com/docs#cloneDeep"] из библиотеки JS lodash ["https://lodash.com/"].
Также мы можем использовать глобальный метод structuredClone() ["https://developer.mozilla.org/en-US/docs/Web/API/structuredClone"], который позволяет сделать полную копию объекта. К сожалению он поддерживается только современными браузерами. 
Здесь ["https://caniuse.com/?search=structuredClone"] можно ознакомиться с поддержкой этого метода.

Объекты, объявленные как константа, могут быть изменены.
Важным побочным эффектом хранения объектов в качестве ссылок является то, что объект, объявленный как const, может быть изменён.
Например:
	const user = {name: "John"};
	user.name = "Pete"; // (*)
	alert(user.name); // Pete
Может показаться, что строка (*) вызовет ошибку, но, это не так. Значение user это константа, оно всегда должно ссылаться на один и тот же объект, но свойства этого объекта могут свободно изменяться. Другими словами, const user выдаст ошибку только в том случае, если мы попытаемся задать user = ... в целом.
Тем не менее, если нам действительно нужно создать постоянные свойства объекта, это тоже возможно, но с использованием совершенно других методов. Мы затронем это в главе Флаги и дескрипторы свойств.

Итого:
Объекты присваиваются и копируются по ссылке. Другими словами, переменная хранит не значение объекта, а ссылку (адрес в памяти) на это значение. Таким образом, копирование такой переменной или передача её в качестве аргумента функции копирует эту ссылку, а не сам объект.
Все операции с использованием скопированных ссылок (например, добавление/удаление свойств) выполняются с одним и тем же объектом.
Чтобы создать реальную копию (клон), мы можем использовать Object.assign для так называемой поверхностной копии (вложенные объекты копируются по ссылке) или функцию глубокого клонирования, такую как _.cloneDeep(obj) ["https://lodash.com/docs#cloneDeep"].

#1.4.3. Сборка мусора
14.2.25 - https://learn.javascript.ru/garbage-collection
Сборка мусора.
Управление памятью в JS выполняется автоматически и незаметно. Мы создаём примитивы, объекты, функции… Всё это занимает память.
Но что происходит, когда что-то больше не нужно? Как движок JS обнаруживает, что пора очищать память?

Достижимость.
Основной концепцией управления памятью в JS является принцип достижимости.
Если упростить, то достижимые значения – это те, которые доступны или используются. Они гарантированно находятся в памяти.
	1. Существует базовое множество достижимых значений, которые не могут быть удалены.
	Например:
	- Выполняемая в данный момент функция, её локальные переменные и параметры.
	- Другие функции в текущей цепочке вложенных вызовов, их локальные переменные и параметры.
	- Глобальные переменные.
	- (некоторые другие внутренние значения)
	Эти значения мы будем называть корнями.
	2. Любое другое значение считается достижимым, если оно доступно из корня по ссылке или по цепочке ссылок.
	Например, если в глобальной переменной есть объект, и он имеет свойство, в котором хранится ссылка на другой объект, то этот объект считается достижимым. И те, на которые он ссылается, тоже достижимы. Далее вы познакомитесь с подробными примерами на эту тему.
В движке JS есть фоновый процесс, который называется сборщиком мусора ("https://ru.wikipedia.org/wiki/Сборка_мусора"). Он отслеживает все объекты и удаляет те, которые стали недоступными.

Простой пример:
	let user = {name: "John"}; // в user находится ссылка на объект
Глобальная переменная user ссылается на объект {name: "John"}. В свойстве "name" объекта John хранится примитив.
Если перезаписать значение user, то ссылка потеряется:
	user = null;
Теперь объект John становится недостижимым. К нему нет доступа, на него нет ссылок. Сборщик мусора удалит эти данные и освободит память.
Представим, что мы скопировали ссылку из user в admin:
	let user = {name: "John"}; // в user находится ссылка на объект
	let admin = user;
Теперь, если мы сделаем то же самое:
	user = null;
…то объект John всё ещё достижим через глобальную переменную admin, поэтому он находится в памяти. Если бы мы также перезаписали admin, то John был бы удалён.

Взаимосвязанные объекты.
Теперь более сложный пример. Семья:
	function marry(man, woman) {
		woman.husband = man;
		man.wife = woman;
		return {father: man, mother: woman}
	}
	let family = marry({name: "John"}, {name: "Ann"});
Функция marry "женит" два объекта, давая им ссылки друг на друга, и возвращает новый объект, содержащий ссылки на два предыдущих.
На данный момент все объекты достижимы.
Теперь удалим две ссылки:
	delete family.father;
	delete family.mother.husband;
Недостаточно удалить только одну из этих двух ссылок, потому что все объекты останутся достижимыми.
Но если мы удалим обе, то увидим, что у объекта John больше нет входящих ссылок.
Исходящие ссылки не имеют значения. Только входящие ссылки могут сделать объект достижимым. Объект John теперь недостижим и будет удалён из памяти со всеми своими данными, которые также стали недоступны.

Недостижимый "остров".
Вполне возможна ситуация, при которой целый «остров» взаимосвязанных объектов может стать недостижимым и удалиться из памяти.
Возьмём объект family из примера выше. А затем:
	family = null;
Объекты John и Ann всё ещё связаны, оба имеют входящие ссылки, но этого недостаточно.
Бывший объект family был отсоединён от корня, на него больше нет ссылки, поэтому весь "остров" становится недостижимым и будет удалён.

Внутренние алгоритмы.
Основной алгоритм сборки мусора называется "алгоритм пометок" (от англ. mark-and-sweep).
Согласно этому алгоритму, сборщик мусора регулярно выполняет следующие шаги:
	- Сборщик мусора помечает (запоминает) все корневые объекты.
	- Затем он идёт по ним и помечает все ссылки из них.
	- Затем он идёт по отмеченным объектам и отмечает их ссылки. Все посещённые объекты запоминаются, чтобы в будущем не посещать один и тот же объект дважды.
	- …И так далее, пока не будут посещены все достижимые (из корней) ссылки.
	- Все непомеченные объекты удаляются.
Мы также можем представить себе этот процесс как выливание огромного ведра краски из корней, которая течёт по всем ссылкам и отмечает все достижимые объекты. Затем непомеченные удаляются. Это концепция того, как работает сборка мусора. Движки JS применяют множество оптимизаций, чтобы она работала быстрее и не задерживала выполнение кода.
Вот некоторые из оптимизаций:
	- Сборка по поколениям (Generational collection) – объекты делятся на два набора: новые и старые. В типичном коде многие объекты имеют короткую жизнь: они появляются, выполняют свою работу и быстро умирают, так что имеет смысл отслеживать новые объекты и, если это так, быстро очищать от них память. Те, которые выживают достаточно долго, становятся старыми и проверяются реже.
	- Инкрементальная сборка (Incremental collection) – если объектов много, и мы пытаемся обойти и пометить весь набор объектов сразу, это может занять некоторое время и привести к видимым задержкам в выполнении скрипта. Так что движок делит всё множество объектов на части, и далее очищает их одну за другой. Получается несколько небольших сборок мусора вместо одной всеобщей. Это требует дополнительного учёта для отслеживания изменений между частями, но зато получается много крошечных задержек вместо одной большой.
	- Сборка в свободное время (Idle-time collection) – чтобы уменьшить возможное влияние на производительность, сборщик мусора старается работать только во время простоя процессора.
Существуют и другие способы оптимизации и разновидности алгоритмов сборки мусора. Но как бы мне ни хотелось описать их здесь, я должен воздержаться, потому что разные движки реализуют разные хитрости и методы. И, что ещё более важно, все меняется по мере развития движков, поэтому изучать тему глубоко "заранее", без реальной необходимости, вероятно, не стоит. Если, конечно, это не вопрос чистого интереса, тогда для вас будет несколько ссылок ниже.

Итого, главное, что нужно знать:
- Сборка мусора выполняется автоматически. Мы не можем ускорить или предотвратить её.
- Объекты сохраняются в памяти, пока они достижимы.
- Если на объект есть ссылка – вовсе не факт, что он является достижимым (из корня): набор взаимосвязанных объектов может стать недоступен в целом, как мы видели в примере выше.
Современные движки реализуют разные продвинутые алгоритмы сборки мусора. О многих из них рассказано в прекрасной книге о сборке мусора «The Garbage Collection Handbook: The Art of Automatic Memory Management» (R. Jones и др.).
Если вы знакомы с низкоуровневым программированием, то более подробная информация о сборщике мусора V8 находится в статье A tour of V8: Garbage Collection ("https://jayconrod.com/posts/55/a-tour-of-v8-garbage-collection").
Также в блоге V8 ("https://v8.dev/") время от времени публикуются статьи об изменениях в управлении памятью. Разумеется, чтобы изучить сборку мусора, вам лучше подготовиться, узнав о том как устроен движок V8 внутри в целом и почитав блог Вячеслава Егорова ("https://mrale.ph/"), одного из инженеров, разрабатывавших V8. Я говорю про V8, потому что он лучше всего освещается в статьях в Интернете. Для других движков многие подходы схожи, но сборка мусора отличается во многих аспектах.
Глубокое понимание работы движков полезно, когда вам нужна низкоуровневая оптимизация. Было бы разумно запланировать их изучение как следующий шаг после того, как вы познакомитесь с языком.

#1.4.4. Методы объекта, this
16.2.25 - https://learn.javascript.ru/object-methods
Объекты обычно создаются, чтобы представлять сущности реального мира, будь то пользователи, заказы и так далее:
	let user = {name: "John", age: 30}; // Объект пользователя
И так же, как и в реальном мире, пользователь может совершать действия: выбирать что-то из корзины покупок, авторизовываться, выходить из системы, оплачивать и т.п. Такие действия в JS представлены функциями в свойствах.

Примеры методов
Для начала давайте научим нашего пользователя user здороваться:
	user.sayHi = function() {alert("Привет!")};
	user.sayHi(); // Привет!
Здесь мы просто использовали Function Expression (функциональное выражение), чтобы создать функцию приветствия, и присвоили её свойству user.sayHi нашего объекта. Затем мы можем вызвать ee как user.sayHi().
Функцию, которая является свойством объекта, называют методом этого объекта; т.о. мы получили метод sayHi объекта user.
Также, мы могли бы использовать заранее объявленную функцию в качестве метода, вот так:
	function sayHi() {alert("Привет!")}; // сначала, объявляем
	user.sayHi = sayHi; // затем добавляем в качестве метода
	user.sayHi(); // Привет!

Объектно-ориентированное программирование (ООП).
Когда мы пишем наш код, используя объекты для представления сущностей реального мира, – это называется объектно-ориентированным программированием или сокращённо: ООП ("https://ru.wikipedia.org/wiki/Объектно-ориентированное_программирование"). 
ООП является большой предметной областью и интересной наукой самой по себе. Как выбрать правильные сущности? Как организовать взаимодействие между ними? Это – создание архитектуры, и на эту тему есть отличные книги, такие как "Приёмы объектно-ориентированного проектирования. Паттерны проектирования" авторов Эрих Гамма, Ричард Хелм, Ральф Джонсон, Джон Влиссидес, или "Объектно-ориентированный анализ и проектирование с примерами приложений" Гради Буча, а также ещё множество других книг.

Сокращённая запись метода.
Существует более короткий синтаксис для методов в литерале объекта:
	user = {sayHi: function() {alert("Привет")}}; // сокращённая запись выглядит лучше
	user = {sayHi() { /* то же самое, что и "sayHi: function(){...}"*/ alert("Привет")}};
Как было показано, мы можем пропустить ключевое слово "function" и просто написать sayHi().
Нужно отметить, что эти две записи не полностью эквивалентны. Есть тонкие различия, связанные с наследованием объектов (что будет рассмотрено позже), но на данном этапе это неважно. Почти во всех случаях сокращённый синтаксис предпочтителен.

Ключевое слово this в методах.
Как правило, методу объекта обычно требуется доступ к информации, хранящейся в объекте, для выполнения своей работы. Например, коду внутри user.sayHi() может потребоваться имя пользователя, которое хранится в объекте user. Для доступа к информации внутри объекта метод может использовать ключевое слово this.
Значение this – это объект перед точкой, который используется для вызова метода.
Например:
	let user = {
		name: "John", age: 30,
		sayHi() {alert(this.name)} // this - это текущий объект
	};
	user.sayHi(); // John
Здесь во время выполнения кода user.sayHi() значением this будет являться user (ссылка на объект user).
Технически также возможно получить доступ к объекту без ключевого слова this, обратившись к нему через внешнюю переменную (в которой хранится ссылка на этот объект):
	let user = {
		name: "John", age: 30,
		sayHi() {alert(user.name)} // user вместо this
	};
…Но такой код ненадёжен. Если мы решим скопировать ссылку на объект user в другую переменную, например, admin = user, и перезапишем переменную user чем-то другим, тогда будет осуществлён доступ к неправильному объекту при вызове метода из admin.
Это показано ниже:
	let user = {
		name: "John", age: 30,
		sayHi() {alert(user.name)} // приведёт к ошибке
	};
	let admin = user;
	user = null; // перезапишем переменную для наглядности, теперь она не хранит ссылку на объект.
	admin.sayHi(); // TypeError: Cannot read property 'name' of null
Если бы мы использовали this.name вместо user.name внутри alert, тогда этот код бы сработал.

this не является фиксированным.
В JS ключевое слово this ведёт себя иначе, чем в большинстве других языков программирования. Его можно использовать в любой функции, даже если это не метод объекта.
В следующем примере нет синтаксической ошибки:
	function sayHi() {alert(this.name)};
Значение this вычисляется во время выполнения кода, в зависимости от контекста.
Например, здесь одна и та же функция назначена двум разным объектам и имеет различное значение this в вызовах:
	let user = { name: "John" };
	let admin = { name: "Admin" };
	function sayHi() {alert( this.name )}; 
	user.f = sayHi;
	admin.f = sayHi; // используем одну и ту же функцию в двух объектах
	// эти вызовы имеют разное значение this; this внутри функции - это объект перед точкой
	user.f(); // John (this == user)
	admin.f(); // Admin (this == admin)
	admin['f'](); // Admin (нет разницы между использованием точки или квадратных скобок для доступа к объекту)
Правило простое: если вызывается obj.f(), то во время вызова f, this – это obj. 
Так что, в приведённом выше примере это либо user, либо admin.

Вызов без объекта: this == undefined.
Мы даже можем вызвать функцию вообще без объекта:
	function sayHi() {alert(this)};
	sayHi(); // undefined
В строгом режиме ("use strict") в таком коде значением this будет являться undefined. Если мы попытаемся получить доступ к this.name – это вызовет ошибку.
В нестрогом режиме значением this в таком случае будет глобальный объект (window в браузерe, мы вернёмся к этому позже в главе Глобальный объект). Это – исторически сложившееся поведение this, которое исправляется использованием строгого режима ("use strict").
Обычно подобный вызов является ошибкой программирования. Если внутри функции используется this, тогда она ожидает, что будет вызвана в контексте какого-либо объекта.

Последствия свободного this.
Если вы до этого изучали другие языки программирования, то вы, вероятно, привыкли к идее фиксированного this – когда методы, определённые в объекте, всегда имеют this, ссылающееся на этот объект.
В JS this является свободным, его значение вычисляется в момент вызова метода и не зависит от того, где этот метод был объявлен, а скорее от того, какой объект вызывает метод (какой объект стоит перед точкой).
Эта концепция вычисления this в момент исполнения имеет как свои плюсы, так и минусы. С одной стороны, функция может быть повторно использована в качестве метода у различных объектов (что повышает гибкость). С другой стороны, большая гибкость увеличивает вероятность ошибок.
Здесь наша позиция заключается не в том, чтобы судить, является ли это архитектурное решение в языке хорошим или плохим. Скоро мы поймем, как с этим работать, как получить выгоду и избежать проблем.

У стрелочных функций нет своего this.
Стрелочные функции особенные: у них нет своего собственного this. Если мы ссылаемся на this внутри такой функции, то оно берётся из внешней "нормальной" функции.
Например, здесь arrow() использует значение this из внешнего метода user.sayHi():
	let user = {
		firstName: "Ilya",
		sayHi() {
			let arrow = () => alert(this.firstName);
			arrow();
		}
	};
	user.sayHi(); // Ilya
Это особенность стрелочных функций. Она полезна, когда мы на самом деле не хотим иметь отдельное this, а скорее хотим взять его из внешнего контекста. Позже в главе Повторяем стрелочные функции мы увидим больше примеров на эту тему.

Итого:
	Функции, которые находятся в свойствах объекта, называются методами.
	Методы позволяют объектам "действовать": object.doSomething().
	Методы могут ссылаться на объект через this.
Значение this определяется во время исполнения кода.
	При объявлении любой функции в ней можно использовать this, но этот this не имеет значения до тех пор, пока функция не будет вызвана.
	Функция может быть скопирована между объектами (из одного объекта в другой).
	Когда функция вызывается синтаксисом метода – object.method(), значением this во время вызова является object.
Также ещё раз заметим, что стрелочные функции являются особенными – у них нет своего this. Когда внутри стрелочной функции обращаются к this, то его значение берётся извне.

1- 2- 3+
2. Создайте объект calculator (калькулятор) с тремя методами:
	read() (читать) запрашивает два значения и сохраняет их как свойства объекта с именами a и b.
	sum() (суммировать) возвращает сумму сохранённых значений.
	mul() (умножить) перемножает сохранённые значения и возвращает результат.
решение:
	let calculator = {
		read(){
			this.a = +prompt('введите число a');
			this.b = +prompt('введите число b');
		},
		sum(){return this.a + this.b},
		mul(){return this.a * this.b}
	};
	calculator.read();
	console.log('сумма: ', calculator.sum());
	console.log('произведение: ', calculator.mul());
// методы могут быть повторно использованы, а this в методах - это по сути объект перед точкой.
3. Цепь вызовов
важность: 2
У нас есть объект ladder (лестница), который позволяет подниматься и спускаться:
	let ladder = {
		step: 0,
		up() {this.step++},
		down() {this.step--},
		showStep: function() {console.log(this.step)} // показывает текущую ступеньку
	};
Теперь, если нам нужно выполнить несколько последовательных вызовов, мы можем сделать это так:
	ladder.up();
	ladder.up();
	ladder.down();
	ladder.showStep(); // 1
	ladder.down();
	ladder.showStep(); // 0
Измените код методов up, down и showStep таким образом, чтобы их вызов можно было сделать по цепочке, например так:
	ladder.up().up().down().showStep().down().showStep(); // показывает 1 затем 0
решение:
	let ladder = {
		step: 0,
		up() {
			this.step++;
			return this;
		},
		down() {
			this.step--;
			return this;
		},
		showStep: function() {
			console.log(this.step);
			return this;
		} // показывает текущую ступеньку
	};
	ladder.up().up().down().showStep().down().showStep(); // 1 0

#1.4.5. Конструктор, оператор new
19-20.2.25 - https://learn.javascript.ru/constructor-new
Обычный синтаксис {...} позволяет создать только один объект. Но зачастую нам нужно создать множество похожих, однотипных объектов, таких как пользователи, элементы меню и так далее. Это можно сделать при помощи функции-конструктора и оператора new.

Функция-конструктор.
Функции-конструкторы технически являются обычными функциями. Но есть два соглашения:
	1. Имя функции-конструктора должно начинаться с большой буквы.
	2. Функция-конструктор должна выполняться только с помощью оператора new.
Например:
	function User(name) {
		this.name = name;
		this.isAdmin = false;
	}
	let user = new User("Jack");
	alert(user.name); // Jack
	alert(user.isAdmin); // false
Когда функция вызывается как new User(...), происходит следующее:
	1. Создаётся новый пустой объект, и он присваивается this.
	2. Выполняется тело функции. Обычно оно модифицирует this, добавляя туда новые свойства.
	3. Возвращается значение this.
Другими словами, new User(...) делает что-то вроде:
	function User(name) {
		// this = {};  (неявно)
		// добавляет свойства к this
		this.name = name;
		this.isAdmin = false;
		// return this;  (неявно)
	}
Т.о. let user = new User("Jack") возвращает тот же результат, что и: let user = {name: "Jack", isAdmin: false};
Теперь, если нам будет необходимо создать других пользователей, мы можем просто вызвать new User("Ann"), new User("Alice") и так далее. Данная конструкция гораздо удобнее и читабельнее, чем многократное создание литерала объекта.
Это и является основной целью конструкторов – реализовать код для многократного создания однотипных объектов.
Давайте ещё раз отметим – технически любая функция (кроме стрелочных функций, поскольку у них нет this) может использоваться в качестве конструктора. Его можно запустить с помощью new, и он выполнит выше указанный алгоритм. Подобные функции должны начинаться с заглавной буквы – это общепринятое соглашение, чтобы было ясно, что функция должна вызываться с помощью new.

new function() {…}
Если в нашем коде присутствует большое количество строк, создающих один сложный объект, то мы можем обернуть их в функцию-конструктор, которая будет немедленно вызвана, вот так:
	let user = new function() { // создаём функцию и сразу же вызываем её с помощью new
		this.name = "John";
		this.isAdmin = false;
		// ...другой код для создания пользователя; возможна любая сложная логика и инструкции; локальные переменные и так далее
	};
Такой конструктор не может быть вызван снова, так как он нигде не сохраняется, просто создаётся и тут же вызывается. Таким образом, этот трюк направлен на инкапсуляцию кода, который создаёт отдельный объект, без возможности повторного использования в будущем.

Проверка на вызов в режиме конструктора: new.target
// Продвинутая возможность. Синтаксис из этого раздела используется крайне редко. Можно пропустить его, если не хотите углубляться в детали языка.
Используя специальное свойство new.target внутри функции, мы можем проверить, вызвана ли функция при помощи оператора new или без него.
В случае обычного вызова функции new.target будет undefined. Если же она была вызвана при помощи new, new.target будет равен самой функции.
Например:
	function User() {alert(new.target)};
	// без "new":
	User(); // undefined
	// с "new":
	new User(); // function User { ... }
Это можно использовать внутри функции, чтобы узнать, была ли она вызвана c помощью new, "в режиме конструктора", или без него, "в обычном режиме".
Также мы можем сделать, чтобы вызовы с new и без него делали одно и то же:
	function User(name) {
		if (!new.target) { // в случае, если вы вызвали меня без оператора new
			return new User(name); // ...я добавлю new за вас
		}
		this.name = name;
	}
	let john = User("John"); // переадресовывает вызов на new User
	alert(john.name); // John
Такой подход иногда используется в библиотеках, чтобы сделать синтаксис более гибким. Чтобы люди могли вызывать функцию с new и без него, и она все ещё могла работать.
Впрочем, вероятно, это не очень хорошая практика использовать этот трюк везде, так как отсутствие new может ввести разработчика в заблуждение. С new мы точно знаем, что создаётся новый объект.

Возврат значения из конструктора, return.
Обычно конструкторы не имеют оператора return. Их задача – записать все необходимое в this, и это автоматически становится результатом.
Но если return всё же есть, то применяется простое правило:
	- При вызове return с объектом, вместо this вернётся объект.
	- При вызове return с примитивным значением, оно проигнорируется.
Другими словами, return с объектом возвращает этот объект, во всех остальных случаях возвращается this.
К примеру, здесь return замещает this, возвращая объект:
	function BigUser() {
		this.name = "John";
		return { name: "Godzilla" };  // <-- возвращает этот объект
	}
	alert( new BigUser().name );  // Godzilla, получили этот объект
А вот пример с пустым return (или мы могли бы поставить примитив после return, неважно):
	function SmallUser() {
		this.name = "John";
		return; // <-- возвращает this
	}
	alert( new SmallUser().name );  // John
Обычно у конструкторов отсутствует return. Здесь мы упомянули особое поведение с возвращаемыми объектами в основном для полноты картины.

Кстати, мы можем не ставить круглые скобки после new:
	let user = new User; // <-- без скобок
	let user = new User(); // то же самое
Пропуск скобок считается плохой практикой, но просто чтобы вы знали, такой синтаксис разрешён спецификацией.

Создание методов в конструкторе.
Использование конструкторов для создания объектов даёт большую гибкость. Функции-конструкторы могут иметь параметры, определяющие, как создавать объект и что в него записывать.
Конечно, мы можем добавить к this не только свойства, но и методы.
Например, new User(name) ниже создаёт объект с заданным name и методом sayHi:
	function User(name) {
		this.name = name;
		this.sayHi = function() {alert( "Меня зовут: " + this.name )};
	}
	let john = new User("John");
	john.sayHi(); // Меня зовут: John
	/* john = {name: "John", sayHi: function() { ... }}*/
Для создания сложных объектов есть и более продвинутый синтаксис – классы, который мы рассмотрим позже.

Итого:
- Функции-конструкторы или просто конструкторы, являются обычными функциями, но существует общепринятое соглашение именовать их с заглавной буквы.
- Функции-конструкторы следует вызывать только с помощью new. Такой вызов подразумевает создание пустого this в начале и возврат заполненного в конце.
Мы можем использовать конструкторы для создания множества похожих объектов.
JS предоставляет функции-конструкторы для множества встроенных объектов языка: таких как Date, Set, и других, которые нам ещё предстоит изучить.
/** Мы ещё вернёмся к объектам. В этой главе мы рассмотрели только основы объектов и конструкторов. Данная информация необходима нам для дальнейшего изучения типов данных и функций в последующих главах. Как только мы с ними разберёмся, мы вернёмся к объектам для более детального изучения в главах Прототипы, наследование и Классы.*/

задачи: 1- 2+ 3+- (лишняя переменная)
1. Две функции - один объект
Возможно ли создать функции A и B, чтобы new A() == new B()?
	function A() { ... }
	function B() { ... }
	let a = new A();
	let b = new B();
	alert( a == b ); // true
Если да – приведите пример вашего кода.
решение:
	Да, возможно. Если функция возвращает объект, то new вернёт его вместо this. Таким образом, они могут, к примеру, возвращать один и тот же внешне определённый объект obj:
		let obj = {};
		function A() {return obj;}
		function B() {return obj;}
		let a = new A();
		let b = new B();
		console.log( a == b ); // true

2. Создайте калькулятор при помощи конструктора, new Calculator. (важность: 5)
Создайте функцию-конструктор Calculator, которая создаёт объекты с тремя методами:
	read() запрашивает два значения при помощи prompt и сохраняет их значение в свойствах объекта.
	sum() возвращает сумму этих свойств.
	mul() возвращает произведение этих свойств.
решение:
	function Calculator() {
		this.read = function(){
			this.a = +prompt('введите число a', 0);
			this.b = +prompt('введите число b', 0);
		};
		this.sum = function(){return this.a + this.b};
		this.mul = function(){return this.a * this.b};
	};
	let calculator = new Calculator();
	calculator.read();
	console.log('сумма: ', calculator.sum());
	console.log('произведение: ', calculator.mul());

3. Создайте new Accumulator. (важность: 5)
Создайте функцию-конструктор Accumulator(startingValue).
Объект, который она создаёт, должен уметь следующее:
	Хранить «текущее значение» в свойстве value. Начальное значение устанавливается в аргументе конструктора startingValue.
	Метод read() должен использовать prompt для считывания нового числа и прибавления его к value.
Другими словами, свойство value представляет собой сумму всех введённых пользователем значений, с учётом начального значения startingValue.
решение:
	function Accumulator(startingValue){
		this.value = startingValue;
		this.read = function(){
			this.value += +prompt('введите значение: ', 1);
		};
	};
	let accumulator = new Accumulator(1); // начальное значение 1
	accumulator.read(); // прибавляет введённое пользователем значение к текущему значению
	accumulator.read(); // прибавляет введённое пользователем значение к текущему значению
	console.log('итоговое значение: ', accumulator.value); // выведет сумму этих значений

#1.4.6. Опциональная цепочка '?.'
21.2.25 - https://learn.javascript.ru/optional-chaining
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Опциональная цепочка ?. — это безопасный способ доступа к свойствам вложенных объектов, даже если какое-либо из промежуточных свойств не существует.

Проблема несуществующего свойства.
Если вы только начали читать учебник и изучать JS, то, возможно, проблема вас ещё не коснулась, но она довольно распространена.
В качестве примера предположим, что у нас есть объекты user, которые содержат информацию о наших пользователях.
У большинства наших пользователей есть адреса в свойстве user.address с улицей user.address.street, но некоторые из них их не указали.
В таком случае, когда мы попытаемся получить user.address.street, а пользователь окажется без адреса, мы получим ошибку:
	let user = {}; // пользователь без свойства "address"
	alert(user.address.street); // Ошибка!
Это ожидаемый результат. Поскольку user.address имеет значение undefined, попытка получить user.address.street завершается ошибкой.
Во многих практических случаях мы бы предпочли получить здесь undefined вместо ошибки (что означало бы "улицы нет").

…Или ещё один пример. В веб-разработке мы можем получить объект, соответствующий элементу веб-страницы, с помощью специального вызова метода, такого как document.querySelector('.elem'), и он возвращает null, когда такого элемента нет.
	// document.querySelector('.elem') равен null, если элемента нет
	let html = document.querySelector('.elem').innerHTML; // ошибка, если он равен null
Ещё раз, если элемент не существует, мы получим сообщение об ошибке доступа к свойству .innerHTML у null. И в некоторых случаях, когда отсутствие элемента является нормальным, мы хотели бы избежать ошибки и просто принять html = null в качестве результата.

Как мы можем это сделать?
Очевидным решением было бы проверить значение с помощью if или условного оператора ?, прежде чем обращаться к его свойству, вот так:
	let user = {};
	alert(user.address ? user.address.street : undefined);
Это работает, тут нет ошибки… Но это довольно неэлегантно. Как вы можете видеть, "user.address" появляется в коде дважды.
Вот как то же самое выглядело бы для document.querySelector:
	let html = document.querySelector('.elem') ? document.querySelector('.elem').innerHTML : null;
Как видно, поиск элемента document.querySelector('.elem') здесь вызывается дважды, что не очень хорошо.
Для более глубоко вложенных свойств это ещё менее красиво, поскольку потребуется больше повторений.
К примеру, давайте аналогично вычислим user.address.street.name.
Нам нужно проверить как user.address, так и user.address.street:
	let user = {}; // у пользователя нет адреса
	alert(user.address ? user.address.street ? user.address.street.name : null : null);
Это просто ужасно, у кого-то могут даже возникнуть проблемы с пониманием такого кода.
Есть немного лучший способ написать это, используя оператор &&:
	let user = {}; // пользователь без адреса
	alert( user.address && user.address.street && user.address.street.name ); // undefined (без ошибки)
Проход при помощи логического оператора И && через весь путь к свойству гарантирует, что все компоненты существуют (если нет, вычисление прекращается), но также не является идеальным.
Как вы можете видеть, имена свойств по-прежнему дублируются в коде. Например, в приведённом выше коде user.address появляется три раза.
Чтобы решить эту проблему – раз и навсегда, в язык была добавлена опциональная цепочка ?. .

Опциональная цепочка.
Опциональная цепочка ?. останавливает вычисление и возвращает undefined, если значение перед ?. равно undefined или null.
Далее в этой статье, для краткости, мы будем говорить, что что-то существует, если оно не является null и не undefined.
Другими словами, value?.prop:
	- работает как value.prop, если значение value существует,
	- в противном случае (когда value равно undefined/null) он возвращает undefined.
Вот безопасный способ получить доступ к user.address.street, используя ?.:
	let user = {}; // пользователь без адреса
	alert( user?.address?.street ); // undefined (без ошибки)
Код лаконичный и понятный, в нем вообще нет дублирования.
А вот пример с document.querySelector:
	let html = document.querySelector('.elem')?.innerHTML; // будет undefined, если элемента нет
Считывание адреса с помощью user?.address работает, даже если объект user не существует:
	let user = null;
	alert( user?.address ); // undefined
	alert( user?.address.street ); // undefined
Обратите внимание: синтаксис ?. делает необязательным значение перед ним, но не какое-либо последующее.
Так например, в записи user?.address.street.name ?. позволяет user безопасно быть null/undefined (и в этом случае возвращает undefined), но это так только для user. Доступ к последующим свойствам осуществляется обычным способом. Если мы хотим, чтобы некоторые из них были необязательными, тогда нам нужно будет заменить больше . на ?..

Не злоупотребляйте опциональной цепочкой.
Нам следует использовать ?. только там, где нормально, что чего-то не существует.
К примеру, если, в соответствии с логикой нашего кода, объект user должен существовать, но address является необязательным, то нам следует писать user.address?.street, но не user?.address?.street.
В этом случае, если вдруг user окажется undefined, мы увидим программную ошибку по этому поводу и исправим её. В противном случае, если слишком часто использовать ?., ошибки могут замалчиваться там, где это неуместно, и их будет сложнее отлаживать.

Переменная перед ?. должна быть объявлена.
Если переменной user вообще нет, то user?.anything приведёт к ошибке:
	user?.address; // ReferenceError: user is not defined
Переменная должна быть объявлена (к примеру, как let/const/var user или как параметр функции). 
Опциональная цепочка работает только с объявленными переменными.

Сокращённое вычисление.
Как было сказано ранее, ?. немедленно останавливает вычисление, если левая часть не существует.
Так что если после ?. есть какие-то вызовы функций или операции, то они не произойдут.
Например:
	let user = null;
	let x = 0;
	user?.sayHi(x++); // нет "user", поэтому выполнение не достигает вызова sayHi и x++
	alert(x); // 0, значение не увеличилось

Другие варианты применения: ?.(), ?.[] .
Опциональная цепочка ?. — это не оператор, а специальная синтаксическая конструкция, которая также работает с функциями и квадратными скобками.
Например, ?.() используется для вызова функции, которая может не существовать.
В приведённом ниже коде у некоторых наших пользователей есть метод admin, а у некоторых его нет:
	let userAdmin = {
		admin() {alert("Я админ")}
	};
	let userGuest = {};
	userAdmin.admin?.(); // Я админ
	userGuest.admin?.(); // ничего не произойдет (такого метода нет)
Здесь в обеих строках мы сначала используем точку (userAdmin.admin), чтобы получить свойство admin, потому что мы предполагаем, что объект userAdmin существует, так что читать из него безопасно. Затем ?.() проверяет левую часть: если функция admin существует, то она запускается (это так для userAdmin). В противном случае (для userGuest) вычисление остановится без ошибок.
Синтаксис ?.[] также работает, если мы хотим использовать скобки [] для доступа к свойствам вместо точки .. Как и в предыдущих случаях, он позволяет безопасно считывать свойство из объекта, который может не существовать.
	let key = "firstName";
	let user1 = {firstName: "John"};
	let user2 = null;
	alert( user1?.[key] ); // John
	alert( user2?.[key] ); // undefined
Также мы можем использовать ?. с delete:
	delete user?.name; // удаляет user.name если пользователь существует

Мы можем использовать ?. для безопасного чтения и удаления, но не для записи.
Опциональная цепочка ?. не имеет смысла в левой части присваивания.
Например:
	let user = null;
	user?.name = "John"; // Ошибка, не работает; то же самое что написать undefined = "John"

Итого:
Синтаксис опциональной цепочки ?. имеет три формы:
	obj?.prop – возвращает obj.prop если obj существует, в противном случае undefined.
	obj?.[prop] – возвращает obj[prop] если obj существует, в противном случае undefined.
	obj.method?.() – вызывает obj.method(), если obj.method существует, в противном случае возвращает undefined.
?. проверяет левую часть на null/undefined и позволяет продолжить вычисление, если это не так.
Цепочка ?. позволяет безопасно получать доступ к вложенным свойствам.
Тем не менее, нужно использовать ?. осторожно, только там, где по логике кода допустимо, что левая часть не существует. Чтобы он не скрывал от нас ошибки программирования, если они возникнут.

#1.4.7. Тип данных Symbol
22.2.25 - https://learn.javascript.ru/symbol
По спецификации, в качестве ключей для свойств объекта могут использоваться только строки или символы. Ни числа, ни логические значения не подходят, разрешены только эти два типа данных. До сих пор мы видели только строки. Теперь давайте разберём символы, увидим, что хорошего они нам дают.

Символы.
Символ представляет собой уникальный идентификатор. Создаются новые символы с помощью функции Symbol():
	let id = Symbol(); // Создаём новый символ - id
При создании, символу можно дать описание (также называемое имя), в основном использующееся для отладки кода:
	let id = Symbol("id"); // Создаём символ id с описанием (именем) "id"
Символы гарантированно уникальны. Даже если мы создадим множество символов с одинаковым описанием, это всё равно будут разные символы. Описание – это просто метка, которая ни на что не влияет.
	let id = Symbol('id');
	console.log(id); // Symbol(id)
Например, вот два символа с одинаковым описанием – но они не равны:
	let id1 = Symbol("id");
	let id2 = Symbol("id");
	alert(id1 == id2); // false
Если вы знаете Ruby или какой-либо другой язык программирования, в котором есть своего рода "символы" – пожалуйста, будьте внимательны. Символы в JS имеют свои особенности, и не стоит думать о них, как о символах в Ruby или в других языках.

Символы не преобразуются автоматически в строки.
Большинство типов данных в JS могут быть неявно преобразованы в строку. Например, функция alert принимает практически любое значение, автоматически преобразовывает его в строку, а затем выводит это значение, не сообщая об ошибке. Символы же особенные и не преобразуются автоматически.
К примеру, alert ниже выдаст ошибку:
	let id = Symbol("id");
	alert(id); // TypeError: Cannot convert a Symbol value to a string
Это – языковая защита от путаницы, ведь строки и символы – принципиально разные типы данных и не должны неконтролируемо преобразовываться друг в друга. Если же мы действительно хотим вывести символ с помощью alert, то необходимо явно преобразовать его с помощью метода .toString(), вот так:
	let id = Symbol("id");
	alert(id.toString()); // Symbol(id), теперь работает
Или мы можем обратиться к свойству symbol.description, чтобы вывести только описание:
	let id = Symbol("id");
	console.log(id.description); // id

Скрытые свойства.
Символы позволяют создавать скрытые свойства объектов, к которым нельзя нечаянно обратиться и перезаписать их из других частей программы.
Например, мы работаем с объектами user, которые принадлежат стороннему коду. Мы хотим добавить к ним идентификаторы.
Используем для этого символьный ключ:
	let user = {name: "Вася"};
	let id = Symbol("id");
	user[id] = 1;
	alert( user[id] ); // мы можем получить доступ к данным по ключу-символу
Почему же лучше использовать Symbol("id"), а не строку "id"?
Т.к. объект user принадлежит стороннему коду, и этот код также работает с ним, то не следует добавлять к нему какие-либо поля. Это небезопасно. Но к символу сложно нечаянно обратиться, сторонний код вряд ли его вообще увидит, и, скорее всего, добавление поля к объекту не вызовет никаких проблем.
Кроме того, предположим, что другой скрипт для каких-то своих целей хочет записать собственный идентификатор в объект user. Этот скрипт может быть какой-то JS-библиотекой, абсолютно не связанной с нашим скриптом.
Сторонний код может создать для этого свой символ Symbol("id"):
	let id = Symbol("id");
	user[id] = "Их идентификатор";
Конфликта между их и нашим идентификатором не будет, так как символы всегда уникальны, даже если их имена совпадают.
А вот если бы мы использовали строку "id" вместо символа, то тогда был бы конфликт.

Символы в литеральном объекте.
Если мы хотим использовать символ при литеральном объявлении объекта {...}, его необходимо заключить в квадратные скобки.
Вот так:
	let id = Symbol("id");
	let user = {
		name: "Вася",
		[id]: 123 // просто "id: 123" не сработает
	};
Это вызвано тем, что нам нужно использовать значение переменной id в качестве ключа, а не строку «id».

Символы игнорируются циклом for..in.
Свойства, чьи ключи – символы, не перебираются циклом for..in.
Например:
	let id = Symbol("id");
	let user = {
		name: "Вася",
		age: 30,
		[id]: 123
	};
	for (let key in user) alert(key); // name, age (свойства с ключом-символом нет среди перечисленных)
	// хотя прямой доступ по символу работает:
	alert( "Напрямую: " + user[id] ); // Напрямую: 123
Это – часть общего принципа "сокрытия символьных свойств". Если другая библиотека или скрипт будут работать с нашим объектом, то при переборе они не получат ненароком наше символьное свойство. Object.keys(user) также игнорирует символы.

А вот Object.assign, в отличие от цикла for..in, копирует и строковые, и символьные свойства:
	let id = Symbol("id");
	let user = {[id]: 123};
	let clone = Object.assign({}, user);
	alert( clone[id] ); // 123
Здесь нет никакого парадокса или противоречия. Так и задумано. Идея заключается в том, что, когда мы клонируем или объединяем объекты, мы обычно хотим скопировать все свойства (включая такие свойства с ключами-символами, как, например, id в примере выше).

Глобальные символы.
Итак, как мы видели, обычно все символы уникальны, даже если их имена совпадают. Но иногда мы наоборот хотим, чтобы символы с одинаковыми именами были одной сущностью. Например, разные части нашего приложения хотят получить доступ к символу "id", подразумевая именно одно и то же свойство.
Для этого существует глобальный реестр символов. Мы можем создавать в нём символы и обращаться к ним позже, и при каждом обращении нам гарантированно будет возвращаться один и тот же символ.
Для чтения (или, при отсутствии, создания) символа из реестра используется вызов Symbol.for(key).
Он проверяет глобальный реестр и, при наличии в нём символа с именем key, возвращает его, иначе же создаётся новый символ Symbol(key) и записывается в реестр под ключом key.
Например:
	// читаем символ из глобального реестра и записываем его в переменную:
	let id = Symbol.for("id"); // если символа не существует, он будет создан
	// читаем его снова и записываем в другую переменную (возможно, из другого места кода):
	let idAgain = Symbol.for("id");
	// проверяем -- это один и тот же символ:
	alert( id === idAgain ); // true
Символы, содержащиеся в реестре, называются глобальными символами. Если вам нужен символ, доступный везде в коде – используйте глобальные символы.
/** Похоже на Ruby. 
В некоторых языках программирования, например, Ruby, на одно имя (описание) приходится один символ, и не могут существовать разные символы с одинаковым именем. В JS, как мы видим, это утверждение верно только для глобальных символов. */

Symbol.keyFor
Для глобальных символов, кроме Symbol.for(key), который ищет символ по имени, существует обратный метод: Symbol.keyFor(sym), который, наоборот, принимает глобальный символ и возвращает его имя.
К примеру:
	// получаем символ по имени:
	let sym = Symbol.for("name");
	let sym2 = Symbol.for("id");
	// получаем имя по символу:
	alert( Symbol.keyFor(sym) ); // name
	alert( Symbol.keyFor(sym2) ); // id
Внутри метода Symbol.keyFor используется глобальный реестр символов для нахождения имени символа. Так что этот метод не будет работать для неглобальных символов. Если символ неглобальный, метод не сможет его найти и вернёт undefined.
Впрочем, для любых символов доступно свойство description.
Например:
	let globalSymbol = Symbol.for("name");
	let localSymbol = Symbol("name");
	alert( Symbol.keyFor(globalSymbol) ); // name, глобальный символ
	alert( Symbol.keyFor(localSymbol) ); // undefined для неглобального символа
	alert( localSymbol.description ); // name

Системные символы.
Существует множество системных символов, использующихся внутри самого JS, и мы можем использовать их, чтобы настраивать различные аспекты поведения объектов.
Эти символы перечислены в спецификации в таблице Well-known symbols:
	Symbol.hasInstance
	Symbol.isConcatSpreadable
	Symbol.iterator
	Symbol.toPrimitive
	…и так далее.
В частности, Symbol.toPrimitive позволяет описать правила для объекта, согласно которым он будет преобразовываться к примитиву. Мы скоро увидим его применение. С другими системными символами мы тоже скоро познакомимся, когда будем изучать соответствующие возможности языка.

Итого:
Символ (symbol) – примитивный тип данных, использующийся для создания уникальных идентификаторов.
Символы создаются вызовом функции Symbol(), в которую можно передать описание (имя) символа.
Даже если символы имеют одно и то же имя, это – разные символы. Если мы хотим, чтобы одноимённые символы были равны, то следует использовать глобальный реестр: вызов Symbol.for(key) возвращает (или создаёт) глобальный символ с key в качестве имени. Многократные вызовы команды Symbol.for с одним и тем же аргументом возвращают один и тот же символ.
Символы имеют два основных варианта использования:
	1. Скрытые свойства объектов.
	Если мы хотим добавить свойство в объект, который принадлежит другому скрипту или библиотеке, мы можем создать символ и использовать его в качестве ключа. Символьное свойство не появится в for..in, так что оно не будет нечаянно обработано вместе с другими. Также оно не будет модифицировано прямым обращением, так как другой скрипт не знает о нашем символе. Таким образом, свойство будет защищено от случайной перезаписи или использования.
	Так что, используя символьные свойства, мы можем спрятать что-то нужное нам, но что другие видеть не должны.
	2. Существует множество системных символов, используемых внутри JS, доступных как Symbol.*. Мы можем использовать их, чтобы изменять встроенное поведение ряда объектов. Например, в дальнейших главах мы будем использовать Symbol.iterator для итераторов, Symbol.toPrimitive для настройки преобразования объектов в примитивы и так далее.

Технически символы скрыты не на 100%. Существует встроенный метод Object.getOwnPropertySymbols(obj) ('https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertySymbols') – с его помощью можно получить все свойства объекта с ключами-символами. 
Также существует метод Reflect.ownKeys(obj) ('https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Reflect/ownKeys'), который возвращает все ключи объекта, включая символьные. Так что они не совсем спрятаны. 
Например:
	console.log(Object.getOwnPropertySymbols(user)); // > [Symbol(id)]
	console.log(Reflect.ownKeys(user)); // > (3) ['name', 'age', Symbol(id)]
Но большинство библиотек, встроенных методов и синтаксических конструкций не используют эти методы.

#1.4.8. Преобразование объектов в примитивы
23-24.2.25 - https://learn.javascript.ru/object-toprimitive
Что произойдёт, если сложить два объекта obj1 + obj2, вычесть один из другого obj1 - obj2 или вывести их на экран, воспользовавшись alert(obj)?
JS совершенно не позволяет настраивать, как операторы работают с объектами. В отличие от некоторых других языков программирования, таких как Ruby или C++, мы не можем реализовать специальный объектный метод для обработки сложения (или других операторов).
В случае таких операций, объекты автоматически преобразуются в примитивы, затем выполняется сама операция над этими примитивами, и на выходе мы получим примитивное значение. Это важное ограничение: результатом obj1 + obj2 (или другой математической операции) не может быть другой объект!
К примеру, мы не можем создавать объекты, представляющие векторы или матрицы (или достижения или может ещё что-то), складывать их и ожидать в качестве результата "суммированный" объект. Такие архитектурные ходы автоматически оказываются "за бортом".
Итак, поскольку мы технически здесь мало что можем сделать, в реальных проектах нет математики с объектами. Если она всё же происходит, то за редким исключением, это из-за ошибок в коде.
В этой главе мы рассмотрим, как объект преобразуется в примитив и как это можно настроить.
У нас есть две цели:
	1. Это позволит нам понять, что происходит в случае ошибок в коде, когда такая операция произошла случайно.
	2. Есть исключения, когда такие операции возможны и вполне уместны. Например, вычитание или сравнение дат (Date объекты). 

Правила преобразования.
В главе "Преобразование типов" ('https://learn.javascript.ru/type-conversions') мы рассмотрели правила для числовых, строковых и логических преобразований примитивов. Но мы оставили пробел для объектов. Теперь пришло время заполнить этот пробел.
	1. Не существует преобразования к логическому значению. В логическом контексте все объекты являются true, всё просто. Существует лишь их числовое и строковое преобразование.
	2. Числовое преобразование происходит, когда мы вычитаем объекты или применяем математические функции. Например, объекты Date (которые будут рассмотрены в главе Дата и время 'https://learn.javascript.ru/date') могут быть вычтены, и результатом date1 - date2 будет разница во времени между двумя датами.
	3. Что касается преобразований к строке – оно обычно происходит, когда мы выводим на экран объект при помощи alert(obj) и в подобных контекстах.
Мы можем реализовать свои преобразования к строкам и числам, используя специальные объектные методы.

Хинты.
Как JS решает, какое преобразование применить?
Существует три варианта преобразования типов, которые происходят в различных ситуациях. Они называются хинтами, как описано в спецификации ('https://tc39.github.io/ecma262/#sec-toprimitive'):
	(1) "string"
	Для преобразования объекта к строке, когда мы выполняем операцию над объектом, которая ожидает строку, например alert:
		alert(obj); // вывод
		anotherObj[obj] = 123; // используем объект в качестве ключа
	(2) "number"
	Для преобразования объекта к числу, в случае математических операций:
		let num = Number(obj); // явное преобразование
		// математические (не считая бинарного плюса)
		let n = +obj; // унарный плюс
		let delta = date1 - date2;
		let greater = user1 > user2; // сравнения больше/меньше
	Большинство встроенных математических функций также включают в себя такое преобразование.
	(3) "default"
	Происходит редко, когда оператор "не уверен", какой тип ожидать.
	Например, бинарный плюс + может работать как со строками (объединяя их в одну), так и с числами (складывая их). Поэтому, если бинарный плюс получает объект в качестве аргумента, он использует хинт "default" для его преобразования.
	Также, если объект сравнивается с помощью == со строкой, числом или символом, тоже неясно, какое преобразование следует выполнить, поэтому используется хинт "default".
		let total = obj1 + obj2; // бинарный плюс использует хинт "default"
		if (user == 1) { ... }; // obj == number использует хинт "default"
	Операторы сравнения больше/меньше, такие как < >, также могут работать как со строками, так и с числами. Тем не менее, по историческим причинам, они используют хинт "number", а не "default".
	Впрочем на практике, всё немного проще. Все встроенные объекты, за исключением одного (объект Date, который мы рассмотрим позже), реализуют "default" преобразование тем же способом, что и "number". И нам следует поступать так же.

Чтобы выполнить преобразование, JS пытается найти и вызвать три следующих метода объекта:
1. Вызвать obj[Symbol.toPrimitive](hint) – метод с символьным ключом Symbol.toPrimitive (системный символ), если такой метод существует,
2. Иначе, если хинт равен "string" попробовать вызвать obj.toString() или obj.valueOf(), смотря какой из них существует.
3. Иначе, если хинт равен "number" или "default" попробовать вызвать obj.valueOf() или obj.toString(), смотря какой из них существует.

Symbol.toPrimitive
Давайте начнём с первого метода. Есть встроенный символ с именем Symbol.toPrimitive, который следует использовать для обозначения метода преобразования, вот так:
	obj[Symbol.toPrimitive] = function(hint) {
		// вот код для преобразования этого объекта в примитив
		// он должен вернуть примитивное значение
		// hint = чему-то из "string", "number", "default"
	};
Если метод Symbol.toPrimitive существует, он используется для всех хинтов, и больше никаких методов не требуется.
Например, здесь объект user реализует его:
	let user = {
		name: "John",
		money: 1000,
		[Symbol.toPrimitive](hint) {
			alert(`hint: ${hint}`);
			return hint == "string" ? `{name: "${this.name}"}` : this.money;
		}
	};
	// демонстрация результатов преобразований:
	alert(user); // hint: string -> {name: "John"}
	alert(+user); // hint: number -> 1000
	alert(user + 500); // hint: default -> 1500
Как мы можем видеть из кода, user становится либо строкой со своим описанием, либо суммой денег в зависимости от преобразования. Единый метод user[Symbol.toPrimitive] обрабатывает все случаи преобразования.

toString/valueOf
Если нет Symbol.toPrimitive, тогда JS пытается найти методы toString и valueOf:
	- Для хинта "string": вызвать метод toString, а если он не существует или возвращает объект вместо примитивного значения, то valueOf (таким образом, toString имеет приоритет при строковом преобразовании).
	- Для других хинтов: вызвать метод valueOf, а если он не существует или возвращает объект вместо примитивного значения, то toString (таким образом, valueOf имеет приоритет для математических операций).
Методы toString и valueOf берут своё начало с древних времён. Это не символы (символов тогда ещё не было), а скорее просто обычные методы со строковыми именами. Они предоставляют альтернативный "старомодный" способ реализации преобразования. Эти методы должны возвращать примитивное значение. Если toString или valueOf возвращает объект, то он игнорируется (так же, как если бы метода не было).
По умолчанию обычный объект имеет следующие методы toString и valueOf:
	- Метод toString возвращает строку "[object Object]".
	- Метод valueOf возвращает сам объект.
например:
	let user = {name: "John"};
	alert(user); // [object Object]
	alert(user.valueOf() === user); // true
Таким образом, если мы попытаемся использовать объект в качестве строки, как например в alert или вроде того, то по умолчанию мы увидим [object Object].
Значение по умолчанию valueOf упоминается здесь только для полноты картины, чтобы избежать какой-либо путаницы. Как вы можете видеть, он возвращает сам объект и поэтому игнорируется. Не спрашивайте меня почему, это по историческим причинам. Так что мы можем предположить, что его не существует.
Давайте применим эти методы для настройки преобразования.
Для примера, используем их в реализации всё того же объекта user. Но уже используя комбинацию toString и valueOf вместо Symbol.toPrimitive:
	let user = {
		name: "John",
		money: 1000,
		toString() {return `{name: "${this.name}"}`}, // для хинта равного "string"
		valueOf() {return this.money} // для хинта равного "number" или "default"
	};
	alert(user); // toString -> {name: "John"}
	alert(+user); // valueOf -> 1000
	alert(user + 500); // valueOf -> 1500
Как видим, получилось то же поведение, что и в предыдущем примере с Symbol.toPrimitive.
Довольно часто нам нужно единое "универсальное" место для обработки всех примитивных преобразований. В этом случае мы можем реализовать только toString:
	let user = {
	  name: "John",
	  toString() {return this.name}
	};
	alert(user); // toString -> John
	alert(user + 500); // toString -> John500
В отсутствие Symbol.toPrimitive и valueOf, toString обработает все примитивные преобразования.

Преобразование может вернуть любой примитивный тип.
Важная вещь, которую следует знать обо всех методах преобразования примитивов, заключается в том, что они не обязательно возвращают подсказанный хинтом примитив. Нет никакого контроля над тем, вернёт ли toString именно строку, или чтобы метод Symbol.toPrimitive возвращал именно число для хинта "number".
Единственное обязательное условие: эти методы должны возвращать примитив, а не объект.
/**Историческая справка.
По историческим причинам, если toString или valueOf вернёт объект, то ошибки не будет, но такое значение будет проигнорировано (как если бы метода вообще не существовало). Это всё потому, что в древние времена в JS не было хорошей концепции ошибки.
А вот Symbol.toPrimitive уже "четче", этот метод обязан возвращать примитив, иначе будет ошибка.*/

Дальнейшие преобразования.
Как мы уже знаем, многие операторы и функции выполняют преобразования типов, например, умножение * преобразует операнды в числа.
Если мы передаём объект в качестве аргумента, то в вычислениях будут две стадии:
	1. Объект преобразуется в примитив (с использованием правил, описанных выше).
	2. Если необходимо для дальнейших вычислений, этот примитив преобразуется дальше.
Например:
	let obj = {
		toString() {return "2"} // toString обрабатывает все преобразования в случае отсутствия других методов
	};
	alert(obj * 2); // 4, объект был преобразован к примитиву "2", затем умножение сделало его числом
Умножение obj * 2 сначала преобразует объект в примитив (это строка "2"). Затем "2" * 2 становится 2 * 2 (строка преобразуется в число).
А вот, к примеру, бинарный плюс в подобной ситуации соединил бы строки, так как он совсем не брезгует строками:
	let obj = {toString() {return "2"}};
	alert(obj + 2); // "22" ("2" + 2), преобразование к примитиву вернуло строку => конкатенация

Итого:
Преобразование объекта в примитив вызывается автоматически многими встроенными функциями и операторами, которые ожидают примитив в качестве значения.
Существует всего 3 типа (хинта) для этого:
	"string" (для alert и других операций, которым нужна строка)
	"number" (для математических операций)
	"default" (для некоторых других операторов, обычно объекты реализуют его как "number")
Спецификация явно описывает для каждого оператора, какой ему следует использовать хинт.
Алгоритм преобразования таков:
	1. Сначала вызывается метод obj[Symbol.toPrimitive](hint), если он существует,
	2. В случае, если хинт равен "string"
		происходит попытка вызвать obj.toString() и obj.valueOf(), смотря что есть.
	3. В случае, если хинт равен "number" или "default"
		происходит попытка вызвать obj.valueOf() и obj.toString(), смотря что есть.
Все эти методы должны возвращать примитив (если определены).
На практике часто бывает достаточно реализовать только obj.toString() в качестве универсального метода для преобразований к строке, который должен возвращать удобочитаемое представление объекта для целей логирования или отладки.

/** Ping 23.7.23 (https://disqus.com/by/disqus_rbPwqNTwkP/): Вся суть: Преобразовывать объекты к примитивам обычно не требуется, но если понадобится такое, то есть специальные методы, которые ты сам можешь прописать внутри объекта и преобразовывать объект так, как тебе нужно.
Методов всего три, в приоритете метод obj[Symbol.toPrimitive](hint), если его нет (ты его не написал внутри объекта), то JS будет ставить приоритет либо на toString, либо на valueOf (в зависимости от контекста преобразования - что ожидается? строка или число?), эти два метода по умолчанию есть у каждого объекта, toString возвращает строку [Object object], а valueOf возвращает сам объект. Ты можешь написать свою реализацию этих двух методов в объекте и тогда JS будет использовать её, вместо тех, что есть по умолчанию. */

#1.5. Типы данных
#1.5.1. Методы примитивов
24.2.25 - https://learn.javascript.ru/primitives-methods
JS позволяет нам работать с примитивными типами данных – строками, числами и т.д., как будто они являются объектами. У них есть и методы. Мы изучим их позже, а сначала разберём, как это всё работает, потому что, конечно, примитивы – не объекты.
Давайте взглянем на ключевые различия между примитивами и объектами.
	Примитив
		Это – значение "примитивного" типа.
		Есть 7 примитивных типов: string, number, boolean, symbol, null, undefined и bigint.
	Объект
		Может хранить множество значений как свойства.
		Объявляется при помощи фигурных скобок {}, например: {name: "Рома", age: 30}. 
		// В JS есть и другие виды объектов: например, функции тоже являются объектами.
Одна из лучших особенностей объектов – это то, что мы можем хранить функцию как одно из свойств объекта.
	let roma = {
		name: "Рома",
		sayHi: function() {alert("Привет, дружище!")}
	};
	roma.sayHi(); // Привет, дружище!
Здесь мы создали объект roma с методом sayHi.
Существует множество встроенных объектов. Например, те, которые работают с датами, ошибками, HTML-элементами и т.д. Они имеют различные свойства и методы.  Однако у этих возможностей есть обратная сторона: Объекты "тяжелее" примитивов. Они нуждаются в дополнительных ресурсах для поддержания внутренней структуры.

Примитив как объект.
Вот парадокс, с которым столкнулся создатель JS:
	- Есть много всего, что хотелось бы сделать с примитивами, такими как строка или число. Было бы замечательно, если бы мы могли обращаться к ним при помощи методов.
	- Примитивы должны быть лёгкими и быстрыми насколько это возможно.
Выбранное решение, хотя выглядит оно немного неуклюже:
	1. Примитивы остаются примитивами. Одно значение, как и хотелось.
	2. Язык позволяет осуществлять доступ к методам и свойствам строк, чисел, булевых значений и символов.
	3. Чтобы это работало, при таком доступе создаётся специальный объект-обёртка, который предоставляет нужную функциональность, а после удаляется.
Каждый примитив имеет свой собственный "объект-обёртку", которые называются: String, Number, Boolean, Symbol и BigInt, и имеют разный набор методов.
К примеру, существует метод str.toUpperCase(), который возвращает строку в верхнем регистре. 
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/toUpperCase']
Вот, как он работает:
	let str = "Привет";
	alert( str.toUpperCase() ); // ПРИВЕТ
Вот, что на самом деле происходит в str.toUpperCase():
	1. Строка str – примитив. В момент обращения к его свойству, создаётся специальный объект, который знает значение строки и имеет такие полезные методы, как toUpperCase().
	2. Этот метод запускается и возвращает новую строку (показывается в alert).
	3. Специальный объект удаляется, оставляя только примитив str.
Получается, что примитивы могут предоставлять методы, и в то же время оставаться "лёгкими".
Движок JS сильно оптимизирует этот процесс. Он даже может пропустить создание специального объекта. Однако, он всё же должен придерживаться спецификаций и работать так, как будто он его создаёт.
Число имеет собственный набор методов. Например, toFixed(n) округляет число до n знаков после запятой.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Number/toFixed'] 
	let num = 1.23456;
	alert( num.toFixed(2) ); // 1.23
Более подробно с различными свойствами и методами мы познакомимся в главах Числа и Строки.

Конструкторы String/Number/Boolean предназначены только для внутреннего пользования.
Некоторые языки, такие как Java, позволяют явное создание объектов-обёрток для примитивов при помощи такого синтаксиса как new Number(1) или new Boolean(false). В JS это тоже возможно по историческим причинам, но очень не рекомендуется. В некоторых местах последствия могут быть катастрофическими.
Например:
	alert( typeof 0 ); // "число"
	alert( typeof new Number(0) ); // "object"!
Объекты в if всегда дают true, так что в нижеприведённом примере будет показан alert:
	let zero = new Number(0);
	if (zero) { // zero возвращает "true", так как является объектом
		alert( "zero имеет «истинное» значение?!?" );
	}
С другой стороны, использование функций String/Number/Boolean без оператора new – вполне разумно и полезно. Они превращают значение в соответствующий примитивный тип: в строку, в число, в булевый тип.
К примеру, следующее вполне допустимо:
	let num = Number("123"); // превращает строку в число

null/undefined не имеют методов.
Особенные примитивы null и undefined являются исключениями. У них нет соответствующих объектов-обёрток, и они не имеют никаких методов. В некотором смысле, они "самые примитивные".
Попытка доступа к свойствам такого значения возвратит ошибку:
	alert(null.test); // ошибка
	console.log(null.test); // Uncaught TypeError: Cannot read properties of null (reading 'test')

Итого:
- Все примитивы, кроме null и undefined, предоставляют множество полезных методов. Мы познакомимся с ними поближе в следующих главах.
- Формально эти методы работают с помощью временных объектов, но движки JS внутренне очень хорошо оптимизируют этот процесс, так что их вызов не требует много ресурсов.

задача: 1-
Как сработает код?
	let str = "Привет";
	str.test = 5; // (*)
	alert(str.test);
решение:
В зависимости от того, используете ли вы строгий режим (use strict) или нет, результат может быть:
	undefined (без strict)
	Ошибка (strict mode)
что происходит в строке кода, отмеченной (*):
	1. В момент обращения к свойству str создаётся объект-обёртка.
	2. В строгом режиме, попытка изменения этого объекта выдаёт ошибку.
Без строгого режима, операция продолжается, объект получает свойство test, но после этого он удаляется, так что на последней линии str больше не имеет свойства test и возвращается undefined. 
Данный пример наглядно показывает, что примитивы не являются объектами. Они не могут хранить дополнительные данные.

#1.5.2. Числа
27.2.25 - https://learn.javascript.ru/number
В современном JS существует два типа чисел:
1. Обычные числа в JS хранятся в 64-битном формате IEEE-754 ('https://en.wikipedia.org/wiki/IEEE_754-1985'), который также называют "числа с плавающей точкой двойной точности" (double precision floating point numbers). Это числа, которые мы будем использовать чаще всего. Мы поговорим о них в этой главе.
2. BigInt числа дают возможность работать с целыми числами произвольной длины. Они нужны достаточно редко и используются в случаях, когда необходимо работать со значениями более чем (2^53-1) или менее чем -(2^53-1) [2^53 = 9 007 199 254 740 992]. Так как BigInt числа нужны достаточно редко, мы рассмотрим их в отдельной главе BigInt ('https://learn.javascript.ru/bigint').
В данной главе мы рассмотрим только первый тип чисел: числа типа number. Давайте глубже изучим, как с ними работать в JS.

Способы записи числа.
Представьте, что нам надо записать число 1 миллиард. Самый очевидный путь:
	let billion = 1000000000;
Мы также можем использовать символ нижнего подчёркивания _ в качестве разделителя:
	let billion = 1_000_000_000;
Символ нижнего подчёркивания _ – это "синтаксический сахар", он делает число более читабельным. Движок JS попросту игнорирует _ между цифрами, поэтому в примере выше получается точно такой же миллиард, как и в первом случае.
Однако в реальной жизни мы в основном стараемся не писать длинные последовательности нулей, так как можно легко ошибиться. Укороченная запись может выглядеть как "1млрд" или "7.3млрд" для 7 миллиардов 300 миллионов. Такой принцип работает для всех больших чисел.
В JS, чтобы укоротить запись числа, мы можем добавить к нему букву "e" и указать необходимое количество нулей:
	let billion = 1e9;  // 1 миллиард, буквально: 1 и 9 нулей
	alert( 7.3e9 );  // 7.3 миллиарда (7,300,000,000)
Другими словами, "e" умножает число на 1 с указанным количеством нулей.
	1e3 === 1 * 1000 // e3 означает *1000
	1.23e6 === 1.23 * 1000000 // e6 означает *1000000
А сейчас давайте запишем что-нибудь очень маленькое. К примеру, 1 микросекунду (одна миллионная секунды):
	let mcs = 0.000001;
В этом случае нам также поможет "e". Если мы хотим избежать записи длинной последовательности из нулей, мы можем сделать так:
	let ms = 1e-6; // шесть нулей слева от 1
Если мы подсчитаем количество нулей в 0.000001, их будет 6. Естественно, верная запись 1e-6.
Другими словами, отрицательное число после "e" подразумевает деление на 1 с указанным количеством нулей:
	1e-3 === 1 / 1000 (=0.001) // 1 делится на 1 с 3 нулями
	1.23e-6 === 1.23 / 1000000 (=0.00000123) // 1.23 делится на 1 с 6 нулями

Шестнадцатеричные, двоичные и восьмеричные числа.
Шестнадцатеричные числа широко используются в JS для представления цветов, кодировки символов и многого другого. Естественно, есть короткий стиль записи: 0x, после которого указывается число.
Например:
	alert( 0xff ); // 255
	alert( 0xFF ); // 255 (то же самое, регистр не имеет значения)
Двоичные и восьмеричные числа используются не так часто, но они также поддерживаются: 0b для двоичных и 0o для восьмеричных:
	let a = 0b11111111; // двоичная (бинарная) форма записи числа 255
	let b = 0o377; // восьмеричная форма записи числа 255
	alert( a == b ); // true, с двух сторон число 255
Есть только 3 системы счисления с такой поддержкой. Для других систем счисления мы рекомендуем использовать функцию parseInt (рассмотрим позже в этой главе).

toString(base)
Метод num.toString(base) возвращает строковое представление числа num в системе счисления base.
Например:
	let num = 255;
	alert( num.toString(16) );  // ff
	alert( num.toString(2) );   // 11111111
base может варьироваться от 2 до 36 (по умолчанию 10).
Часто используемые:
	base=16 — для шестнадцатеричного представления цвета, кодировки символов и т.д., цифры могут быть 0..9 и A..F.
	base=2 — обычно используется для отладки побитовых операций, цифры 0 или 1.
	base=36 — максимальное основание, цифры могут быть 0..9 и A..Z. То есть, используется весь латинский алфавит для представления числа. Забавно, но можно использовать 36-разрядную систему счисления для получения короткого представления большого числового идентификатора. К примеру, для создания короткой ссылки. Для этого просто преобразуем его в 36-разрядную систему счисления:
alert( 123456..toString(36) ); // 2n9c
/**Две точки для вызова метода.
Внимание! Две точки в 123456..toString(36) это не опечатка. Если нам надо вызвать метод непосредственно на числе, как toString в примере выше, то нам надо поставить две точки .. после числа.
Если мы поставим одну точку: 123456.toString(36), тогда это будет ошибкой, поскольку синтаксис JavaScript предполагает, что после первой точки начинается десятичная часть. А если поставить две точки, то JavaScript понимает, что десятичная часть отсутствует, и начинается метод.
Также можно записать как (123456).toString(36).*/

Округление.
Одна из часто используемых операций при работе с числами – это округление.
В JS есть несколько встроенных функций для работы с округлением:
	Math.floor // Округление в меньшую сторону: 3.1 становится 3, а -1.1 — -2.
	Math.ceil // Округление в большую сторону: 3.1 становится 4, а -1.1 — -1.
	Math.round // Округление до ближайшего целого: 3.1 становится 3, 3.6 — 4, а -1.1 — -1.
	Math.trunc (не поддерживается в Internet Explorer) // Производит удаление дробной части без округления: 3.1 становится 3, а -1.1 — -1.
Ниже представлена таблица с различиями между функциями округления:
	n		Math.floor	Math.ceil	Math.round	Math.trunc
	3.1		3			4			3			3
	3.6		3			4			4			3
	-1.1	-2			-1			-1			-1
	-1.6	-2			-1			-2			-1

Эти функции охватывают все возможные способы обработки десятичной части. Что если нам надо округлить число до n-ого количества цифр в дробной части?
Например, у нас есть 1.2345 и мы хотим округлить число до 2-х знаков после запятой, оставить только 1.23.
Есть два пути решения:
(1) Умножить и разделить. Например, чтобы округлить число до второго знака после запятой, мы можем умножить число на 100, вызвать функцию округления и разделить обратно.
	let num = 1.23456;
	alert( Math.round(num * 100) / 100 ); // 1.23456 -> 123.456 -> 123 -> 1.23
(2) Метод toFixed(n) округляет число до n знаков после запятой и возвращает строковое представление результата.
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Number/toFixed']
	let num = 12.34;
	alert( num.toFixed(1) ); // "12.3"
	Округляет значение до ближайшего числа, как в большую, так и в меньшую сторону, аналогично методу Math.round:
		let num = 12.36;
		alert( num.toFixed(1) ); // "12.4"
	Результатом toFixed является строка. Если десятичная часть короче, чем необходимо, будут добавлены нули в конец строки:
		let num = 12.34;
		alert( num.toFixed(5) ); // "12.34000", добавлены нули, чтобы получить 5 знаков после запятой
	Можно преобразовать полученное значение в число, используя унарный оператор + или Number(), пример с унарным оператором: 
		+num.toFixed(5); 

Неточные вычисления.
Внутри JS число представлено в виде 64-битного формата IEEE-754. Для хранения числа используется 64 бита: 52 из них используется для хранения цифр, 11 для хранения положения десятичной точки и один бит отведён на хранение знака.
Если число слишком большое, оно переполнит 64-битное хранилище, JS вернёт бесконечность:
	alert( 1e500 ); // Infinity
Наиболее часто встречающаяся ошибка при работе с числами в JS – это потеря точности.
Посмотрите на это (неверное!) сравнение:
	alert( 0.1 + 0.2 == 0.3 ); // false
Да-да, сумма 0.1 и 0.2 не равна 0.3.
Странно! Что тогда, если не 0.3?
	alert( 0.1 + 0.2 ); // 0.30000000000000004
Здесь гораздо больше последствий, чем просто некорректное сравнение. Представьте, вы делаете интернет-магазин и посетители формируют заказ из 2-х позиций за $0.10 и $0.20. Итоговый заказ будет $0.30000000000000004. Это будет сюрпризом для всех.
Но почему это происходит?
Число хранится в памяти в бинарной форме, как последовательность бит – единиц и нулей. Но дроби, такие как 0.1, 0.2, которые выглядят довольно просто в десятичной системе счисления, на самом деле являются бесконечной дробью в двоичной форме.
	alert(0.1.toString(2)); // 0.0001100110011001100110011001100110011001100110011001101
	alert(0.2.toString(2)); // 0.001100110011001100110011001100110011001100110011001101
	alert((0.1 + 0.2).toString(2)); // 0.0100110011001100110011001100110011001100110011001101
Другими словами, что такое 0.1? Это единица делённая на десять — 1/10, одна десятая. В десятичной системе счисления такие числа легко представимы, по сравнению с одной третьей: 1/3, которая становится бесконечной дробью 0.33333(3). Деление на 10 гарантированно хорошо работает в десятичной системе, но деление на 3 – нет. По той же причине и в двоичной системе счисления, деление на 2 обязательно сработает, а 1/10 становится бесконечной дробью.
В JS нет возможности для хранения точных значений 0.1 или 0.2, используя двоичную систему, точно также, как нет возможности хранить одну третью в десятичной системе счисления.
Числовой формат IEEE-754 решает эту проблему путём округления до ближайшего возможного числа. Правила округления обычно не позволяют нам увидеть эту "крошечную потерю точности", но она существует.
Пример:
	alert( 0.1.toFixed(20) ); // 0.10000000000000000555
И когда мы суммируем 2 числа, их неточности тоже суммируются.
Вот почему 0.1 + 0.2 – это не совсем 0.3.
// Справедливости ради заметим, что ошибка в точности вычислений для чисел с плавающей точкой сохраняется не только в JS, но и в любом другом языке, где используется формат IEEE 754, включая PHP, Java, C, Perl и Ruby.
Можно ли обойти проблему? Конечно, наиболее надёжный способ — это округлить результат используя метод toFixed(n):
	let sum = 0.1 + 0.2;
	alert( sum.toFixed(2) ); // "0.30"
Помните, что метод toFixed всегда возвращает строку. Это гарантирует, что результат будет с заданным количеством цифр в десятичной части. Также это удобно для форматирования цен в интернет-магазине $0.30. В других случаях можно использовать унарный оператор +, чтобы преобразовать строку в число:
	let sum = 0.1 + 0.2;
	alert( +sum.toFixed(2) ); // 0.3
Также можно временно умножить число на 100 (или на большее), чтобы привести его к целому, выполнить математические действия, а после разделить обратно. Суммируя целые числа, мы уменьшаем погрешность, но она всё равно появляется при финальном делении:
	alert( (0.1 * 10 + 0.2 * 10) / 10 ); // 0.3
	alert( (0.28 * 100 + 0.14 * 100) / 100); // 0.4200000000000001
Таким образом, метод умножения/деления уменьшает погрешность, но полностью её не решает.
Иногда можно попробовать полностью отказаться от дробей. Например, если мы в нашем интернет-магазине начнём использовать центы вместо долларов. Но что будет, если мы применим скидку 30%? На практике у нас не получится полностью избавиться от дроби. Просто используйте округление, чтобы отрезать "хвосты", когда надо.

Забавный пример. Попробуйте выполнить его:
	// число, растущее само по себе
	alert( 9999999999999999 ); // покажет 10000000000000000
Причина та же – потеря точности. Из 64 бит, отведённых на число, сами цифры числа занимают до 52 бит, остальные 11 бит хранят позицию десятичной точки и один бит – знак. Так что если 52 бит не хватает на цифры, то при записи пропадут младшие разряды.
Интерпретатор не выдаст ошибку, но в результате получится не совсем то число, что мы и видим в примере выше. Как говорится: "как смог, так записал".
	console.log( 9999999999999999 ); // 10000000000000000
	console.log( 9999999999999999..toLocaleString() ); // 10 000 000 000 000 000

Два нуля.
Другим забавным следствием внутреннего представления чисел является наличие двух нулей: 0 и -0.
Все потому, что знак представлен отдельным битом, так что, любое число может быть положительным и отрицательным, включая нуль.
В большинстве случаев это поведение незаметно, так как операторы в JS воспринимают их одинаковыми.

Проверка: isFinite и isNaN.
Помните эти специальные числовые значения?
	Infinity (и -Infinity) — особенное численное значение, которое ведёт себя в точности как математическая бесконечность ∞.
	NaN представляет ошибку.
Эти числовые значения принадлежат типу number, но они не являются обычными числами, поэтому есть функции для их проверки:
- isNaN(value) преобразует значение в число и проверяет является ли оно NaN:
	alert( isNaN(NaN) ); // true
	alert( isNaN("str") ); // true
	Нужна ли нам эта функция? Разве не можем ли мы просто сравнить === NaN? К сожалению, нет. Значение NaN уникально тем, что оно не является равным ничему другому, даже самому себе:
		alert( NaN === NaN ); // false
- isFinite(value) преобразует аргумент в число и возвращает true, если оно является обычным числом, т.е. не NaN/Infinity/-Infinity:
	alert( isFinite("15") ); // true
	alert( isFinite("str") ); // false, потому что специальное значение: NaN
	alert( isFinite(Infinity) ); // false, потому что специальное значение: Infinity
	Иногда isFinite используется для проверки, содержится ли в строке число:
		let num = +prompt("Введите число:", '');
		alert( isFinite(num) ); // вернёт true всегда, кроме ситуаций, когда аргумент - Infinity/-Infinity или не число
	Помните, что пустая строка интерпретируется как 0 во всех числовых функциях, включая isFinite.

Number.isNaN и Number.isFinite
Методы Number.isNaN и Number.isFinite – это более строгие версии функций isNaN и isFinite. Они не преобразуют аргумент в число, а наоборот – первым делом проверяют, является ли аргумент числом (принадлежит ли он к типу number).
Number.isNaN(value) возвращает true только в том случае, если аргумент принадлежит к типу number и является NaN. Во всех остальных случаях возвращает false.
	alert( Number.isNaN(NaN) ); // true
	alert( Number.isNaN("str" / 2) ); // true
	// Обратите внимание на разный результат:
	alert( Number.isNaN("str") ); // false, так как "str" является строкой, а не числом
	alert( isNaN("str") ); // true, так как isNaN сначала преобразует строку "str" в число и в результате преобразования получает NaN
Number.isFinite(value) возвращает true только в том случае, если аргумент принадлежит к типу number и не является NaN/Infinity/-Infinity. Во всех остальных случаях возвращает false.
	alert( Number.isFinite(123) ); // true
	alert( Number.isFinite(Infinity) ); // false
	alert( Number.isFinite(2 / 0) ); // false
	// Обратите внимание на разный результат:
	alert( Number.isFinite("123") ); // false, так как "123" является строкой, а не числом
	alert( isFinite("123") ); // true, так как isFinite сначала преобразует строку "123" в число 123
Не стоит считать Number.isNaN и Number.isFinite более корректными версиями функций isNaN и isFinite. Это дополняющие друг-друга инструменты для разных задач.

Сравнение Object.is
Существует специальный метод Object.is ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/is'], который сравнивает значения примерно как ===, но более надёжен в двух особых ситуациях:
1. Работает с NaN: Object.is(NaN, NaN) === true, здесь он хорош.
2. Значения 0 и -0 разные: Object.is(0, -0) === false, это редко используется, но технически эти значения разные.
Во всех других случаях Object.is(a, b) идентичен a === b.
Этот способ сравнения часто используется в спецификации JS. Когда внутреннему алгоритму необходимо сравнить 2 значения на предмет точного совпадения, он использует Object.is (Определение SameValue ['https://tc39.github.io/ecma262/#sec-samevalue']).

parseInt и parseFloat.
Для явного преобразования к числу можно использовать + или Number(). Если строка не является в точности числом, то результат будет NaN:
	alert( +"100px" ); // NaN
Единственное исключение — это пробелы в начале строки и в конце, они игнорируются.
В реальной жизни мы часто сталкиваемся со значениями у которых есть единица измерения, например "100px" или "12pt" в CSS. Также во множестве стран символ валюты записывается после номинала "19€". Так как нам получить числовое значение из таких строк?
Для этого есть parseInt и parseFloat.
Они читают число из строки. Если в процессе чтения возникает ошибка, они возвращают полученное до ошибки число. Функция parseInt возвращает целое число, а parseFloat возвращает число с плавающей точкой:
	alert( parseInt('100px') ); // 100
	alert( parseFloat('12.5em') ); // 12.5
	alert( parseInt('12.3') ); // 12, вернётся только целая часть
	alert( parseFloat('12.3.4') ); // 12.3, произойдёт остановка чтения на второй точке
Функции parseInt/parseFloat вернут NaN, если не смогли прочитать ни одну цифру:
	alert( parseInt('a123') ); // NaN, на первом символе происходит остановка чтения

Второй аргумент parseInt(str, radix).
Функция parseInt() имеет необязательный второй параметр. Он определяет систему счисления, таким образом parseInt может также читать строки с шестнадцатеричными числами, двоичными числами и т.д.:
	alert( parseInt('0xff', 16) ); // 255
	alert( parseInt('ff', 16) ); // 255, без 0x тоже работает
	alert( parseInt('2n9c', 36) ); // 123456

Другие математические функции.
В JS встроен объект Math, который содержит различные математические функции и константы.
Несколько примеров:
Math.random() // Возвращает псевдослучайное число в диапазоне от 0 (включительно) до 1 (но не включая 1)
	alert( Math.random() ); // 0.1234567894322
	alert( Math.random() ); // 0.5435252343232
	alert( Math.random() ); // ... (любое количество псевдослучайных чисел)
Math.max(a, b, c...) / Math.min(a, b, c...) // Возвращает наибольшее/наименьшее число из перечисленных аргументов.
	alert( Math.max(3, 5, -10, 0, 1) ); // 5
	alert( Math.min(1, 2) ); // 1
Math.pow(n, power) // Возвращает число n, возведённое в степень power
	alert( Math.pow(2, 10) ); // 2 в степени 10 = 1024
В объекте Math есть множество функций и констант, включая тригонометрические функции, подробнее можно ознакомиться в документации по объекту Math.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Math']

Итого:
Чтобы писать числа с большим количеством нулей:
	- Используйте краткую форму записи чисел – "e", с указанным количеством нулей. Например: 123e6 это 123 с 6-ю нулями 123000000.
	- Отрицательное число после "e" приводит к делению числа на 1 с указанным количеством нулей. Например: 123e-6 это 0.000123 (123 миллионных).
Для других систем счисления:
	- Можно записывать числа сразу в шестнадцатеричной (0x), восьмеричной (0o) и бинарной (0b) системах счисления
	- parseInt(str, base) преобразует строку в целое число в соответствии с указанной системой счисления: 2 ≤ base ≤ 36.
	- num.toString(base) представляет число в строковом виде в указанной системе счисления base.
Для проверки на NaN и Infinity:
	- isNaN(value) преобразует аргумент в число и проверяет, является ли оно NaN
	- Number.isNaN(value) проверяет, является ли аргумент числом, и если да, то проверяет, является ли оно NaN
	- isFinite(value) преобразует аргумент в число и проверяет, что оно не является NaN/Infinity/-Infinity
	- Number.isFinite(value) проверяет, является ли аргумент числом, и если да, то проверяет, что оно не является NaN/Infinity/-Infinity
Для преобразования значений типа 12pt и 100px в число:
	- Используйте parseInt/parseFloat для «мягкого» преобразования строки в число, данные функции по порядку считывают число из строки до тех пор пока не возникнет ошибка.
Для дробей:
	- Используйте округления Math.floor, Math.ceil, Math.trunc, Math.round или num.toFixed(precision).
	- Помните, что при работе с дробями происходит потеря точности.
Ещё больше математических функций:
	- Документация по объекту Math. Библиотека маленькая, но содержит всё самое важное.

задачи: 1+ 2- 3- 4+ 5+ 6+-
1. Сумма пользовательских чисел (важность: 5)
Создайте скрипт, который запрашивает ввод двух чисел (используйте prompt) и после показывает их сумму.
	let numb1 = +prompt('введите первое число', '');
	let numb2 = +prompt('введите второе число', '');
	alert(numb1+numb2);
2. Почему 6.35.toFixed(1) == 6.3? (важность: 4)
Методы Math.round и toFixed, согласно документации, округляют до ближайшего целого числа: 0..4 округляется в меньшую сторону, тогда как 5..9 в большую сторону.
Например: alert( 1.35.toFixed(1) ); // 1.4
Но почему в примере ниже 6.35 округляется до 6.3?
	alert( 6.35.toFixed(1) ); // 6.3
Как правильно округлить 6.35?
решение: console.log(Math.round(6.35 * 10) / 10); // 6.4
3. Ввод числового значения (важность: 5)
Создайте функцию readNumber, которая будет запрашивать ввод числового значения до тех пор, пока посетитель его не введёт.
Функция должна возвращать числовое значение.
Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.
решение:
	function readNumber(){
		let numb;
		do {numb = prompt('введите число', 0)} while (!isFinite(numb));
		if (numb === null || numb === '') return null;
		return +numb; 
	}
	alert(`Число: ${readNumber()}`);
/** Решение немного сложнее, чем могло бы быть, потому что нам надо обрабатывать null и пустую строку.
Следовательно, запрашиваем ввод числового значения, пока посетитель его не введёт. И null (отмена) и пустая строка также соответствуют данному условию, потому что при приведении к числу они равны 0.
После того, как цикл завершится, нам нужно проверить введённое значение на null и пустую строку (вернуть null), потому что после преобразования null в число, функция вернёт 0.*/
4. Бесконечный цикл по ошибке (важность: 4)
Этот цикл – бесконечный. Он никогда не завершится, почему?
	let i = 0;
	while (i != 10) {i += 0.2};
решение: потому что результат последовательного прибавления 0.2 никогда не будет целым числом (т.е. не будет равно 10). Это происходит из-за потери точности, при прибавлении таких дробей как 0.2:
	console.log((2/10).toFixed(20)); // 0.20000000000000001110
Вывод: избегайте проверок на равенство при работе с десятичными дробями.
5. Случайное число от min до max (важность: 2).
Встроенный метод Math.random() возвращает случайное число от 0 (включительно) до 1 (но не включая 1)
Напишите функцию random(min, max), которая генерирует случайное число с плавающей точкой от min до max (но не включая max).
Пример работы функции:
	alert( random(1, 5) ); // 1.2345623452
	alert( random(1, 5) ); // 3.7894332423
	alert( random(1, 5) ); // 4.3435234525
решение:
	let min = +prompt('введите первое число min', '');
	let max = +prompt('введите второе число max', '');
	function random(min, max) {
		if (min >= max) return 'ошибка, введите другие числа';
		return min + ((max - min) * Math.random());
	}
	alert(`случайное число между ${min} и ${max} : ${random(min, max)}`);
6. Случайное целое число от min до max (важность: 2)
Напишите функцию randomInteger(min, max), которая генерирует случайное целое (integer) число от min до max (включительно).
Любое число из интервала min..max должно появляться с одинаковой вероятностью.
Пример работы функции:
	alert( randomInteger(1, 5) ); // 1
	alert( randomInteger(1, 5) ); // 3
	alert( randomInteger(1, 5) ); // 5
решение:
Функция:
	function randomInteger(min, max) {
		let rand = min + Math.random() * (max - min);
		return Math.round(rand);
	}
будет работать, но неправильно. Вероятность получить min и max значения в 2 раза меньше, чем любое другое число.
Правильное решение:
	let min = +prompt('введите первое число min', '');
	let max = +prompt('введите второе число max', '');
	function randomInteger(min, max) {
		if (min >= max) return 'ошибка, введите другие числа';
		let rand = min + ((max + 1 - min) * Math.random());
		return Math.floor(rand);
	}
	alert(`случайное целое число между ${min} и ${max} : ${randomInteger(min, max)}`);
// Есть много правильных решений этой задачи. Одно из них – использовать Math.floor для получения случайного числа от min до max+1.

#1.5.3. Строки
4.3.25 - https://learn.javascript.ru/string
В JS любые текстовые данные являются строками. Не существует отдельного типа "символ", который есть в ряде других языков.
Внутренний формат для строк — всегда UTF-16 ['https://ru.wikipedia.org/wiki/UTF-16'], вне зависимости от кодировки страницы.

Кавычки.
В JS есть разные типы кавычек.
Строку можно создать с помощью одинарных, двойных либо обратных кавычек:
	let single = 'single-quoted';
	let double = "double-quoted";
	let backticks = `backticks`;
Одинарные и двойные кавычки работают, по сути, одинаково, а если использовать обратные кавычки, то в такую строку мы сможем вставлять произвольные выражения, обернув их в ${…}:
	function sum(a, b) {return a + b};
	alert(`1 + 2 = ${sum(1, 2)}.`); // 1 + 2 = 3.
Ещё одно преимущество обратных кавычек — они могут занимать более одной строки, вот так:
	let guestList = `Guests:
		 * John
		 * Pete
		 * Mary
		`;
	alert(guestList); // список гостей, состоящий из нескольких строк
Но если попытаться использовать точно так же одинарные или двойные кавычки, то будет ошибка:
	let guestList = "Guests: // Error: Unexpected token ILLEGAL
	  * John";
Одинарные и двойные кавычки в языке с незапамятных времён: тогда потребность в многострочных строках не учитывалась. Что касается обратных кавычек, они появились существенно позже, и поэтому они гибче.
Обратные кавычки также позволяют задавать "шаблонную функцию" перед первой обратной кавычкой. Используемый синтаксис: func`string`. Автоматически вызываемая функция func получает строку и встроенные в неё выражения и может их обработать. Подробнее об этом можно прочитать в документации ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Template_literals#Теговые_шаблоны']. Если перед строкой есть выражение, то шаблонная строка называется "теговым шаблоном". Это позволяет использовать свою шаблонизацию для строк, но на практике теговые шаблоны применяются редко.

Спецсимволы.
Многострочные строки также можно создавать с помощью одинарных и двойных кавычек, используя так называемый "символ перевода строки", который записывается как \n:
	let guestList = "Guests:\n * John\n * Pete\n * Mary";
	alert(guestList); // список гостей, состоящий из нескольких строк
В частности, эти две строки эквивалентны, просто записаны по-разному:
	let str1 = "Hello\nWorld"; // перевод строки добавлен с помощью символа перевода строки
	let str2 = `Hello
	World`;// многострочная строка, созданная с использованием обратных кавычек
	alert(str1 == str2); // true
Есть и другие, реже используемые спецсимволы. Вот список:
	Символ	Описание
	\n		Перевод строки
	\r		В текстовых файлах Windows для перевода строки используется комбинация символов \r\n, а на других ОС это просто \n. Это так по историческим причинам, ПО под Windows обычно понимает и просто \n.
	\', \", \`	Кавычки
	\\		Обратный слеш
	\t		Знак табуляции
	\b, \f, \v	Backspace, Form Feed и Vertical Tab — оставлены для обратной совместимости, сейчас не используются.
Как вы можете видеть, все спецсимволы начинаются с обратного слеша, \ — так называемого "символа экранирования". Он также используется, если необходимо вставить в строку кавычку.
К примеру:
	alert( 'I\'m the Walrus!' ); // I'm the Walrus!
Здесь перед входящей в строку кавычкой необходимо добавить обратный слеш — \' — иначе она бы обозначала окончание строки.
Разумеется, требование экранировать относится только к таким же кавычкам, как те, в которые заключена строка. Так что мы можем применить и более элегантное решение, использовав для этой строки двойные или обратные кавычки:
	alert( `I'm the Walrus!` ); // I'm the Walrus!
Заметим, что обратный слеш \ служит лишь для корректного прочтения строки интерпретатором, но он не записывается в строку после её прочтения. Когда строка сохраняется в оперативную память, в неё не добавляется символ \. Вы можете явно видеть это в выводах alert в примерах выше.
Но что, если нам надо добавить в строку собственно сам обратный слеш \?
Это можно сделать, добавив перед ним… ещё один обратный слеш!
	alert( `The backslash: \\` ); // The backslash: \

Длина строки.
Свойство length содержит длину строки:
	alert( `My\n`.length ); // 3
Обратите внимание, \n — это один спецсимвол, поэтому тут всё правильно: длина строки 3.

length — это свойство.
Бывает так, что люди с практикой в других языках случайно пытаются вызвать его, добавляя круглые скобки: они пишут str.length() вместо str.length. Это не работает. Так как str.length — это числовое свойство, а не функция, добавлять скобки не нужно.

Доступ к символам.
Получить символ, который занимает позицию pos, можно с помощью квадратных скобок: [pos]. Также можно использовать метод str.at(pos). Первый символ занимает нулевую позицию:
	let str = `Hello`;
	// получаем первый символ
	alert( str[0] ); // H
	alert( str.at(0) ); // H
	// получаем последний символ
	alert( str[str.length - 1] ); // o
	alert( str.at(-1) ); // o
Как вы можете видеть, преимущество метода .at(pos) заключается в том, что он допускает отрицательную позицию. Если pos – отрицательное число, то отсчет ведется от конца строки.
Таким образом, .at(-1) означает последний символ, а .at(-2) – тот, что перед ним, и т.д.
Квадратные скобки всегда возвращают undefined для отрицательных индексов. Например:
	let str = `Hello`;
	alert( str[-2] ); // undefined
	alert( str.at(-2) ); // l
Также можно перебрать строку посимвольно, используя for..of:
	for (let char of "Hello") {
		alert(char); // H,e,l,l,o (char — сначала "H", потом "e", потом "l" и т.д.)
	}

Строки неизменяемы.
Содержимое строки в JS нельзя изменить. Нельзя взять символ посередине и заменить его. Как только строка создана — она такая навсегда.
Давайте попробуем так сделать, и убедимся, что это не работает:
	let str = 'Hi';
	str[0] = 'h'; // ошибка
	alert( str[0] ); // не работает
Можно создать новую строку и записать её в ту же самую переменную вместо старой.
Например:
	let str = 'Hi';
	str = 'h' + str[1]; // заменяем строку
	alert( str ); // hi
В последующих разделах мы увидим больше примеров.

Изменение регистра.
Методы toLowerCase() и toUpperCase() меняют регистр символов:
	alert( 'Interface'.toUpperCase() ); // INTERFACE
	alert( 'Interface'.toLowerCase() ); // interface
Если мы захотим перевести в нижний регистр какой-то конкретный символ:
	alert( 'Interface'[0].toLowerCase() ); // 'i'

Поиск подстроки.
Существует несколько способов поиска подстроки.
(1) str.indexOf ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/indexOf']
Первый метод — str.indexOf(substr, pos).
Он ищет подстроку substr в строке str, начиная с позиции pos, и возвращает позицию, на которой располагается совпадение, либо -1 при отсутствии совпадений.
Например:
	let str = 'Widget with id';
	alert( str.indexOf('Widget') ); // 0, потому что подстрока 'Widget' найдена в начале
	alert( str.indexOf('widget') ); // -1, совпадений нет, поиск чувствителен к регистру
	alert( str.indexOf("id") ); // 1, подстрока "id" найдена на позиции 1 (..idget with id)
Необязательный второй аргумент позволяет начать поиск с определённой позиции.
Например, первое вхождение "id" — на позиции 1. Для того, чтобы найти следующее, начнём поиск с позиции 2:
	let str = 'Widget with id';
	alert( str.indexOf('id', 2) ) // 12
Чтобы найти все вхождения подстроки, нужно запустить indexOf в цикле. Каждый раз, получив очередную позицию, начинаем новый поиск со следующей:
	let str = 'Ослик Иа-Иа посмотрел на виадук';
	let target = 'Иа'; // цель поиска
	let pos = 0;
	while (true) {
		let foundPos = str.indexOf(target, pos);
		if (foundPos == -1) break;
		alert( `Найдено тут: ${foundPos}` );
		pos = foundPos + 1; // продолжаем со следующей позиции
	}
Тот же алгоритм можно записать и короче:
	let str = "Ослик Иа-Иа посмотрел на виадук";
	let target = "Иа";
	let pos = -1;
	while ((pos = str.indexOf(target, pos + 1)) != -1) alert(pos);

(2) str.lastIndexOf(substr, position).
Также есть похожий метод str.lastIndexOf(substr, position), который ищет с конца строки к её началу.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/lastIndexOf']
Он используется тогда, когда нужно получить самое последнее вхождение: перед концом строки или начинающееся до (включительно) определённой позиции.
При проверке indexOf в условии if есть небольшое неудобство. Такое условие не будет работать:
	let str = "Widget with id";
	if (str.indexOf("Widget")) {
		alert("Совпадение есть"); // не работает
	}
Мы ищем подстроку "Widget", и она здесь есть, прямо на позиции 0. Но alert не показывается, т. к. str.indexOf("Widget") возвращает 0, и if решает, что тест не пройден.
Поэтому надо делать проверку на -1:
	let str = "Widget with id";
	if (str.indexOf("Widget") != -1) {
		alert("Совпадение есть"); // теперь работает
	}

(3) Трюк с побитовым НЕ.
Существует старый трюк с использованием побитового оператора НЕ — ~ 
['https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Bitwise_NOT']. 
Он преобразует число в 32-разрядное целое со знаком (signed 32-bit integer). Дробная часть, в случае, если она присутствует, отбрасывается. Затем все биты числа инвертируются. На практике это означает простую вещь: для 32-разрядных целых чисел значение ~n равно -(n+1).
В частности:
	alert( ~2 ); // -3, то же, что -(2+1)
	alert( ~1 ); // -2, то же, что -(1+1)
	alert( ~0 ); // -1, то же, что -(0+1)
	alert( ~-1 ); // 0, то же, что -(-1+1)
Таким образом, ~n равняется 0 только при n == -1 (для любого n, входящего в 32-разрядные целые числа со знаком).
Соответственно, прохождение проверки if ( ~str.indexOf("…") ) означает, что результат indexOf отличен от -1, совпадение есть.
Это иногда применяют, чтобы сделать проверку indexOf компактнее:
	let str = "Widget";
	if (~str.indexOf("Widget")) {
		alert( 'Совпадение есть' ); // работает
	}
Обычно использовать возможности языка каким-либо неочевидным образом не рекомендуется, но этот трюк широко используется в старом коде, поэтому его важно понимать.
Просто запомните: if (~str.indexOf(…)) означает "если найдено".
Впрочем, если быть точнее, из-за того, что большие числа обрезаются до 32 битов оператором ~, существуют другие числа, для которых результат тоже будет 0, самое маленькое из которых — ~4294967295=0. Поэтому такая проверка будет правильно работать только для строк меньшей длины.
На данный момент такой трюк можно встретить только в старом коде, потому что в новом он просто не нужен: есть метод .includes (см. ниже).

(4) includes, startsWith, endsWith
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/includes']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/startsWith']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/endsWith']
Более современный метод str.includes(substr, pos) возвращает true, если в строке str есть подстрока substr, либо false, если нет.
Это — правильный выбор, если нам необходимо проверить, есть ли совпадение, но позиция не нужна:
	alert( "Widget with id".includes("Widget") ); // true
	alert( "Hello".includes("Bye") ); // false
Необязательный второй аргумент str.includes позволяет начать поиск с определённой позиции:
	alert( "Midget".includes("id") ); // true
	alert( "Midget".includes("id", 3) ); // false, поиск начат с позиции 3
Методы str.startsWith и str.endsWith проверяют, соответственно, начинается ли и заканчивается ли строка определённой строкой:
	alert( "Widget".startsWith("Wid") ); // true, "Wid" — начало "Widget"
	alert( "Widget".endsWith("get") ); // true, "get" — окончание "Widget"

Получение подстроки.
В JS есть 3 метода для получения подстроки: slice, substring, и substr.

str.slice(start [, end]); // Возвращает часть строки от start до (не включая) end.
Например:
	let str = "stringify";
	alert( str.slice(0, 5) ); // 'strin', символы от 0 до 5 (не включая 5)
	alert( str.slice(0, 1) ); // 's', от 0 до 1, не включая 1, т. е. только один символ на позиции 0
Если аргумент end отсутствует, slice возвращает символы до конца строки:
	alert( str.slice(2) ); // ringify, с позиции 2 и до конца
Также для start/end можно задавать отрицательные значения. Это означает, что позиция определена как заданное количество символов с конца строки:
	alert( str.slice(-4, -1) ); // gif // начинаем с позиции 4 справа, а заканчиваем на позиции 1 справа

str.substring(start [, end]); // Возвращает часть строки между start и end (не включая) end.
Это — почти то же, что и slice, но можно задавать start больше end.
Если start больше end, то метод substring сработает так, как если бы аргументы были поменяны местами.
Например:
	let str = "stringify";
	// для substring эти два примера — одинаковы
	alert( str.substring(2, 6) ); // "ring"
	alert( str.substring(6, 2) ); // "ring"
	// …но не для slice:
	alert( str.slice(2, 6) ); // "ring" (то же самое)
	alert( str.slice(6, 2) ); // "" (пустая строка)
Отрицательные значения substring, в отличие от slice, не поддерживает, они интерпретируются как 0.

str.substr(start [, length]); // Возвращает часть строки от start длины length.
В противоположность предыдущим методам, этот позволяет указать длину вместо конечной позиции:
	let str = "stringify";
	alert( str.substr(2, 4) ); // ring, получаем 4 символа, начиная с позиции 2
Значение первого аргумента может быть отрицательным, тогда позиция определяется с конца:
	alert( str.substr(-4, 2) ); // gi, получаем 2 символа, начиная с позиции 4 с конца строки
Этот метод находится в Annex B спецификации языка ['https://tc39.es/ecma262/#sec-string.prototype.substr']. Это означает, что его должны поддерживать только браузерные движки JS, и использовать его не рекомендуется. Но на практике он поддерживается везде.

Давайте подытожим, как работают эти методы, чтобы не запутаться:
	метод					выбирает…							отрицательные значения
	slice(start, end)		от start до end (не включая end)	можно передавать отрицательные значения
	substring(start, end)	между start и end (не включая end)	отрицательные значения равнозначны 0
	substr(start, length)	length символов, начиная от start	значение start может быть отрицательным

Какой метод выбрать? Все эти методы эффективно выполняют задачу. Формально у метода substr есть небольшой недостаток: он описан не в собственно спецификации JS, а в приложении к ней — Annex B. Это приложение описывает возможности языка для использования в браузерах, существующие в основном по историческим причинам. Таким образом, в другом окружении, отличном от браузера, он может не поддерживаться. Однако на практике он работает везде.
Из двух других вариантов, slice более гибок, он поддерживает отрицательные аргументы, и его короче писать. Так что, в принципе, можно запомнить только его.

Сравнение строк.
Как мы знаем из главы Операторы сравнения, строки сравниваются посимвольно в алфавитном порядке.
Тем не менее, есть некоторые нюансы.
Строчные буквы больше заглавных:
	alert( 'a' > 'Z' ); // true
Буквы, имеющие диакритические знаки, идут не по порядку:
	alert( 'Österreich' > 'Zealand' ); // true
Это может привести к своеобразным результатам при сортировке названий стран: нормально было бы ожидать, что Zealand будет после Österreich в списке.
Чтобы разобраться, что происходит, давайте ознакомимся с внутренним представлением строк в JS.
Строки кодируются в UTF-16. Таким образом, у любого символа есть соответствующий код. Есть специальные методы, позволяющие получить символ по его коду и наоборот.

str.codePointAt(pos); // Возвращает код UTF-16 для символа, находящегося на позиции pos
Например:
	// одна и та же буква в нижнем и верхнем регистре
	// будет иметь разные коды
	alert( "z".codePointAt(0) ); // 122
	alert( "Z".codePointAt(0) ); // 90

String.fromCodePoint(code); // Создаёт символ по его коду code
Например:
	alert( String.fromCodePoint(90) ); // Z
Давайте сделаем строку, содержащую символы с кодами от 65 до 220 — это латиница и ещё некоторые распространённые символы:
	let str = '';
	for (let i = 65; i <= 220; i++) {
		str += String.fromCodePoint(i);
	}
	alert( str );
	// ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~
	// ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜ
Как видите, сначала идут заглавные буквы, затем несколько спецсимволов, затем строчные и Ö ближе к концу вывода.
Теперь очевидно, почему a > Z.
Символы сравниваются по их кодам. Больший код — больший символ. Код a (97) больше кода Z (90).
Все строчные буквы идут после заглавных, так как их коды больше.
Некоторые буквы, такие как Ö, вообще находятся вне основного алфавита. У этой буквы код больше, чем у любой буквы от a до z.

Правильное сравнение.
"Правильный" алгоритм сравнения строк сложнее, чем может показаться, так как разные языки используют разные алфавиты.
Поэтому браузеру нужно знать, какой язык использовать для сравнения.
К счастью, все современные браузеры (для IE10− нужна дополнительная библиотека Intl.JS ['https://github.com/andyearnshaw/Intl.js/']) поддерживают стандарт ECMA 402 ['https://www.ecma-international.org/ecma-402/1.0/ECMA-402.pdf'], обеспечивающий правильное сравнение строк на разных языках с учётом их правил.
Для этого есть соответствующий метод.
Вызов str.localeCompare(str2) возвращает число, которое показывает, какая строка больше в соответствии с правилами языка:
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/localeCompare']
	Отрицательное число, если str меньше str2.
	Положительное число, если str больше str2.
	0, если строки равны.
Например:
	alert( 'Österreich'.localeCompare('Zealand') ); // -1
У этого метода есть два дополнительных аргумента, которые указаны в документации. Первый позволяет указать язык (по умолчанию берётся из окружения) — от него зависит порядок букв. Второй — определить дополнительные правила, такие как чувствительность к регистру, а также следует ли учитывать различия между "a" и "á".

Итого:
	Есть три типа кавычек. Строки, использующие обратные кавычки, могут занимать более одной строки в коде и включать выражения ${…}.
	Строки в JS кодируются в UTF-16.
	Есть специальные символы, такие как разрыв строки \n.
	Для получения символа используйте [] или метод at.
	Для получения подстроки используйте slice или substring.
	Для того, чтобы перевести строку в нижний или верхний регистр, используйте toLowerCase/toUpperCase.
	Для поиска подстроки используйте indexOf или includes/startsWith/endsWith, когда надо только проверить, есть ли вхождение.
	Чтобы сравнить строки с учётом правил языка, используйте localeCompare.
Строки также имеют ещё кое-какие полезные методы:
	str.trim() // убирает пробелы в начале и конце строки.
	str.repeat(n) // повторяет строку n раз.
	…и другие, которые вы можете найти в справочнике ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String'].
Для строк предусмотрены методы для поиска и замены с использованием регулярных выражений. Но это отдельная большая тема, поэтому ей посвящена отдельная глава учебника Регулярные выражения ['https://learn.javascript.ru/regular-expressions'].
Также, на данный момент важно знать, что строки основаны на кодировке Юникод, и поэтому иногда могут возникать проблемы со сравнениями. Подробнее о Юникоде в главе Юникод, внутреннее устройство строк ['https://learn.javascript.ru/unicode'].

задачи: 1+- 2+ 3+- 4+
1. Сделать первый символ заглавным (важность: 5)
Напишите функцию ucFirst(str), возвращающую строку str с заглавным первым символом. Например:
	ucFirst("вася") == "Вася";
решение:
	function ucFirst1(str){return str.charAt(0) + str.slice(1)};
	function ucFirst(str){
		if (!str) return str;
		return str[0].toUpperCase() + str.slice(1);
	};
	console.log(ucFirst1('')); // [пустая строка]
	console.log(ucFirst('stringify')); // Stringify
/** Если строка пуста, str[0] вернёт undefined, а у undefined нет метода toUpperCase(), поэтому мы получим ошибку.
Выхода два:
(1) Использовать str.charAt(0), поскольку этот метод всегда возвращает строку (для пустой строки — пустую).
(2) Добавить проверку на пустую строку.*/

2. Проверка на спам (важность: 5)
Напишите функцию checkSpam(str), возвращающую true, если str содержит 'viagra' или 'XXX', а иначе false.
Функция должна быть нечувствительна к регистру:
	checkSpam('buy ViAgRA now') == true
	checkSpam('free xxxxx') == true
	checkSpam("innocent rabbit") == false
решение:
	// Для поиска без учёта регистра символов переведём всю строку в нижний регистр, а потом проверим, есть ли в ней искомые подстроки
	function checkSpam(str){
		str = str.toLowerCase();
		return console.log(str.includes('viagra') || str.includes('xxx'));
	};
	checkSpam('buy ViAgRA now'); // true
	checkSpam('free xxxxx'); // true
	checkSpam("innocent rabbit"); // false

3. Усечение строки (важность: 5)
Создайте функцию truncate(str, maxlength), которая проверяет длину строки str и, если она превосходит maxlength, заменяет конец str на "…", так, чтобы её длина стала равна maxlength. Результатом функции должна быть та же строка, если усечение не требуется, либо, если необходимо, усечённая строка.
Например:
	truncate("Вот, что мне хотелось бы сказать на эту тему:", 20) // "Вот, что мне хотело…"
	truncate("Всем привет!", 20) // "Всем привет!"
решение:
	function truncate(str, maxlength){
		return (str.length > maxlength) ? str.slice(0, maxlength-1) + '…' : str;
	}
	console.log(truncate("Вот, что мне хотелось бы сказать на эту тему:", 20)); // "Вот, что мне хотело…"
	console.log(truncate("Всем привет!", 20)); // "Всем привет!"
/** Строка, которую мы возвращаем, должна быть не длиннее maxlength, поэтому, если мы обрезаем строку, то мы должны убрать на один символ больше, чем maxlength — чтобы хватило места на многоточие. 
Имейте в виду, что в качестве многоточия здесь используется … — ровно один специальный Юникодный символ. Это не то же самое, что ... — три точки.*/

4. Выделить число (важность: 4)
Есть стоимость в виде строки "$120". То есть сначала идёт знак валюты, а затем – число.
Создайте функцию extractCurrencyValue(str), которая будет из такой строки выделять числовое значение и возвращать его.
Например:
	alert( extractCurrencyValue('$120') === 120 ); // true
решение:
	function extractCurrencyValue(str){return +str.slice(1)};
	console.log(extractCurrencyValue('$120') === 120); // true

#1.5.4. Массивы
6.3.25 - https://learn.javascript.ru/array
Объекты позволяют хранить данные со строковыми ключами. Это замечательно.
Но довольно часто мы понимаем, что нам необходима упорядоченная коллекция данных, в которой присутствуют 1-й, 2-й, 3-й элементы и т.д. Например, она понадобится нам для хранения списка чего-либо: пользователей, товаров, элементов HTML и т.д.
В этом случае использовать объект неудобно, так как он не предоставляет методов управления порядком элементов. Мы не можем вставить новое свойство между уже существующими. Объекты просто не предназначены для этих целей.
Для хранения упорядоченных коллекций существует особая структура данных, которая называется массив, Array.

Объявление.
Существует два варианта синтаксиса для создания пустого массива:
	let arr = new Array();
	let arr = [];
Практически всегда используется второй вариант синтаксиса. В скобках мы можем указать начальные значения элементов:
	let fruits = ["Яблоко", "Апельсин", "Слива"];
Элементы массива нумеруются, начиная с нуля.
Мы можем получить элемент, указав его номер в квадратных скобках:
	let fruits = ["Яблоко", "Апельсин", "Слива"];
	alert( fruits[0] ); // Яблоко
	alert( fruits[1] ); // Апельсин
	alert( fruits[2] ); // Слива
Мы можем заменить элемент:
	fruits[2] = 'Груша'; // теперь ["Яблоко", "Апельсин", "Груша"]
…Или добавить новый к существующему массиву:
	fruits[3] = 'Лимон'; // теперь ["Яблоко", "Апельсин", "Груша", "Лимон"]
Общее число элементов массива содержится в его свойстве length:
	let fruits = ["Яблоко", "Апельсин", "Слива"];
	alert( fruits.length ); // 3
Вывести массив целиком можно при помощи alert.
	let fruits = ["Яблоко", "Апельсин", "Слива"];
	alert( fruits ); // Яблоко, Апельсин, Слива
В массиве могут храниться элементы любого типа.
Например:
	let arr = [ 'Яблоко', { name: 'Джон' }, true, function() { alert('привет'); } ]; // разные типы значений
	// получить элемент с индексом 1 (объект) и затем показать его свойство
	alert( arr[1].name ); // Джон
	// получить элемент с индексом 3 (функция) и выполнить её
	arr[3](); // привет

Висячая запятая.
Список элементов массива, как и список свойств объекта, может оканчиваться запятой:
	let fruits = ["Яблоко", "Апельсин", "Слива",];
Висячая запятая упрощает процесс добавления/удаления элементов, так как все строки становятся идентичными.

Получение последних элементов при помощи at.
// Новая возможность. Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Допустим, нам нужен последний элемент массива.
Некоторые языки программирования позволяют использовать отрицательные индексы для той же цели, как-то так: fruits[-1].
Однако, в JS такая запись не сработает. Её результатом будет undefined, поскольку индекс в квадратных скобках понимается буквально.
Мы можем явно вычислить индекс последнего элемента, а затем получить к нему доступ вот так: fruits[fruits.length - 1].
	let fruits = ["Apple", "Orange", "Plum"];
	alert( fruits[fruits.length-1] ); // Plum
Немного громоздко, не так ли? Нам нужно дважды написать имя переменной.
К счастью, есть более короткий синтаксис: fruits.at(-1):
	alert( fruits.at(-1) ); // Plum // то же самое, что и fruits[fruits.length-1]
Другими словами, arr.at(i): 
	- это ровно то же самое, что и arr[i], если i >= 0.
	- для отрицательных значений i, он отступает от конца массива.

Методы pop/push, shift/unshift.
Очередь ['https://ru.wikipedia.org/wiki/Очередь_(программирование)'] – один из самых распространённых вариантов применения массива. В области компьютерных наук так называется упорядоченная коллекция элементов, поддерживающая два вида операций:
	- push добавляет элемент в конец.
	- shift удаляет элемент в начале, сдвигая очередь, так что второй элемент становится первым.
Массивы поддерживают обе операции.
На практике необходимость в этом возникает очень часто. Например, очередь сообщений, которые надо показать на экране.
Существует и другой вариант применения для массивов – структура данных, называемая стек ['https://ru.wikipedia.org/wiki/Стек'].
Она поддерживает два вида операций:
	- push добавляет элемент в конец.
	- pop удаляет последний элемент.
Таким образом, новые элементы всегда добавляются или удаляются из конца.
Примером стека обычно служит колода карт: новые карты кладутся наверх и берутся тоже сверху:
Массивы в JS могут работать и как очередь, и как стек. Мы можем добавлять/удалять элементы как в начало, так и в конец массива. В компьютерных науках структура данных, делающая это возможным, называется двусторонняя очередь ['https://ru.wikipedia.org/wiki/Двухсторонняя_очередь'].

Методы, работающие с концом массива:

pop().
Удаляет последний элемент из массива и возвращает его:
	let fruits = ["Яблоко", "Апельсин", "Груша"];
	alert( fruits.pop() ); // удаляем "Груша" и выводим его
	alert( fruits ); // Яблоко, Апельсин
И fruits.pop() и fruits.at(-1) возвращают последний элемент массива, но fruits.pop() также изменяет массив, удаляя его.

push().
Добавляет элемент в конец массива:
	let fruits = ["Яблоко", "Апельсин"];
	fruits.push("Груша");
	alert( fruits ); // Яблоко, Апельсин, Груша
Вызов fruits.push(...) равнозначен fruits[fruits.length] = ... .

Методы, работающие с началом массива:
shift().
Удаляет из массива первый элемент и возвращает его:
	let fruits = ["Яблоко", "Апельсин", "Груша"];
	alert( fruits.shift() ); // удаляем Яблоко и выводим его
	alert( fruits ); // Апельсин, Груша

unshift().
Добавляет элемент в начало массива:
	let fruits = ["Апельсин", "Груша"];
	fruits.unshift('Яблоко');
	alert( fruits ); // Яблоко, Апельсин, Груша
Методы push и unshift могут добавлять сразу несколько элементов:
	let fruits = ["Яблоко"];
	fruits.push("Апельсин", "Груша");
	fruits.unshift("Ананас", "Лимон");
	alert( fruits ); // ["Ананас", "Лимон", "Яблоко", "Апельсин", "Груша"]

Внутреннее устройство массива.
Массив – это особый подвид объектов. Квадратные скобки, используемые для того, чтобы получить доступ к свойству arr[0] – это по сути обычный синтаксис доступа по ключу, как obj[key], где в роли obj у нас arr, а в качестве ключа – числовой индекс.
Массивы расширяют объекты, так как предусматривают специальные методы для работы с упорядоченными коллекциями данных, а также свойство length. Но в основе всё равно лежит объект.
Следует помнить, что в JS существует 8 основных типов данных. Массив является объектом и, следовательно, ведёт себя как объект.
Например, копируется по ссылке:
	let fruits = ["Банан"]
	let arr = fruits; // копируется по ссылке (две переменные ссылаются на один и тот же массив)
	alert( arr === fruits ); // true
	arr.push("Груша"); // массив меняется по ссылке
	alert( fruits ); // Банан, Груша - теперь два элемента
…Но то, что действительно делает массивы особенными – это их внутреннее представление. Движок JS старается хранить элементы массива в непрерывной области памяти, один за другим, так, как это показано на иллюстрациях к этой главе. Существуют и другие способы оптимизации, благодаря которым массивы работают очень быстро.
Но все они утратят эффективность, если мы перестанем работать с массивом как с "упорядоченной коллекцией данных" и начнём использовать его как обычный объект.
Например, технически мы можем сделать следующее:
	let fruits = []; // создаём массив
	fruits[99999] = 5; // создаём свойство с индексом, намного превышающим длину массива
	fruits.age = 25; // создаём свойство с произвольным именем
Это возможно, потому что в основе массива лежит объект. Мы можем присвоить ему любые свойства.
Но движок поймёт, что мы работаем с массивом, как с обычным объектом. Способы оптимизации, используемые для массивов, в этом случае не подходят, поэтому они будут отключены и никакой выгоды не принесут.
Варианты неправильного применения массива:
	- Добавление нечислового свойства, например: arr.test = 5.
	- Создание "дыр", например: добавление arr[0], затем arr[1000] (между ними ничего нет).
	- Заполнение массива в обратном порядке, например: arr[1000], arr[999] и т.д.
Массив следует считать особой структурой, позволяющей работать с упорядоченными данными. Для этого массивы предоставляют специальные методы. Массивы тщательно настроены в движках JS для работы с однотипными упорядоченными данными, поэтому, пожалуйста, используйте их именно в таких случаях. Если вам нужны произвольные ключи, вполне возможно, лучше подойдёт обычный объект {}.

Эффективность.
Методы push/pop выполняются быстро, а методы shift/unshift – медленно.
Почему работать с концом массива быстрее, чем с его началом? Давайте посмотрим, что происходит во время выполнения:
	fruits.shift(); // удаляем первый элемент с начала
Просто взять и удалить элемент с номером 0 недостаточно. Нужно также заново пронумеровать остальные элементы.
Операция shift должна выполнить 3 действия:
	- Удалить элемент с индексом 0.
	- Сдвинуть все элементы влево, заново пронумеровать их, заменив 1 на 0, 2 на 1 и т.д.
	- Обновить свойство length.
Чем больше элементов содержит массив, тем больше времени потребуется для того, чтобы их переместить, больше операций с памятью.
То же самое происходит с unshift: чтобы добавить элемент в начало массива, нам нужно сначала сдвинуть существующие элементы вправо, увеличивая их индексы.
А что же с push/pop? Им не нужно ничего перемещать. Чтобы удалить элемент в конце массива, метод pop очищает индекс и уменьшает значение length.
Действия при операции pop:
	fruits.pop(); // удаляем один элемент с конца
Метод pop не требует перемещения, потому что остальные элементы остаются с теми же индексами. Именно поэтому он выполняется очень быстро.
Аналогично работает метод push.

Перебор элементов.
Одним из самых старых способов перебора элементов массива является цикл for по цифровым индексам:
	let arr = ["Яблоко", "Апельсин", "Груша"];
	for (let i = 0; i < arr.length; i++) {alert( arr[i] )};
Но для массивов возможен и другой вариант цикла, for..of:
	let fruits = ["Яблоко", "Апельсин", "Слива"];
	for (let fruit of fruits) {alert( fruit )}; // проходит по значениям
Цикл for..of не предоставляет доступа к номеру текущего элемента, только к его значению, но в большинстве случаев этого достаточно. А также это короче.
Технически, так как массив является объектом, можно использовать и вариант for..in:
	let arr = ["Яблоко", "Апельсин", "Груша"];
	for (let key in arr) {alert( arr[key] )}; // Яблоко, Апельсин, Груша
Но на самом деле это – плохая идея. Существуют скрытые недостатки этого способа:
(1) Цикл for..in выполняет перебор всех свойств объекта, а не только цифровых.
	В браузере и других программных средах также существуют так называемые "псевдомассивы" – объекты, которые выглядят, как массив. То есть, у них есть свойство length и индексы, но они также могут иметь дополнительные нечисловые свойства и методы, которые нам обычно не нужны. Тем не менее, цикл for..in выведет и их. Поэтому, если нам приходится иметь дело с объектами, похожими на массив, такие "лишние" свойства могут стать проблемой.
(2) Цикл for..in оптимизирован под произвольные объекты, не массивы, и поэтому в 10-100 раз медленнее. Увеличение скорости выполнения может иметь значение только при возникновении узких мест. Но мы всё же должны представлять разницу.
В общем, не следует использовать цикл for..in для массивов.

Немного о length.
Свойство length автоматически обновляется при изменении массива. Если быть точными, это не количество элементов массива, а наибольший цифровой индекс плюс один.
Например, единственный элемент, имеющий большой индекс, даёт большую длину:
	let fruits = [];
	fruits[123] = "Яблоко";
	alert( fruits.length ); // 124
Обратите внимание, что обычно мы не используем массивы таким образом.
Ещё один интересный факт о свойстве length – его можно перезаписать.
Если мы вручную увеличим его, ничего интересного не произойдёт. Зато, если мы уменьшим его, массив станет короче. Этот процесс необратим, как мы можем понять из примера:
	let arr = [1, 2, 3, 4, 5];
	arr.length = 2; // укорачиваем до двух элементов
	alert( arr ); // [1, 2]
	arr.length = 5; // возвращаем length как было
	alert( arr[3] ); // undefined: значения не восстановились
Таким образом, самый простой способ очистить массив – это arr.length = 0; .

new Array().
Существует ещё один вариант синтаксиса для создания массива:
	let arr = new Array("Яблоко", "Груша", "и тд");
Он редко применяется, так как квадратные скобки [] короче. Кроме того, у него есть хитрая особенность.
Если new Array вызывается с одним аргументом, который представляет собой число, он создаёт массив без элементов, но с заданной длиной.
Давайте посмотрим, как можно оказать себе медвежью услугу:
	let arr = new Array(2); // создастся ли массив [2]?
	alert( arr[0] ); // undefined! нет элементов.
	alert( arr.length ); // length 2
Как мы видим, в коде, представленном выше, в new Array(number) все элементы равны undefined.
Чтобы избежать появления таких неожиданных ситуаций, мы обычно используем квадратные скобки, если, конечно, не знаем точно, что по какой-то причине нужен именно Array.

Многомерные массивы.
Массивы могут содержать элементы, которые тоже являются массивами. Это можно использовать для создания многомерных массивов, например, для хранения матриц:
	let matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
	alert( matrix[1][1] ); // 5, центральный элемент

toString().
Массивы по-своему реализуют метод toString, который возвращает список элементов, разделённых запятыми.
Например:
	let arr = [1, 2, 3];
	alert( arr ); // 1,2,3
	alert( String(arr) === '1,2,3' ); // true
Давайте теперь попробуем следующее:
	alert( [] + 1 ); // "1"
	alert( [1] + 1 ); // "11"
	alert( [1,2] + 1 ); // "1,21"
Массивы не имеют ни Symbol.toPrimitive, ни функционирующего valueOf, они реализуют только преобразование toString, таким образом, здесь [] становится пустой строкой, [1] становится "1", а [1,2] становится "1,2".
Когда бинарный оператор плюс "+" добавляет что-либо к строке, он тоже преобразует это в строку, таким образом:
	alert( "" + 1 ); // "1"
	alert( "1" + 1 ); // "11"
	alert( "1,2" + 1 ); // "1,21"

Не сравнивайте массивы при помощи ==.
В JS, в отличие от некоторых других языков программирования, массивы не следует сравнивать при помощи оператора ==.
У этого оператора нет специального подхода к массивам, он работает с ними, как и с любыми другими объектами.
Давайте ещё раз напомним правила:
	- Два объекта равны друг другу == только в том случае, если они ссылаются на один и тот же объект.
	- Если один из аргументов == является объектом, а другой – примитивом, то объект преобразуется в примитив, как описано в главе Преобразование объектов в примитивы ['https://learn.javascript.ru/object-toprimitive'].
	- …За исключением null и undefined, которые равны == друг другу и ничему больше.
Оператор строгого равенства === ещё проще, так как он не преобразует типы.
Итак, если мы всё же сравниваем массивы с помощью ==, то они никогда не будут одинаковыми, если только мы не сравним две переменные, которые ссылаются на один и тот же массив.
Например:
	alert( [] == [] ); // false
	alert( [0] == [0] ); // false
Технически эти массивы являются разными объектами. Так что они не равны. Оператор == не выполняет поэлементное сравнение.
Сравнение с примитивами также может дать, казалось бы, странные результаты:
	alert( 0 == [] ); // true
	alert('0' == [] ); // false
Здесь, в обоих случаях, мы сравниваем примитив с объектом массива. Таким образом, массив [] преобразуется в примитив с целью сравнения и становится пустой строкой ''.
Затем продолжается процесс сравнения с примитивами, как описано в главе Преобразование типов:
	// после того, как [] был преобразован в ''
	alert( 0 == '' ); // true, так как '' преобразуется в число 0
	alert('0' == '' ); // false, нет преобразования типов, разные строки
Так как же сравнить массивы?
Это просто: не используйте оператор ==. Вместо этого сравните их по элементам в цикле или используя методы итерации, описанные в следующей главе.

Итого:
Массив – это особый тип объекта, предназначенный для работы с упорядоченным набором элементов.
Объявление:
	let arr = [item1, item2...]; // квадратные скобки (обычно)
	let arr = new Array(item1, item2...); // new Array (очень редко)
Вызов new Array(number) создаёт массив с заданной длиной, но без элементов.
Свойство length отражает длину массива или, если точнее, его последний цифровой индекс плюс один. Длина корректируется автоматически методами массива. Если мы уменьшаем length вручную, массив укорачивается.
Получение элементов:
	- Мы можем получить элемент по его индексу, например arr[0].
	- Также мы можем использовать метод at(i) для получения элементов с отрицательным индексом, для отрицательных значений i, он отступает от конца массива. В остальном он работает так же, как arr[i], если i >= 0.
Мы можем использовать массив как двустороннюю очередь, используя следующие операции:
	push(...items); // добавляет items в конец массива.
	pop(); // удаляет элемент в конце массива и возвращает его.
	shift(); // удаляет элемент в начале массива и возвращает его.
	unshift(...items); // добавляет items в начало массива.
Чтобы пройтись по элементам массива:
	for (let i=0; i < arr.length; i++); // работает быстрее всего, совместим со старыми браузерами.
	for (let item of arr); // современный синтаксис только для значений элементов (к индексам нет доступа).
	for (let i in arr); // никогда не используйте для массивов!
Мы вернёмся к массивам и изучим другие методы добавления, удаления, выделения элементов и сортировки массивов в главе: Методы массивов ['https://learn.javascript.ru/array-methods'].

задачи: 1- 2+- 3+ 4+- 5
1. Скопирован ли массив? (важность: 3)
Что выведет следующий код?
	let fruits = ["Яблоки", "Груша", "Апельсин"];
	let shoppingCart = fruits;
	shoppingCart.push("Банан"); // добавляем новое значение в "копию"
	// что в fruits?
	alert( fruits.length ); // ? // 4
// Потому, что массивы – это объекты. Обе переменные shoppingCart и fruits являются ссылками на один и тот же массив.

2. Операции с массивами (важность: 5)
Давайте произведём 5 операций с массивом.
	1. Создайте массив styles с элементами «Джаз» и «Блюз».
	2. Добавьте «Рок-н-ролл» в конец.
	3. Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной.
	4. Удалите первый элемент массива и покажите его.
	5. Вставьте Рэп и Регги в начало массива.
Массив по ходу выполнения операций:
	Джаз, Блюз
	Джаз, Блюз, Рок-н-ролл
	Джаз, Классика, Рок-н-ролл
	Классика, Рок-н-ролл
	Рэп, Регги, Классика, Рок-н-ролл
решение:
	let styles = ['Джаз', 'Блюз'];
	console.log(styles); // (2) ['Джаз', 'Блюз']
	styles.push('Рок-н-ролл');
	console.log(styles); // (3) ['Джаз', 'Блюз', 'Рок-н-ролл']
	// let first = styles.shift();
	// let second = styles.shift();
	// styles.unshift(first, 'Классика');
	styles[Math.floor((styles.length - 1) / 2)] = "Классика";
	console.log(styles); // (3) ['Джаз', 'Классика', 'Рок-н-ролл']
	console.log(styles.shift()); // Джаз
	console.log(styles); // (2) ['Классика', 'Рок-н-ролл']
	styles.unshift('Рэп', 'Регги');
	console.log(styles); // (4) ['Рэп', 'Регги', 'Классика', 'Рок-н-ролл']

3. Вызов в контексте массива (важность: 5)
Каков результат? Почему?
	let arr = ["a", "b"];
	arr.push(function(){alert(this)});
	arr[2](); // ? a,b,function(){alert(this)}

4. Сумма введённых чисел (важность: 4)
Напишите функцию sumInput(), которая:
	Просит пользователя ввести значения, используя prompt и сохраняет их в массив.
	Заканчивает запрашивать значения, когда пользователь введёт не числовое значение, пустую строку или нажмёт «Отмена».
	Подсчитывает и возвращает сумму элементов массива.
P.S. Ноль 0 – считается числом, не останавливайте ввод значений при вводе 0.
решение:
	function sumInput(){
		let arr = [], sum = 0;
		while (true) {
			let numb = prompt('введите число', 0);
			if (!isFinite(+numb) || numb === '' || numb === null) break;
			arr.push(+numb);
		};
		for (let i of arr) sum += i;
		return console.log(`сумма элементов массива ${arr} = ` + sum);
	}
	sumInput();
// Обратите внимание на малозаметную, но важную деталь решения. Мы не преобразуем value в число сразу после prompt, потому что после value = +value мы не сможем отличить пустую строку (конец записи) от «0» (разрешённое число). Мы сделаем это позже.

5. Подмассив наибольшей суммы (важность: 2)
На входе массив чисел, например: arr = [1, -2, 3, 4, -9, 6].
Задача: найти непрерывный подмассив в arr, сумма (?положительных) элементов в котором максимальна.
Функция getMaxSubSum(arr) должна возвращать эту сумму.
Например:
	getMaxSubSum([-1, 2, 3, -9]) == 5 (сумма выделенных элементов)
	getMaxSubSum([2, -1, 2, 3, -9]) == 6
	getMaxSubSum([-1, 2, 3, -9, 11]) == 11
	getMaxSubSum([-2, -1, 1, 2]) == 3
	getMaxSubSum([100, -9, 2, -3, 5]) == 100
	getMaxSubSum([1, 2, 3]) == 6 (берём все)
Если все элементы отрицательные – ничего не берём(подмассив пустой) и сумма равна 0:
	getMaxSubSum([-1, -2, -3]) = 0
Попробуйте придумать быстрое решение: O(n^2), а лучше за О(n) операций.
решение:
(1) Медленное решение
Можно посчитать все возможные подсуммы.
Самый простой путь – посчитать суммы подмассивов, начиная с каждого элемента по очереди.
	function getMaxSubSum(arr){
		let maxSum = 0; // если элементов не будет - возвращаем 0
		for (let i = 0; i < arr.length; i++) {
			let sumFixedStart = 0;
			for (let j = i; j < arr.length; j++) {
				sumFixedStart += arr[j];
				maxSum = Math.max(maxSum, sumFixedStart);
			}
		}
		return maxSum;
	}
	console.log(getMaxSubSum([-1, 2, 3, -9])); // == 5 (сумма выделенных элементов)
	console.log(getMaxSubSum([2, -1, 2, 3, -9])); // == 6
	console.log(getMaxSubSum([-1, 2, 3, -9, 11])); // == 11
	console.log(getMaxSubSum([-2, -1, 1, 2])); // == 3
	console.log(getMaxSubSum([100, -9, 2, -3, 5])); // == 100
	console.log(getMaxSubSum([1, 2, 3])); // == 6 (берём все)
Это решение имеет оценку сложности O(n2). Другими словами, если мы увеличим размер массива в 2 раза, время выполнения алгоритма увеличится в 4 раза. Для больших массивов(1000, 10000 или больше элементов) такие алгоритмы могут приводить к серьёзным тормозам.
(2) Быстрое решение.
Идём по массиву и накапливаем текущую частичную сумму элементов в переменной s. Если s в какой-то момент становится отрицательной – присваиваем s=0. Максимальный из всех s и будет ответом.
Если объяснение недостаточно понятно, посмотрите на код, он вполне лаконичен:
	function getMaxSubSum(arr) {
		let maxSum = 0;
		let partialSum = 0;
		for (let item of arr) { // для каждого элемента массива
			partialSum += item; // добавляем значение элемента к partialSum
			maxSum = Math.max(maxSum, partialSum); // запоминаем максимум на данный момент
			if (partialSum < 0) partialSum = 0; // ноль если отрицательное
		}
		return maxSum;
	}
Этот алгоритм требует ровно 1 проход по массиву и его оценка сложности O(n).
Больше информации об алгоритме тут: Задача поиска максимальной суммы подмассива. Если всё ещё не очевидно как это работает, просмотрите алгоритм в примерах выше, это будет лучше всяких слов.

#1.5.5. Методы массивов
8.3.25 - https://learn.javascript.ru/array-methods
Массивы предоставляют множество методов. Чтобы было проще, в этой главе они разбиты на группы.

Добавление/удаление элементов.
Мы уже знаем методы, которые добавляют и удаляют элементы из начала или конца:
	arr.push(...items) – добавляет элементы в конец,
	arr.pop() – извлекает элемент из конца,
	arr.shift() – извлекает элемент из начала,
	arr.unshift(...items) – добавляет элементы в начало.
Есть и другие.

splice().
Как удалить элемент из массива?
Так как массивы – это объекты, то можно попробовать delete:
	let arr = ["I", "go", "home"];
	delete arr[1]; // удалить "go"
	alert( arr[1] ); // undefined
	// теперь arr = ["I",  , "home"];
	alert( arr.length ); // 3
Элемент был удалён, но в массиве всё ещё три элемента, мы можем увидеть, что arr.length == 3.
Это естественно, потому что delete obj.key удаляет значение по ключу key. Это всё, что он делает. Хорошо для объектов. Но для массивов мы обычно хотим, чтобы оставшиеся элементы сдвинулись и заняли освободившееся место. Мы ждём, что массив станет короче.
Поэтому нужно использовать специальные методы.
Метод arr.splice – это универсальный "швейцарский нож" для работы с массивами. Умеет всё: добавлять, удалять и заменять элементы.
Синтаксис:
	arr.splice(start[, deleteCount, elem1, ..., elemN])
Он изменяет arr начиная с индекса start: удаляет deleteCount элементов и затем вставляет elem1, ..., elemN на их место. Возвращает массив из удалённых элементов.
Этот метод легко понять, рассмотрев примеры.
Начнём с удаления:
	let arr = ["Я", "изучаю", "JavaScript"];
	arr.splice(1, 1); // начиная с индекса 1, удалить 1 элемент
	alert( arr ); // осталось ["Я", "JavaScript"]
Легко, правда? Начиная с индекса 1, он убрал 1 элемент.
В следующем примере мы удалим 3 элемента и заменим их двумя другими.
	let arr = ["Я", "изучаю", "JavaScript", "прямо", "сейчас"];
	arr.splice(0, 3, "Давай", "танцевать"); // удалить 3 первых элемента и заменить их другими
	alert( arr ) // теперь ["Давай", "танцевать", "прямо", "сейчас"]
Здесь видно, что splice возвращает массив из удалённых элементов:
	let arr = ["Я", "изучаю", "JavaScript", "прямо", "сейчас"];
	let removed = arr.splice(0, 2); // удалить 2 первых элемента
	alert( removed ); // "Я", "изучаю" <-- массив из удалённых элементов
Метод splice также может вставлять элементы без удаления, для этого достаточно установить deleteCount в 0:
	let arr = ["Я", "изучаю", "JavaScript"];
	arr.splice(2, 0, "сложный", "язык"); // с индекса 2 удалить 0 элементов, и вставить "сложный", "язык"
	alert( arr ); // "Я", "изучаю", "сложный", "язык", "JavaScript"

Отрицательные индексы разрешены.
В этом и в других методах массива допускается использование отрицательных индексов. Они определяют позицию с конца массива, как тут:
	let arr = [1, 2, 5];
	arr.splice(-1, 0, 3, 4); // начиная с индекса -1 (перед последним элементом) удалить 0 элементов, затем вставить числа 3 и 4
	alert( arr ); // 1,2,3,4,5

slice().
Метод arr.slice намного проще, чем похожий на него arr.splice.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/slice']
Синтаксис:
	arr.slice([start], [end])
Он возвращает новый массив, в который копирует все элементы с индекса start до end (не включая end). start и end могут быть отрицательными, в этом случае отсчёт позиции будет вестись с конца массива.
Это похоже на строковый метод str.slice, но вместо подстрок возвращает подмассивы.
Например:
	let arr = ["t", "e", "s", "t"];
	alert( arr.slice(1, 3) ); // e,s (копирует с 1 до 3)
	alert( arr.slice(-2) ); // s,t (копирует с -2 до конца)
Можно вызвать slice без аргументов: arr.slice() создаёт копию arr. Это часто используют, чтобы создать копию массива для дальнейших преобразований, которые не должны менять исходный массив.

concat().
Метод arr.concat создаёт новый массив, в который копирует данные из других массивов и дополнительные значения.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/concat']
Синтаксис:
	arr.concat(arg1, arg2...)
Он принимает любое количество аргументов, которые могут быть как массивами, так и простыми значениями.
В результате – новый массив, включающий в себя элементы из arr, затем arg1, arg2 и так далее.
Если аргумент argN – массив, то копируются все его элементы. Иначе копируется сам аргумент.
Например:
	let arr = [1, 2];
	// создать массив из: arr и [3,4]
	alert( arr.concat([3, 4]) ); // 1,2,3,4
	// создать массив из: arr и [3,4] и [5,6]
	alert( arr.concat([3, 4], [5, 6]) ); // 1,2,3,4,5,6
	// создать массив из: arr и [3,4], потом добавить значения 5 и 6
	alert( arr.concat([3, 4], 5, 6) ); // 1,2,3,4,5,6
Обычно он копирует только элементы из массивов. Другие объекты, даже если они выглядят как массивы, добавляются как есть:
	let arr = [1, 2];
	let arrayLike = {
		0: "что-то",
		length: 1
	};
	alert( arr.concat(arrayLike) ); // 1,2,[object Object]
…Но если массивоподобный объект имеет специальное свойство Symbol.isConcatSpreadable, то он обрабатывается как массив, с помощью concat: вместо него добавляются его элементы:
	let arr = [1, 2];
	let arrayLike = {
		0: "что-то",
		1: "ещё",
		[Symbol.isConcatSpreadable]: true,
		length: 2
	};
	alert( arr.concat(arrayLike) ); // 1,2,что-то,ещё

Перебор: forEach().
Метод arr.forEach позволяет запускать функцию для каждого элемента массива.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/forEach']
Синтаксис:
	arr.forEach(function(item, index, array) {/*... делать что-то с item */});
Например, этот код выведет на экран каждый элемент массива:
	["Бильбо", "Гэндальф", "Назгул"].forEach(alert); // Вызов alert для каждого элемента
А этот вдобавок расскажет и о позиции элемента в целевом массиве:
	["Бильбо", "Гэндальф", "Назгул"].forEach((item, index, array) => {
		alert(`У ${item} индекс ${index} в ${array}`);
	});
Результат функции (если она что-то возвращает) отбрасывается и игнорируется.

Поиск в массиве.
Теперь рассмотрим методы поиска в массиве.

indexOf/lastIndexOf и includes.
У методов arr.indexOf и arr.includes одинаковый синтаксис и они делают по сути то же самое, что и их строковые аналоги, но работают с элементами вместо символов:
	arr.indexOf(item, from); // ищет item начиная с индекса from и возвращает номер индекса, на котором был найден искомый элемент, в противном случае -1.
	arr.includes(item, from); // ищет item начиная с индекса from и возвращает true, если поиск успешен.
Обычно эти методы используются только с одним аргументом: искомым item. По умолчанию поиск ведется с начала.
Например:
	let arr = [1, 0, false];
	alert( arr.indexOf(0) ); // 1
	alert( arr.indexOf(false) ); // 2
	alert( arr.indexOf(null) ); // -1
	alert( arr.includes(1) ); // true
Пожалуйста, обратите внимание, что методы используют строгое сравнение ===. Таким образом, если мы ищем false, он находит именно false, а не ноль.
Если мы хотим проверить наличие элемента в массиве и нет необходимости знать его индекс, предпочтительно использовать arr.includes.
Метод arr.lastIndexOf похож на indexOf, но ищет справа налево.
	let fruits = ['Яблоко', 'Апельсин', 'Яблоко']
	alert( fruits.indexOf('Яблоко') ); // 0 (первый 'Яблоко')
	alert( fruits.lastIndexOf('Яблоко') ); // 2 (последний 'Яблоко')

Метод includes правильно обрабатывает NaN.
Незначительная, но заслуживающая внимания особенность includes – он правильно обрабатывает NaN, в отличие от indexOf:
	const arr = [NaN];
	alert( arr.indexOf(NaN) ); // -1 (неверно, должен быть 0)
	alert( arr.includes(NaN) );// true (верно)
Это связано с тем, что includes был добавлен в JS гораздо позже и использует более современный алгоритм сравнения.

find и findIndex/findLastIndex.
Представьте, что у нас есть массив объектов. Как нам найти объект с определённым условием?
Здесь пригодится метод arr.find.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/find']
Синтаксис:
	let result = arr.find(function(item, index, array) {
		// если true - возвращается текущий элемент и перебор прерывается
		// если все итерации оказались ложными, возвращается undefined
	});
Функция вызывается по очереди для каждого элемента массива:
	item – очередной элемент.
	index – его индекс.
	array – сам массив.
Если функция возвращает true, поиск прерывается и возвращается item. Если ничего не найдено, возвращается undefined.
Например, у нас есть массив пользователей, каждый из которых имеет поля id и name. Найдем пользователя с id == 1:
	let users = [{id: 1, name: "Вася"}, {id: 2, name: "Петя"}, {id: 3, name: "Маша"}];
	let user = users.find(item => item.id == 1);
	alert(user.name); // Вася
В реальной жизни массивы объектов – обычное дело, поэтому метод find крайне полезен.
Обратите внимание, что в данном примере мы передаём find функцию item => item.id == 1 с одним аргументом. Это типично, другие аргументы этой функции используются редко.
У метода arr.findIndex такой же синтаксис, но он возвращает индекс, на котором был найден элемент, а не сам элемент. Значение -1 возвращается, если ничего не найдено. ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/findIndex']
Метод arr.findLastIndex похож на findIndex, но ищет справа налево, наподобие lastIndexOf.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/findLastIndex']
Например:
	let users = [{id: 1, name: "Вася"}, {id: 2, name: "Петя"}, {id: 3, name: "Маша"}, {id: 4, name: "Вася"}];
	// Найти индекс первого Васи
	alert(users.findIndex(user => user.name == 'Вася')); // 0
	// Найти индекс последнего Васи
	alert(users.findLastIndex(user => user.name == 'Вася')); // 3

filter().
Метод find ищет один (первый) элемент, который заставит функцию вернуть true.
Если найденных элементов может быть много, можно использовать arr.filter(fn).
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/filter']
Синтаксис схож с find, но filter возвращает массив из всех подходящих элементов:
	let results = arr.filter(function(item, index, array) {
		// если `true` -- элемент добавляется к results и перебор продолжается
		// возвращается пустой массив в случае, если ничего не найдено
	});
Например:
	let users = [{id: 1, name: "Вася"}, {id: 2, name: "Петя"}, {id: 3, name: "Маша"}];
	let someUsers = users.filter(item => item.id < 3); // возвращает массив, состоящий из двух первых пользователей
	alert(someUsers.length); // 2

Преобразование массива.
Перейдём к методам преобразования и упорядочения массива.

map().
Метод arr.map является одним из наиболее полезных и часто используемых.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/map']
Он вызывает функцию для каждого элемента массива и возвращает массив результатов выполнения этой функции.
Синтаксис:
	let result = arr.map(function(item, index, array) {/* возвращается новое значение вместо элемента */});
Например, здесь мы преобразуем каждый элемент в его длину:
	let lengths = ["Бильбо", "Гэндальф", "Назгул"].map(item => item.length);
	alert(lengths); // 6,8,6

sort(fn).
Вызов arr.sort() сортирует массив на месте, меняя в нём порядок элементов.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/sort']
Он также возвращает отсортированный массив, но обычно возвращаемое значение игнорируется, так как изменяется сам arr.
Например:
	let arr = [ 1, 2, 15 ];
	arr.sort(); // метод сортирует содержимое arr
	alert( arr );  // 1, 15, 2
Не заметили ничего странного в этом примере? Порядок стал 1, 15, 2. Это неправильно. Но почему? По умолчанию элементы сортируются как строки. Буквально, элементы преобразуются в строки при сравнении. Для строк применяется лексикографический порядок, и действительно выходит, что "2" > "15".
Чтобы использовать наш собственный порядок сортировки, нам нужно предоставить функцию в качестве аргумента arr.sort().
Функция должна для пары значений возвращать:
	function compare(a, b) {
		if (a > b) return 1; // если первое значение больше второго
		if (a == b) return 0; // если равны
		if (a < b) return -1; // если первое значение меньше второго
	}
Например, для сортировки чисел:
	function compareNumeric(a, b) {
		if (a > b) return 1;
		if (a == b) return 0;
		if (a < b) return -1;
	}
	let arr = [ 1, 2, 15 ];
	arr.sort(compareNumeric);
	alert(arr);  // 1, 2, 15
Теперь всё работает как надо.
Сделаем отступление и подумаем, что происходит. arr может быть массивом чего угодно, верно? Он может содержать числа, строки, объекты или что-то ещё. У нас есть набор каких-то элементов. Чтобы отсортировать его, нам нужна упорядочивающая функция, которая знает, как сравнивать его элементы. По умолчанию элементы сортируются как строки.
Метод arr.sort(fn) реализует общий алгоритм сортировки. Нам не нужно заботиться о том, как он работает внутри (в большинстве случаев это оптимизированная быстрая сортировка ['https://ru.wikipedia.org/wiki/Быстрая_сортировка'] или Timsort ['https://ru.wikipedia.org/wiki/Timsort']). Она проходится по массиву, сравнивает его элементы с помощью предоставленной функции и переупорядочивает их. Всё, что нам нужно, – предоставить fn, которая делает сравнение.
Кстати, если мы когда-нибудь захотим узнать, какие элементы сравниваются – ничто не мешает нам вывести их на экран:
	[1, -2, 15, 2, 0, 8].sort(function(a, b) {
		alert( a + " <> " + b );
		return a - b;
	});
В процессе работы алгоритм может сравнивать элемент со множеством других, но он старается сделать как можно меньше сравнений.

Функция сравнения может вернуть любое число.
На самом деле от функции сравнения требуется любое положительное число, чтобы сказать "больше", и отрицательное число, чтобы сказать "меньше".
Это позволяет писать более короткие функции:
	let arr = [ 1, 2, 15 ];
	arr.sort(function(a, b) { return a - b; });
	alert(arr);  // 1, 2, 15

Лучше использовать стрелочные функции.
Помните стрелочные функции? Можно использовать их здесь для того, чтобы сортировка выглядела более аккуратной:
	arr.sort( (a, b) => a - b );
Будет работать точно так же, как и более длинная версия выше.

Используйте localeCompare для строк.
Помните алгоритм сравнения строк? По умолчанию, он сравнивает буквы по их кодам.
Для многих алфавитов лучше использовать метод str.localeCompare, для правильной сортировки букв, таких как Ö.
Например, отсортируем несколько стран на немецком языке:
	let countries = ['Österreich', 'Andorra', 'Vietnam'];
	alert( countries.sort( (a, b) => a > b ? 1 : -1) ); // Andorra, Vietnam, Österreich (неправильно)
	alert( countries.sort( (a, b) => a.localeCompare(b) ) ); // Andorra,Österreich,Vietnam (правильно!)

reverse().
Метод arr.reverse() меняет порядок элементов в arr на обратный.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/reverse']
Например:
	let arr = [1, 2, 3, 4, 5];
	arr.reverse();
	alert( arr ); // 5,4,3,2,1
Он также возвращает массив arr с изменённым порядком элементов.

split и join.
Ситуация из реальной жизни. Мы пишем приложение для обмена сообщениями, и посетитель вводит имена тех, кому его отправить, через запятую: Вася, Петя, Маша. Но нам-то гораздо удобнее работать с массивом имён, чем с одной строкой. Как его получить?
Метод str.split(delim) именно это и делает ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/split']. Он разбивает строку на массив по заданному разделителю delim.
В примере ниже таким разделителем является строка из запятой и пробела.
	let names = 'Вася, Петя, Маша';
	let arr = names.split(', ');
	for (let name of arr) {
		alert( `Сообщение получат: ${name}.` ); // Сообщение получат: Вася (и другие имена)
	}
У метода split есть необязательный второй числовой аргумент – ограничение на количество элементов в массиве. Если их больше, чем указано, то остаток массива будет отброшен. На практике это редко используется:
	let arr = 'Вася, Петя, Маша, Саша'.split(', ', 2);
	alert(arr); // Вася, Петя

Разбивка по буквам.
Вызов split(s) с пустым аргументом s разбил бы строку на массив букв:
	let str = "тест";
	alert( str.split('') ); // т,е,с,т

Вызов arr.join(glue) делает в точности противоположное split. Он создаёт строку из элементов arr, вставляя glue между ними.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/join']
Например:
	let arr = ['Вася', 'Петя', 'Маша'];
	let str = arr.join(';'); // объединить массив в строку через ;
	alert( str ); // Вася;Петя;Маша

reduce/reduceRight.
Когда нам нужно перебрать массив – мы можем использовать forEach, for или for..of.
Когда нам нужно перебрать массив и вернуть данные для каждого элемента – мы можем использовать map.
Методы arr.reduce ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/reduce'] и arr.reduceRight ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/reduceRight'] похожи на методы выше, но они немного сложнее. Они используются для вычисления единого значения на основе всего массива.
Синтаксис:
	let value = arr.reduce(function(accumulator, item, index, array) {/* ... */}, [initial]);
Функция применяется по очереди ко всем элементам массива и "переносит" свой результат на следующий вызов.
Аргументы:
	accumulator – результат предыдущего вызова этой функции, равен initial при первом вызове (если передан initial),
	item – очередной элемент массива,
	index – его позиция,
	array – сам массив.
При вызове функции результат её предыдущего вызова передаётся на следующий вызов в качестве первого аргумента.
Так, первый аргумент является по сути аккумулятором, который хранит объединённый результат всех предыдущих вызовов функции. По окончании он становится результатом reduce.
Этот метод проще всего понять на примере.
Тут мы получим сумму всех элементов массива одной строкой:
	let arr = [1, 2, 3, 4, 5];
	let result = arr.reduce((sum, current) => sum + current, 0);
	alert(result); // 15
Функция, переданная в reduce, использует только два аргумента, этого обычно достаточно.
Разберём детально как это работает.
	1. При первом запуске sum равен initial (последний аргумент reduce), то есть 0, а current – первый элемент массива, равный 1. Таким образом, результат функции равен 1.
	2. При втором запуске sum = 1, к нему мы добавляем второй элемент массива (2) и возвращаем.
	3. При третьем запуске sum = 3, к которому мы добавляем следующий элемент, и так далее…
Поток вычислений получается такой - в виде таблицы, где каждая строка показывает вызов функции на очередном элементе массива:
					sum	current	result
	первый вызов	0	1		1
	второй вызов	1	2		3
	третий вызов	3	3		6
	четвёртый вызов	6	4		10
	пятый вызов		10	5		15
Здесь отчётливо видно, как результат предыдущего вызова передаётся в первый аргумент следующего.
Мы также можем опустить начальное значение:
	let arr = [1, 2, 3, 4, 5];
	let result = arr.reduce((sum, current) => sum + current); // убрано начальное значение (нет 0 в конце)
	alert( result ); // 15
Результат – точно такой же! Это потому, что при отсутствии initial в качестве первого значения берётся первый элемент массива, а перебор стартует со второго. Таблица вычислений будет такая же за вычетом первой строки.
Но такое использование требует крайней осторожности. Если массив пуст, то вызов reduce без начального значения выдаст ошибку.
Вот пример:
	let arr = [];
	// Error: Reduce of empty array with no initial value
	// если бы существовало начальное значение, reduce вернул бы его для пустого массива.
	arr.reduce((sum, current) => sum + current);
Поэтому рекомендуется всегда указывать начальное значение.
Метод arr.reduceRight работает аналогично, но проходит по массиву справа налево.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/reduceRight']

Array.isArray.
Массивы не образуют отдельный тип данных. Они основаны на объектах.
Поэтому typeof не может отличить простой объект от массива:
	alert(typeof {}); // object
	alert(typeof []); // тоже object
…Но массивы используются настолько часто, что для этого придумали специальный метод: 
	Array.isArray(value); // возвращает true, если value массив, и false, если нет.
например:
	alert(Array.isArray({})); // false
	alert(Array.isArray([])); // true

Большинство методов поддерживают thisArg.
Почти все методы массива, которые вызывают функции – такие как find, filter, map, за исключением метода sort, принимают необязательный параметр thisArg. Этот параметр не объяснялся выше, так как очень редко используется, но для наиболее полного понимания темы мы обязаны его рассмотреть.
Вот полный синтаксис этих методов:
	arr.find(func, thisArg);
	arr.filter(func, thisArg);
	arr.map(func, thisArg);
	// thisArg -- необязательный последний аргумент
Значение параметра thisArg становится this для func.
Например, тут мы используем метод объекта army как фильтр, и thisArg передаёт ему контекст:
	let army = {
		minAge: 18, maxAge: 27,
		canJoin(user) {
			return user.age >= this.minAge && user.age < this.maxAge;
		}
	};
	let users = [{age: 16}, {age: 20}, {age: 23}, {age: 30}];
	let soldiers = users.filter(army.canJoin, army); // найти пользователей, для которых army.canJoin возвращает true
	alert(soldiers.length); // 2
	alert(soldiers[0].age); // 20
	alert(soldiers[1].age); // 23
Если бы мы в примере выше использовали просто users.filter(army.canJoin), то вызов army.canJoin был бы в режиме отдельной функции, с this=undefined. Это тут же привело бы к ошибке.
Вызов users.filter(army.canJoin, army) можно заменить на users.filter(user => army.canJoin(user)), который делает то же самое. Последняя запись используется даже чаще, так как функция-стрелка более наглядна.

Итого:
Шпаргалка по методам массива:
Для добавления/удаления элементов:
	push(...items) – добавляет элементы в конец,
	pop() – извлекает элемент с конца,
	shift() – извлекает элемент с начала,
	unshift(...items) – добавляет элементы в начало.
	splice(pos, deleteCount, ...items) – начиная с индекса pos удаляет deleteCount элементов и вставляет items.
	slice(start, end) – создаёт новый массив, копируя в него элементы с индекса start до end (не включая end).
	concat(...items) – возвращает новый массив: копирует все члены текущего массива и добавляет к нему items. Если какой-то из items является массивом, тогда берутся его элементы.
Для поиска среди элементов:
	indexOf/lastIndexOf(item, pos) – ищет item, начиная с позиции pos, и возвращает его индекс или -1, если ничего не найдено.
	includes(value) – возвращает true, если в массиве имеется элемент value, в противном случае false.
	find/filter(func) – фильтрует элементы через функцию и отдаёт первое/все значения, при прохождении которых через функцию возвращается true.
	findIndex похож на find, но возвращает индекс вместо значения.
Для перебора элементов:
	forEach(func) – вызывает func для каждого элемента. Ничего не возвращает.
Для преобразования массива:
	map(func) – создаёт новый массив из результатов вызова func для каждого элемента.
	sort(func) – сортирует массив «на месте», а потом возвращает его.
	reverse() – «на месте» меняет порядок следования элементов на противоположный и возвращает изменённый массив.
	split/join – преобразует строку в массив и обратно.
	reduce/reduceRight(func, initial) – вычисляет одно значение на основе всего массива, вызывая func для каждого элемента и передавая промежуточный результат между вызовами.
Дополнительно:
	Array.isArray(arr) проверяет, является ли arr массивом.
Пожалуйста, обратите внимание, что методы push, pop, shift, unshift, sort, reverse и splice изменяют исходный массив.
Эти методы – самые используемые, их достаточно в 99% случаев. Но существуют и другие:

arr.some(fn)/arr.every(fn) проверяет массив.
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/some']
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/every']
	Функция fn вызывается для каждого элемента массива аналогично map. Если какие-либо/все результаты вызовов являются true, то метод возвращает true, иначе false.
	Эти методы ведут себя примерно так же, как операторы || и &&: если fn возвращает истинное значение, arr.some() немедленно возвращает true и останавливает перебор остальных элементов; если fn возвращает ложное значение, arr.every() немедленно возвращает false и также прекращает перебор остальных элементов.
	Мы можем использовать every для сравнения массивов:
		function arraysEqual(arr1, arr2) {
			return arr1.length === arr2.length && arr1.every((value, index) => value === arr2[index]);
		}
		alert( arraysEqual([1, 2], [1, 2])); // true
arr.fill(value, start, end) – заполняет массив повторяющимися value, начиная с индекса start до end.
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/fill']
arr.copyWithin(target, start, end) – копирует свои элементы, начиная с позиции start и заканчивая end, в себя, на позицию target (перезаписывая существующие).
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/copyWithin']
arr.flat(depth)/arr.flatMap(fn) создаёт новый плоский массив из многомерного массива.
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/flat']
	['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/flatMap']

Полный список есть в справочнике MDN ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array'].
На первый взгляд может показаться, что существует очень много разных методов, которые довольно сложно запомнить. Но это гораздо проще, чем кажется. Внимательно изучите шпаргалку, представленную выше, а затем, чтобы попрактиковаться, решите задачи, предложенные в данной главе. Так вы получите необходимый опыт в правильном использовании методов массива.
Всякий раз, когда вам будет необходимо что-то сделать с массивом, а вы не знаете, как это сделать – приходите сюда, смотрите на таблицу и ищите правильный метод. Примеры помогут вам всё сделать правильно, и вскоре вы быстро запомните методы без особых усилий.

Задачи: 1+- 2+- 3+- 4+ 5+- 6--+ 7+- 8+- 9++ 10- 11+- 12- 13-
1. Переведите текст вида border-left-width в borderLeftWidth (важность: 5)
Напишите функцию camelize(str), которая преобразует строки вида "my-short-string" в "myShortString".
То есть дефисы удаляются, а все слова после них получают заглавную букву.
Примеры:
	camelize("background-color") == 'backgroundColor';
	camelize("list-style-image") == 'listStyleImage';
	camelize("-webkit-transition") == 'WebkitTransition';
P.S. Подсказка: используйте split, чтобы разбить строку на массив символов, потом переделайте всё как нужно и методом join соедините обратно.
решение:
	function camelize(str){ // моё
		let arr = str.split('-');
		let first = arr.shift();
		let arr1 = arr.map((word) => ucFirst(word));
		str = arr1.join('');
		return first + str;
	};
	function ucFirst(str){
		if (!str) return str;
		return str[0].toUpperCase() + str.slice(1);
	};
	function camelize(str) { // из учебника
		return str
			.split('-') // разбивает 'my-long-word' на массив ['my', 'long', 'word']
			.map((word, index) => index == 0 ? word : word[0].toUpperCase() + word.slice(1)) // Переводит в верхний регистр первые буквы всех элементом массива за исключением первого;
			.join(''); // соединяет ['my', 'Long', 'Word'] в 'myLongWord'
	}
	console.log(camelize("background-color")); // 'backgroundColor';
	console.log(camelize("list-style-image")); // 'listStyleImage';
	console.log(camelize("-webkit-transition")); // 'WebkitTransition';

2. Фильтрация по диапазону (важность: 4)
Напишите функцию filterRange(arr, a, b), которая принимает массив arr, ищет элементы со значениями больше или равными a и меньше или равными b и возвращает результат в виде массива.
Функция должна возвращать новый массив и не изменять исходный.
Например:
	let arr = [5, 3, 8, 1];
	let filtered = filterRange(arr, 1, 4);
	alert( filtered ); // 3,1 (совпадающие значения)
	alert( arr ); // 5,3,8,1 (без изменений)
решение:
	function filterRange(arr, a, b){ // моя
		let arr2 = [...arr];
		arr2.map((value, index) => {
			if (value < a || value > b) arr2.splice(index, 1);
		});
		return arr2;
	}
	function filterRange2(arr, a, b) { // учебник
		return arr.filter(item => (a <= item && item <= b));
	}
	arr = [5, 3, 8, 1];
	let filtered = filterRange2(arr, 1, 4);
	console.log( filtered ); // 3,1 (совпадающие значения)
	console.log( arr ); // 5,3,8,1 (без изменений)
3. Фильтрация по диапазону "на месте" (важность: 4)
Напишите функцию filterRangeInPlace(arr, a, b), которая принимает массив arr и удаляет из него все значения кроме тех, которые находятся между a и b. То есть, проверка имеет вид a ≤ arr[i] ≤ b.
Функция должна изменять принимаемый массив и ничего не возвращать.
Например:
	let arr = [5, 3, 8, 1];
	filterRangeInPlace(arr, 1, 4); // удалены числа вне диапазона 1..4
	alert( arr ); // [3, 1]
решение:
	function filterRangeInPlace(arr, a, b){ // моя
		arr.map((item, index) => {
			if (item < a || item > b) arr.splice(index, 1);
		});
	}
	function filterRangeInPlace1(arr, a, b) { // учебник
		for (let i = 0; i < arr.length; i++) {
			let val = arr[i];
			if (val < a || val > b) {
				arr.splice(i, 1); // удалить, если за пределами интервала
				i--;
			}
		}
	}
	arr = [5, 3, 8, 1];
	filterRangeInPlace1(arr, 1, 4); // удалены числа вне диапазона 1..4
	console.log(arr); // [3, 1]
4. Сортировать в порядке по убыванию (важность: 4)
	let arr = [5, 2, 1, -10, 8];
	// ... ваш код для сортировки по убыванию
	console.log( arr ); // 8, 5, 2, 1, -10
решение:
	arr = [5, 2, 1, -10, 8];
	arr.sort((a, b) => b - a);
	console.log(arr); // 8, 5, 2, 1, -10
5. Скопировать и отсортировать массив (важность: 5)
У нас есть массив строк arr. Нужно получить отсортированную копию, но оставить arr неизменённым.
Создайте функцию copySorted(arr), которая будет возвращать такую копию.
	let arr = ["HTML", "JavaScript", "CSS"];
	let sorted = copySorted(arr);
	alert( sorted ); // CSS, HTML, JavaScript
	alert( arr ); // HTML, JavaScript, CSS (без изменений)
решение:
	function copySorted(arr){ // моя
		let arr2 = [...arr];
		// return arr2.sort((a, b) => a.localeCompare(b));
		return arr2.sort();
	}
	function copySorted2(arr) { // учебник
		return arr.slice().sort(); // для копирования массива используем slice()
	}
	arr = ["HTML", "JavaScript", "CSS"];
	let sorted = copySorted(arr);
	console.log(sorted); // CSS, HTML, JavaScript
	console.log(arr); // HTML, JavaScript, CSS (без изменений)

6. Создать расширяемый калькулятор (важность: 5)
Создайте функцию конструктор Calculator, которая создаёт "расширяемые" объекты калькулятора.
Задание состоит из двух частей.
Во-первых, реализуйте метод calculate(str), который принимает строку типа "1 + 2" в формате «ЧИСЛО оператор ЧИСЛО» (разделено пробелами) и возвращает результат. Метод должен понимать плюс + и минус -.
Пример использования:
	let calc = new Calculator;
	alert( calc.calculate("3 + 7") ); // 10
Затем добавьте метод addMethod(name, func), который добавляет в калькулятор новые операции. Он принимает оператор name и функцию с двумя аргументами func(a,b), которая описывает его.
Например, давайте добавим умножение *, деление / и возведение в степень **:
	let powerCalc = new Calculator;
	powerCalc.addMethod("*", (a, b) => a * b);
	powerCalc.addMethod("/", (a, b) => a / b);
	powerCalc.addMethod("**", (a, b) => a ** b);
	let result = powerCalc.calculate("2 ** 3");
	alert( result ); // 8
Для этой задачи не нужны скобки или сложные выражения.
Числа и оператор разделены ровно одним пробелом.
Не лишним будет добавить обработку ошибок.
решение:
	function Calculator() {
		this.methods = {
			'+': (a, b) => a + b,
			'-': (a, b) => a - b
		};
		this.calculate = function(str) {
			let arr = str.split(' '), a = +arr[0], b = +arr[2], op = arr[1];
			if (!this.methods[op] || isNaN(a) || isNaN(b)) return NaN;
			return this.methods[op](a, b);
		}
		this.addMethod = function(name, func){
			this.methods[name] = func;
		}
	}
	// Обратите внимание, как хранятся методы. Они просто добавляются к внутреннему объекту.
	// Все тесты и числовые преобразования выполняются в методе calculate. В будущем он может быть расширен для поддержки более сложных выражений.
	calc = new Calculator;
	console.log(calc.calculate("3 + 7")); // 10
	let powerCalc = new Calculator;
	powerCalc.addMethod("*", (a, b) => a * b);
	powerCalc.addMethod("/", (a, b) => a / b);
	powerCalc.addMethod("**", (a, b) => a ** b);
	let result = powerCalc.calculate("2 ** 3");
	console.log( result ); // 8

7. Трансформировать в массив имён (важность: 5)
У вас есть массив объектов user, и в каждом из них есть user.name. Напишите код, который преобразует их в массив имён.
Например:
	let vasya = { name: "Вася", age: 25 };
	let petya = { name: "Петя", age: 30 };
	let masha = { name: "Маша", age: 28 };
	let users = [ vasya, petya, masha ];
	let names = /* ... ваш код */
	alert( names ); // Вася, Петя, Маша
решение:
	let vasya = { name: "Вася", age: 25 };
	let petya = { name: "Петя", age: 30 };
	let masha = { name: "Маша", age: 28 };
	let users = [ vasya, petya, masha ];
	// let names = [];
	// for (let nameObj of users) names.push(nameObj.name); // моё
	let names = users.map(item => item.name); // из учебника
	console.log( names ); // Вася, Петя, Маша

8. Трансформировать в объекты (важность: 5)
У вас есть массив объектов user, и у каждого из объектов есть name, surname и id.
Напишите код, который создаст ещё один массив объектов с параметрами id и fullName, где fullName – состоит из name и surname.
Например:
	let vasya = { name: "Вася", surname: "Пупкин", id: 1 };
	let petya = { name: "Петя", surname: "Иванов", id: 2 };
	let masha = { name: "Маша", surname: "Петрова", id: 3 };
	let users = [ vasya, petya, masha ];
	let usersMapped = /* ... ваш код ... */
	/** usersMapped = [
		{ fullName: "Вася Пупкин", id: 1 },
		{ fullName: "Петя Иванов", id: 2 },
		{ fullName: "Маша Петрова", id: 3 }
	]*/
	alert( usersMapped[0].id ) // 1
	alert( usersMapped[0].fullName ) // Вася Пупкин
Итак, на самом деле вам нужно трансформировать один массив объектов в другой. Попробуйте использовать =>. Это небольшая уловка.
решение (1):
	vasya = { name: "Вася", surname: "Пупкин", id: 1 };
	petya = { name: "Петя", surname: "Иванов", id: 2 };
	masha = { name: "Маша", surname: "Петрова", id: 3 };
	users = [ vasya, petya, masha ];
	/** usersMapped = [
		{ fullName: "Вася Пупкин", id: 1 },
		{ fullName: "Петя Иванов", id: 2 },
		{ fullName: "Маша Петрова", id: 3 }
	]*/
	// моё
	let usersMapped = [...users];
	usersMapped.map(item => item.fullName = item.name + ' ' + item.surname);
	// из учебника
	let usersMapped = users.map(user => ({ // из учебника
		fullName: `${user.name} ${user.surname}`,
		id: user.id
	}));
	console.log( usersMapped[0].id ) // 1
	console.log( usersMapped[0].fullName ) // Вася Пупкин
	/**Обратите внимание, что для стрелочных функций мы должны использовать дополнительные скобки.
	Мы не можем написать вот так:
		let usersMapped = users.map(user => {
			fullName: `${user.name} ${user.surname}`,
			id: user.id
		});
	Как мы помним, есть две функции со стрелками: без тела value => expr и с телом value => {...}.
	Здесь JS будет трактовать { как начало тела функции, а не начало объекта. Чтобы обойти это, нужно заключить их в «нормальные» скобки:
		let usersMapped = users.map(user => ({
			fullName: `${user.name} ${user.surname}`,
			id: user.id
		}));*/

9. Отсортировать пользователей по возрасту (важность: 5)
Напишите функцию sortByAge(users), которая принимает массив объектов со свойством age и сортирует их по нему.
Например:
	let vasya = { name: "Вася", age: 25 };
	let petya = { name: "Петя", age: 30 };
	let masha = { name: "Маша", age: 28 };
	let arr = [ vasya, petya, masha ];
	sortByAge(arr); // теперь: [vasya, masha, petya]
	alert(arr[0].name); // Вася
	alert(arr[1].name); // Маша
	alert(arr[2].name); // Петя
решение:
	function sortByAge(users){
		users.sort((a, b) => a.age - b.age);
	}
	vasya = { name: "Вася", age: 25 };
	petya = { name: "Петя", age: 30 };
	masha = { name: "Маша", age: 28 };
	arr = [ vasya, petya, masha ];
	sortByAge(arr); // теперь: [vasya, masha, petya]
	console.log(arr[0].name); // Вася
	console.log(arr[1].name); // Маша
	console.log(arr[2].name); // Петя

10. Перемешайте массив (важность: 3)
Напишите функцию shuffle(array), которая перемешивает (переупорядочивает случайным образом) элементы массива.
Многократные прогоны через shuffle могут привести к разным последовательностям элементов. Например:
	let arr = [1, 2, 3];
	shuffle(arr); // arr = [3, 2, 1]
	shuffle(arr); // arr = [2, 1, 3]
	shuffle(arr); // arr = [3, 1, 2]
	// ...
Все последовательности элементов должны иметь одинаковую вероятность. Например, [1,2,3] может быть переупорядочено как [1,2,3] или [1,3,2], или [3,1,2] и т.д., с равной вероятностью каждого случая.
решение:
	Простым решением может быть:
		function shuffle(array) {
			array.sort(() => Math.random() - 0.5);
		}
		let arr = [1, 2, 3];
		shuffle(arr);
		alert(arr);
	Это, конечно, будет работать, потому что Math.random() - 0.5 отдаёт случайное число, которое может быть положительным или отрицательным, следовательно, функция сортировки меняет порядок элементов случайным образом.
	Но поскольку метод sort не предназначен для использования в таких случаях, не все возможные варианты имеют одинаковую вероятность.
	Например, рассмотрим код ниже. Он запускает shuffle 1000000 раз и считает вероятность появления для всех возможных вариантов arr:
		function shuffle(array) {
			array.sort(() => Math.random() - 0.5);
		}
		let count = {'123': 0, '132': 0, '213': 0, '231': 0, '321': 0, '312': 0	}; // подсчёт вероятности для всех возможных вариантов
		for (let i = 0; i < 1000000; i++) {
			let array = [1, 2, 3];
			shuffle(array);
			count[array.join('')]++;
		}
		for (let key in count) {alert(`${key}: ${count[key]}`)}; // показать количество всех возможных вариантов
	Результат примера (зависят от движка JS):
		123: 250706
		132: 124425
		213: 249618
		231: 124880
		312: 125148
		321: 125223
	Теперь мы отчётливо видим допущенное отклонение: 123 и 213 появляются намного чаще, чем остальные варианты.
	Результаты этого кода могут варьироваться при запуске на разных движках JS, но очевидно, что такой подход не надёжен.
	Так почему это не работает? Если говорить простыми словами, то sort это "чёрный ящик": мы бросаем в него массив и функцию сравнения, ожидая получить отсортированный массив. Но из-за абсолютной хаотичности сравнений чёрный ящик сходит с ума, и как именно он сходит с ума, зависит от конкретной его реализации, которая различна в разных движках JS.
	Есть и другие хорошие способы решить эту задачу. Например, есть отличный алгоритм под названием Тасование Фишера-Йетса. Суть заключается в том, чтобы проходить по массиву в обратном порядке и менять местами каждый элемент со случайным элементом, который находится перед ним.
		function shuffle(array) {
			for (let i = array.length - 1; i > 0; i--) {
				let j = Math.floor(Math.random() * (i + 1)); // случайный индекс от 0 до i
				// поменять элементы местами
				// мы используем для этого синтаксис "деструктурирующее присваивание"
				// то же самое можно записать как:
				// let t = array[i]; array[i] = array[j]; array[j] = t
				[array[i], array[j]] = [array[j], array[i]];
			}
		}
	Давайте проверим эту реализацию на том же примере:
		function shuffle(array) {
			for (let i = array.length - 1; i > 0; i--) {
				let j = Math.floor(Math.random() * (i + 1));
				[array[i], array[j]] = [array[j], array[i]];
			}
		}
		let count = {'123': 0, '132': 0, '213': 0, '231': 0, '321': 0, '312': 0}; // подсчёт вероятности для всех возможных вариантов
		for (let i = 0; i < 1000000; i++) {
			let array = [1, 2, 3];
			shuffle(array);
			count[array.join('')]++;
		}
		for (let key in count) {alert(`${key}: ${count[key]}`)}; // показать количество всех возможных вариантов
	Пример вывода:
		123: 166693
		132: 166647
		213: 166628
		231: 167517
		312: 166199
		321: 166316
	Теперь всё в порядке: все варианты появляются с одинаковой вероятностью.
	Кроме того, если посмотреть с точки зрения производительности, то алгоритм "Тасование Фишера-Йетса" намного быстрее, так как в нём нет лишних затрат на сортировку.
итого: 
	function shuffleFischer(array) {
		for (let i = array.length - 1; i > 0; i--) {
			let j = Math.floor(Math.random() * (i + 1));
			[array[i], array[j]] = [array[j], array[i]];
		}
		return array;
	}

11. Получить средний возраст (важность: 4)
Напишите функцию getAverageAge(users), которая принимает массив объектов со свойством age и возвращает средний возраст.
Формула вычисления среднего арифметического значения: (age1 + age2 + ... + ageN) / N.
Например:
	let vasya = { name: "Вася", age: 25 };
	let petya = { name: "Петя", age: 30 };
	let masha = { name: "Маша", age: 29 };
	let arr = [ vasya, petya, masha ];
	alert( getAverageAge(arr) ); // (25 + 30 + 29) / 3 = 28
решение:
	function getAverageAgeMy(users){
		let sumAges = 0, counter = 0;
		for (let user of users) {
			sumAges = sumAges + user.age;
			counter++;
		}
		return sumAges / counter;
	}
	function getAverageAge(users) {
		return users.reduce((prev, user) => prev + user.age, 0) / users.length;
	}
	vasya = { name: "Вася", age: 25 };
	petya = { name: "Петя", age: 30 };
	masha = { name: "Маша", age: 29 };
	arr = [ vasya, petya, masha ];
	console.log( getAverageAge(arr) ); // (25 + 30 + 29) / 3 = 28

12. Оставить уникальные элементы массива (важность: 4)
Пусть arr – массив строк.
Напишите функцию unique(arr), которая возвращает массив, содержащий только уникальные элементы arr.
Например:
	function unique(arr) {
		/* ваш код */
	}
	let strings = ["кришна", "кришна", "харе", "харе",
		"харе", "харе", "кришна", "кришна", ":-O"
	];
	alert( unique(strings) ); // кришна, харе, :-O
решение:
	function unique(arr){
		let result = [];
		for (let str of arr) {
			if (!result.includes(str)) result.push(str);
		}
		return result;
	}
	let strings = ["кришна", "кришна", "харе", "харе", "харе", "харе", "кришна", "кришна", ":-O"];
	console.log( unique(strings) ); // кришна, харе, :-O
	/**Для каждого элемента мы проверим, есть ли он в массиве с результатом.
	Если есть, то игнорируем его, а если нет – добавляем к результатам.
	Код работает, но в нём есть потенциальная проблема с производительностью.
	Метод result.includes(str) внутри себя обходит массив result и сравнивает каждый элемент с str, чтобы найти совпадение.
	Таким образом, если result содержит 100 элементов и ни один не совпадает со str, тогда он обойдёт весь result и сделает ровно 100 сравнений. А если result большой, например, 10000, то будет произведено 10000 сравнений.
	Само по себе это не проблема, потому что движки JS очень быстрые, поэтому обход 10000 элементов массива занимает считанные микросекунды.
	Но мы делаем такую проверку для каждого элемента arr в цикле for.
	Поэтому, если arr.length равен 10000, у нас будет что-то вроде 10000*10000 = 100 миллионов сравнений. Это многовато.
	Вот почему данное решение подходит только для небольших массивов.
	Далее в главе Map и Set мы увидим, как его оптимизировать.*/

13. Создайте объект с ключами из массива (важность: 4)
Допустим, мы получили массив пользователей в виде {id:..., name:..., age:... }.
Создайте функцию groupById(arr), которая создаст из него объект с id в качестве ключа и элементами массива в качестве значений.
Например:
	let users = [
		{id: 'john', name: "John Smith", age: 20},
		{id: 'ann', name: "Ann Smith", age: 24},
		{id: 'pete', name: "Pete Peterson", age: 31},
	];
	let usersById = groupById(users);
	/*после вызова у нас должно получиться:
	usersById = {
		john: {id: 'john', name: "John Smith", age: 20},
		ann: {id: 'ann', name: "Ann Smith", age: 24},
		pete: {id: 'pete', name: "Pete Peterson", age: 31},
	}*/
Такая функция очень удобна при работе с данными, которые приходят с сервера.
В этой задаче мы предполагаем, что id уникален. Не может быть двух элементов массива с одинаковым id.
Используйте метод .reduce в решении.
решение:
	function groupById(array) {
		return array.reduce((obj, value) => {
			obj[value.id] = value;
			return obj;
		}, {});
	}
	users = [
		{id: 'john', name: "John Smith", age: 20},
		{id: 'ann', name: "Ann Smith", age: 24},
		{id: 'pete', name: "Pete Peterson", age: 31},
	];
	let usersById = groupById(users);
	console.log(usersById); /*
	> {john: {…}, ann: {…}, pete: {…}}
		ann: {id: 'ann', name: 'Ann Smith', age: 24}
		john: {id: 'john', name: 'John Smith', age: 20}
		pete: {id: 'pete', name: 'Pete Peterson', age: 31}
		[[Prototype]]: Object*/

#1.5.6. Перебираемые объекты
18.12.24/10.3.25 Перебираемые (или итерируемые) объекты - https://learn.javascript.ru/iterable
Перебираемые (или итерируемые) объекты – это обобщение массивов, но есть и много других встроенных перебираемых объектов, например, строки.
Если объект не является массивом, но представляет собой коллекцию каких-то элементов (список, набор), то удобно использовать цикл for..of для их перебора
Перебираемые (или итерируемые) объекты – это объекты, которые реализуют метод Symbol.iterator, как описано ниже.
Псевдомассивы – это объекты, у которых есть индексы и свойство length, т.е. они выглядят как массивы.
// Например, строки итерируемы (для них работает for..of) и являются псевдомассивами (они индексированы и есть length).
// Итерируемый объект может не быть псевдомассивом. И наоборот: псевдомассив может быть неитерируемым.
// И итерируемые объекты, и псевдомассивы – это обычно не массивы.

Например, есть объект range, который представляет собой диапазон чисел:
let range = {from: 1, to: 5};
for (let num of range){console.log(num)}; // Uncaught TypeError: range[Symbol.iterator] is not a function
/** Чтобы сделать range итерируемым (и позволить for..of работать с ним), нам нужно добавить в объект метод с именем Symbol.iterator (специальный встроенный Symbol, созданный как раз для этого).
- Когда цикл for..of запускается, он вызывает этот метод один раз (или выдаёт ошибку, если метод не найден). Этот метод должен вернуть итератор – объект с методом next.
- Дальше for..of работает только с этим возвращённым объектом.
- Когда for..of хочет получить следующее значение, он вызывает метод next() этого объекта.
- Результат вызова next() должен иметь вид {done: Boolean, value: any}, где done=true означает, что цикл завершён, в противном случае value содержит очередное значение.*/

Вот полная реализация range с пояснениями:
let range = {from: 1, to: 5};
// 1. вызов for..of сначала вызывает эту функцию
range[Symbol.iterator] = function() { // возвращает объект итератора:
    // 2. Далее, for..of работает только с этим итератором, запрашивая у него новые значения
    return {
        current: this.from,
        last: this.to,
        next() { // 3. next() вызывается на каждой итерации цикла for..of
            // 4. он должен вернуть значение в виде объекта {done:.., value :...}
            if (this.current <= this.last) {
                return { done: false, value: this.current++ };
            } else {
                return { done: true };
            }
        }
    };
};
for (let num of range){console.log(num)}; // 1 2 3 4 5
// ключевую особенность итераторов: разделение ответственности. У самого range нет метода next(). Вместо этого другой объект, так называемый "итератор", создаётся вызовом range[Symbol.iterator](), и именно его next() генерирует значения.

// или:
let range = {
    from: 1,
    to: 5,
    [Symbol.iterator]() {
        this.current = this.from;
        return this;
    },
    next() {
        if (this.current <= this.to) {
            return { done: false, value: this.current++ };
        } else {
            return { done: true };
        }
    }
};
for (let num of range){console.log(num)}; // 1 2 3 4 5
// Теперь range[Symbol.iterator]() возвращает сам объект range: у него есть необходимый метод next(), и он запоминает текущее состояние итерации в this.current.
// Недостаток такого подхода в том, что теперь мы не можем использовать этот объект в двух параллельных циклах for..of: у них будет общее текущее состояние итерации, потому что теперь существует лишь один итератор – сам объект. Но необходимость в двух циклах for..of, выполняемых одновременно, возникает редко, даже при наличии асинхронных операций.

// цикл for..of может быть бесконечным (напр. если range.to = Infinity). Но мы всегда можем прервать его, используя break.

Строка также перебираемый (итерируемый) объект. Среди встроенных перебираемых объектов наиболее широко используются массивы и строки.
Строка - итерируемый псевдоиассив // строки итерируемы (для них работает for..of) и являются псевдомассивами (они индексированы и есть length).
	let str = 'some text';
	for (let char of str){console.log(char)};  // s o m e  t e x t
	for (let char of 'text'){console.log(char)};  // t e x t
И он работает корректно даже с суррогатными парами:
	let str = '𝒳😂';
	for (let char of str) {console.log(char)}; // 𝒳 😂

// цикл for...of вручную:
let iterator = str[Symbol.iterator]();
while (true) {
    let result = iterator.next();
    if (result.done) break;
    console.log(result.value); // выводит символы один за другим
}; // t e x t
// Такое редко бывает необходимо, но это даёт нам больше контроля над процессом, чем for..of. Например, мы можем разбить процесс итерации на части: перебрать немного элементов, затем остановиться, сделать что-то ещё и потом продолжить.

Итерируемые объекты и псевдомассивы.
Есть два официальных термина, которые очень похожи, но в то же время сильно различаются. Поэтому убедитесь, что вы как следует поняли их, чтобы избежать путаницы.
	- Итерируемые объекты – это объекты, которые реализуют метод Symbol.iterator, как было описано выше.
	- Псевдомассивы – это объекты, у которых есть индексы и свойство length, то есть, они выглядят как массивы.
При использовании JS в браузере или других окружениях мы можем встретить объекты, которые являются итерируемыми или псевдомассивами, или и тем, и другим.
Например, строки итерируемы (для них работает for..of) и являются псевдомассивами (они индексированы и есть length).
Но итерируемый объект может не быть псевдомассивом. И наоборот: псевдомассив может не быть итерируемым.
Например, объект range из примера выше – итерируемый, но не является псевдомассивом, потому что у него нет индексированных свойств и length.

Что у них общего? И итерируемые объекты, и псевдомассивы – это обычно не массивы, у них нет методов push, pop и т.д. Довольно неудобно, если у нас есть такой объект и мы хотим работать с ним как с массивом. Например, мы хотели бы работать с range, используя методы массивов. Как этого достичь?

Array.from().
Метод Array.from() принимает итерируемый объект или псевдомассив и делает из него настоящий Array. 
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array/from']
	let arrayLike = {0: "some", 1: "text", length: 2}; // неитерируемый псевдомассив
	let arr = Array.from(arrayLike); // функция принимает объект, проверяет, является ли он итерируемым объектом или псевдомассивом, затем создаёт новый массив и копирует туда все элементы.
	console.log(arr.pop()); // удаляет последний элемент массива, возвращая его как значение
// => text
	let arr1 = Array.from(range);
	console.log(arr1); // (5) [1, 2, 3, 4, 5]
Полный синтаксис Array.from позволяет указать необязательную трансформирующую функцию:
	Array.from(obj[, mapFn, thisArg]);
Необязательный второй аргумент (трансформирующая функция mapFn) может быть функцией, которая будет применена к каждому элементу перед добавлением в массив, а thisArg позволяет установить this для этой функции.
Например:
	// range взят из примера в начале статьи
	// возводим каждое число в квадрат
	let arr = Array.from(range, num => num * num);
	alert(arr); // 1,4,9,16,25
Здесь мы используем Array.from, чтобы превратить строку в массив её элементов:
	let str = '𝒳😂';
	let chars = Array.from(str); // разбивает строку на массив её элементов
	alert(chars[0]); // 𝒳
	alert(chars[1]); // 😂
	alert(chars.length); // 2
В отличие от str.split, этот метод в работе опирается на итерируемость строки, и поэтому, как и for..of, он корректно работает с суррогатными парами.
Технически это то же самое, что и:
	let str = '𝒳😂';
	let chars = [];
	for (let char of str) chars.push(char); // Array.from внутри себя выполняет тот же цикл
	alert(chars);
…Но гораздо короче.
Мы можем даже создать slice, который поддерживает суррогатные пары:
	function slice(str, start, end) {
		return Array.from(str).slice(start, end).join('');
	}
	let str = '𝒳😂𩷶';
	alert( slice(str, 1, 3) ); // 😂𩷶
	// а вот встроенный метод не поддерживает суррогатные пары
	alert( str.slice(1, 3) ); // мусор (две части различных суррогатных пар)
другие примеры:
	// возводим каждое число объекта в квадрат:
	let arr2 = Array.from(range, num => num * num);
	console.log(arr2); // (5) [1, 4, 9, 16, 25]

	// разбиваем строку на массив её элементов:
	let chars = Array.from(str);
	console.log(chars); // (4) ['t', 'e', 'x', 't']

	// перепишем метод slice():
	let str = 'text';
	function slice(str, start, end){
		return Array.from(str).slice(start, end).join('-');
	}
	console.log(slice(str, 0, 3)); // t-e-x
	console.log(slice(str)); // t-e-x-t
	console.log(slice('чтонибуть')); // ч-т-о-н-и-б-у-т-ь

	// суррогатные пары:
	str = '𝒳😂𩷶';
	console.log(slice(str, 0, 3)); // 𝒳-😂-𩷶

Итого:
Объекты, которые можно использовать в цикле for..of, называются итерируемыми или перебираемыми.
- Технически итерируемые объекты должны иметь метод Symbol.iterator.
	- Результат вызова obj[Symbol.iterator] называется итератором. Он управляет процессом итерации.
	- Итератор должен иметь метод next(), который возвращает объект {done: Boolean, value: any}, где done:true сигнализирует об окончании процесса итерации, в противном случае value – следующее значение.
- Метод Symbol.iterator автоматически вызывается циклом for..of, но можно вызвать его и напрямую.
- Встроенные итерируемые объекты, такие как строки или массивы, также реализуют метод Symbol.iterator.
- Строковый итератор знает про суррогатные пары.

Объекты, имеющие индексированные свойства и length, называются псевдомассивами. Они также могут иметь другие свойства и методы, но у них нет встроенных методов массивов.
Если мы заглянем в спецификацию, мы увидим, что большинство встроенных методов рассчитывают на то, что они будут работать с итерируемыми объектами или псевдомассивами вместо «настоящих» массивов, потому что эти объекты более абстрактны.
Array.from(obj[, mapFn, thisArg]) создаёт настоящий Array из итерируемого объекта или псевдомассива obj, и затем мы можем применять к нему методы массивов. Необязательные аргументы mapFn и thisArg позволяют применять функцию с задаваемым контекстом к каждому элементу.

#1.5.7. Map и Set
23.12.24 - https://learn.javascript.ru/map-set
Map – это коллекция ключ/значение, как и Object. Но основное отличие в том, что Map позволяет использовать ключи любого типа.
// обычный объект Object приводит ключи к строкам, Map сохраняет тип ключей.
new Map([iterable]); // создаёт коллекцию, можно указать перебираемый объект (обычно массив) из пар [ключ,значение] для инициализации..

Методы и свойства:
map.set(key, value); // записывает по ключу key значение value; возвращает объект map.
map.get(key); // возвращает значение по ключу или undefined, если ключ key отсутствует.
map.has(key); // возвращает true, если ключ key присутствует в коллекции, иначе false.
map.delete(key); // удаляет элемент (пару ключ/значение) по ключу key.
map.clear(); // очищает коллекцию от всех элементов.
map.size; // возвращает текущее количество элементов.

Для ключей можно использовать любые типы данных:
	let map = new Map();
	map.set("1", "str1");    // строка в качестве ключа
	map.set(1, "num1");      // цифра как ключ
	map.set(true, "bool1");  // булево значение как ключ
	console.log(map.get(1)); // "num1"
	console.log(map.get("1")); // "str1"
	console.log(map.size); // 3
Для установления ключей следует использовать методы map: set, get и так далее; map[key] это не совсем правильный способ использования Map. 
// Хотя map[key] также работает (напр. можно установить map[key] = 2), в этом случае map рассматривался бы как обычный JS-объект, т.о. это ведёт ко всем соответствующим ограничениям (только строки/символьные ключи и так далее).
Map может использовать объекты в качестве ключей. Использование объектов в качестве ключей – одна из наиболее заметных и важных функций Map. Это то что невозможно для Object. Строка в качестве ключа в Object – это нормально, но мы не можем использовать другой Object в качестве ключа в Object.

Как объект Map сравнивает ключи:
Чтобы сравнивать ключи, объект Map использует алгоритм SameValueZero. Это почти такое же сравнение, что и ===, с той лишь разницей, что NaN считается равным NaN. Так что NaN также может использоваться в качестве ключа. Этот алгоритм не может быть заменён или модифицирован.
Каждый вызов map.set возвращает объект map, так что мы можем объединить вызовы в цепочку:
	map.set("1", "str1").set(1, "num1").set(true, "bool1");

Методы перебора коллекции Map:
map.keys(); // возвращает итерируемый объект по ключам,
map.values(); // возвращает итерируемый объект по значениям,
map.entries(); // возвращает итерируемый объект по парам вида [ключ, значение], этот вариант используется по умолчанию в for..of.

let recipeMap = new Map([["огурец", 500], ["помидор", 350], ["лук", 50]]);
for (let vegetable of recipeMap.keys()) { // перебор по ключам (овощи)
	console.log(vegetable); // огурец, помидор, лук
};
for (let amount of recipeMap.values()) { // перебор по значениям (числа)
	console.log(amount); // 500, 350, 50
};
for (let entry of recipeMap) { // перебор по элементам в формате [ключ, значение]; то же, что и recipeMap.entries();
	console.log(entry); // огурец,500 (и так далее)
};

В отличие от обычных объектов Object, в Map используется порядок вставки, т.е. перебор происходит в том же порядке, в каком происходило добавление элементов.
Map имеет встроенный метод forEach, схожий со встроенным методом массивов Array:
	recipeMap.forEach((value, key, map) => { // выполняем функцию для каждой пары (ключ, значение)
		console.log(key, ':', value); // огурец: 500 (и так далее)
	});
Map можно легко создать из объекта с помощью Object.entries(obj), который получает объект и возвращает массив пар ключ-значение для него, а это как раз то что нужно для new Map():
	let obj = {name: "John", age: 30};
	let map = new Map(Object.entries(obj));
	console.log( map.get('name') ); // John
// здесь Object.entries() возвращает массив пар ключ-значение: [["name","John"], ["age", 30]]. Это именно то, что нужно для создания Map.

Метод Object.fromEntries(arr); // возвращает объект из массива пар вида [ключ, значение].
Можно использовать Object.fromEntries(arr), чтобы получить обычный объект из Map.
	let obj = Object.fromEntries(recipeMap);
	console.log(obj); // {огурец: 500, помидор: 350, лук: 50}

Отличия коллекции Map от обычного объекта Object:
	- Что угодно может быть ключом, в том числе и объекты.
	- Есть дополнительные методы, свойство size.

Объект Set.
Объект Set – коллекция уникальных значений; так называемое множество значений (без ключей), где каждое значение может появляться только один раз.
new Set(iterable); // создаёт Set, можно указать перебираемый объект со значениями для инициализации. 
// если в качестве аргумента был предоставлен итерируемый объект (обычно это массив), то копирует его значения в новый Set.

методы Set:
set.add(value); // добавляет значение (если оно уже есть, то ничего не делает), возвращает тот же объект set.
// при повторных вызовах set.add() с тем же значением ничего не происходит, поэтому каждое значение появляется только один раз.
set.delete(value); // удаляет значение, возвращает true, если value было в множестве на момент вызова, иначе false.
set.has(value); // возвращает true, если значение присутствует в множестве, иначе false.
set.clear(); // удаляет все имеющиеся значения.
set.size; // возвращает количество элементов в множестве.

// Альтернативой множеству Set может выступать массив для хранения и дополнительный код для проверки уже имеющегося элемента с помощью arr.find(). Но в этом случае производительность будет хуже, потому что arr.find() проходит весь массив для проверки наличия элемента. 
Множество Set лучше оптимизировано для добавлений, оно автоматически при добавлении проверяет значение на уникальность.

Перебрать содержимое объекта Set можно как с помощью метода for..of, так и используя forEach():
	let set = new Set(["апельсин", "яблоко", "банан"]);
	for (let value of set) console.log(value);
	set.forEach((value, valueAgain, set) => {console.log(value)}); // то же самое с forEach().
// Функция в forEach у Set имеет 3 аргумента: значение value, затем снова то же самое значение valueAgain, и только потом целевой объект. Это сделано для совместимости с объектом Map, в котором колбэк forEach имеет 3 аргумента. Выглядит немного странно, но в некоторых случаях может помочь легко заменить Map на Set и наоборот.

методы перебора Set (те же, что и у Map):
set.values(); // возвращает перебираемый объект для значений,
set.keys(); // то же самое, что и set.values(), присутствует для обратной совместимости с Map,
set.entries(); // возвращает перебираемый объект для пар вида [значение, значение], присутствует для обратной совместимости с Map.

Перебор Map и Set всегда осуществляется в порядке добавления элементов, так что нельзя сказать, что это – неупорядоченные коллекции, но поменять порядок элементов или получить элемент напрямую по его номеру нельзя.

Итого:
Map – коллекция пар ключ-значение.
Методы и свойства:
new Map([iterable]) – создаёт коллекцию, можно указать перебираемый объект (обычно массив) из пар [ключ,значение] для инициализации.
map.set(key, value) – записывает по ключу key значение value.
map.get(key) – возвращает значение по ключу или undefined, если ключ key отсутствует.
map.has(key) – возвращает true, если ключ key присутствует в коллекции, иначе false.
map.delete(key) – удаляет элемент по ключу key.
map.clear() – очищает коллекцию от всех элементов.
map.size – возвращает текущее количество элементов.
Отличия от обычного объекта Object:
	Что угодно может быть ключом, в том числе и объекты.
	Есть дополнительные методы, свойство size.
Set – коллекция уникальных значений, так называемое "множество".
Методы и свойства:
new Set(iterable) – создаёт Set, можно указать перебираемый объект со значениями для инициализации.
set.add(value) – добавляет значение (если оно уже есть, то ничего не делает), возвращает тот же объект set.
set.delete(value) – удаляет значение, возвращает true если value было в множестве на момент вызова, иначе false.
set.has(value) – возвращает true, если значение присутствует в множестве, иначе false.
set.clear() – удаляет все имеющиеся значения.
set.size – возвращает количество элементов в множестве.
Перебор Map и Set всегда осуществляется в порядке добавления элементов, так что нельзя сказать, что это – неупорядоченные коллекции, но поменять порядок элементов или получить элемент напрямую по его номеру нельзя.

задачи: 1+- 2-- 3++
1. Фильтрация уникальных элементов массива (важность: 5)
Допустим, у нас есть массив arr. Создайте функцию unique(arr), которая вернёт массив уникальных, не повторяющихся значений массива arr.
Например:
	function unique(arr) {/* ваш код */}
	let values = ["Hare", "Krishna", "Hare", "Krishna", "Krishna", "Krishna", "Hare", "Hare", ":-O"];
	alert( unique(values) ); // Hare,Krishna,:-O
P.S. Здесь мы используем строки, но значения могут быть любого типа.
P.P.S. Используйте Set для хранения уникальных значений.
решение:
	function unique(arr){return Array.from(new Set(arr))};

2. Отфильтруйте анаграммы (важность: 4)
Анаграммы – это слова, у которых те же буквы в том же количестве, но они располагаются в другом порядке.
Например: nap - pan, ear - are - era, cheaters - hectares - teachers
Напишите функцию aclean(arr), которая возвращает массив слов, очищенный от анаграмм.
Например:
	let arr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];
	alert( aclean(arr) ); // "nap,teachers,ear" или "PAN,cheaters,era"
Из каждой группы анаграмм должно остаться только одно слово, не важно какое.
решение:
	Чтобы найти все анаграммы, давайте разобьём каждое слово на буквы и отсортируем их, а потом объединим получившийся массив снова в строку. После этого все анаграммы будут одинаковы.
	Например:
		nap, pan -> anp
		ear, era, are -> aer
		cheaters, hectares, teachers -> aceehrst
		...
	Мы будем использовать отсортированные строки как ключи в коллекции Map, для того чтобы сопоставить каждому ключу только одно значение:
		function aclean(arr) {
			let map = new Map();
			for (let word of arr) {
				// разбиваем слово на буквы, сортируем и объединяем снова в строку
				let sorted = word.toLowerCase().split("").sort().join(""); // (*)
				map.set(sorted, word);
			}
			return Array.from(map.values());
		}
		let arr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];
		alert( aclean(arr) );
	Строка с отсортированными буквами получается в результате цепочки вызовов в строке (*).
	Для удобства, давайте разделим это на несколько строк:
		let sorted = arr[i] // PAN
			.toLowerCase() // pan
			.split("") // ["p","a","n"]
			.sort() // ["a","n","p"]
			.join(""); // anp
	Два разных слова 'PAN' и 'nap' принимают ту же самую форму после сортировки букв – 'anp'.
	Следующая строчка кода помещает слово в объект Map:
		map.set(sorted, word);
	Если мы когда-либо ещё встретим слово в той же отсортированной форме, тогда это слово перезапишет значение с тем же ключом в объекте. Таким образом, нескольким словам у нас будет всегда соответствовать одна отсортированная форма.
	В конце Array.from(map.values()) принимает итерируемый объект значений объекта Map (в данном случае нам не нужны ключи) и возвращает их в виде массива.
	Также в этом случае вместо Map мы можем использовать простой объект, потому что ключи являются строками.
	В этом случае решение может выглядеть так:
		function aclean(arr) {
			let obj = {};
			for (let i = 0; i < arr.length; i++) {
				let sorted = arr[i].toLowerCase().split("").sort().join("");
				obj[sorted] = arr[i];
			}
			return Object.values(obj);
		}
		let arr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];
		alert( aclean(arr) );
	моё решение:
		function aclean(arr){
			let uniq = new Map();
			for (let word of arr) {
				let lettersArray = Array.from(new Set(word));
				let newWord = lettersArray.sort().join('').toLowerCase();
				uniq.set(newWord, word);
			}
			return Array.from(uniq.values());
		}
		arr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];
		console.log(aclean(arr)); // (3) ['PAN', 'hectares', 'era']
3. Перебираемые ключи (важность: 5)
Мы хотели бы получить массив ключей map.keys() в переменную и далее работать с ними, например, применить метод .push.
Но это не выходит:
	let map = new Map();
	map.set("name", "John");
	let keys = map.keys();
	// Error: keys.push is not a function
	// Ошибка: keys.push -- это не функция
	keys.push("more");
Почему? Что нужно поправить в коде, чтобы вызов keys.push сработал?
решение:
	let map = new Map();
	map.set("name", "John");
	let keys = Array.from(map.keys());
	keys.push("more");

#1.5.8. WeakMap и WeakSet
15-16.3.25 - https://learn.javascript.ru/weakmap-weakset
Как мы знаем из главы Сборка мусора, движок JavaScript хранит значения в памяти до тех пор, пока они достижимы (то есть, эти значения могут быть использованы).
Например:
	let john = { name: "John" }; // объект доступен, переменная john — это ссылка на него
	john = null; // перепишем ссылку
	// объект будет удалён из памяти
Обычно свойства объекта, элементы массива или другой структуры данных считаются достижимыми и сохраняются в памяти до тех пор, пока эта структура данных содержится в памяти.
Например, если мы поместим объект в массив, то до тех пор, пока массив существует, объект также будет существовать в памяти, несмотря на то, что других ссылок на него нет.
Например:
	let john = { name: "John" };
	let array = [ john ];
	john = null; // перезаписываем ссылку на объект
	// объект john хранится в массиве, поэтому он не будет удалён сборщиком мусора, и мы можем взять его значение как array[0]
Аналогично, если мы используем объект как ключ в Map, то до тех пор, пока существует Map, также будет существовать и этот объект. Он занимает место в памяти и не может быть удалён сборщиком мусора.
Например:
	let john = { name: "John" };
	let map = new Map();
	map.set(john, "...");
	john = null; // перезаписываем ссылку на объект
	// объект john сохранён внутри объекта `Map`, он доступен через map.keys()
WeakMap – принципиально другая структура в этом аспекте. Она не предотвращает удаление объектов сборщиком мусора, когда эти объекты выступают в качестве ключей.

WeakMap.
Первое его отличие от Map в том, что ключи в WeakMap должны быть объектами, а не примитивными значениями:
	let weakMap = new WeakMap();
	let obj = {};
	weakMap.set(obj, "ok"); // работает (объект в качестве ключа)
	weakMap.set("test", "Whoops"); // Ошибка, потому что "test" не объект (нельзя использовать строку в качестве ключа)
Теперь, если мы используем объект в качестве ключа и если больше нет ссылок на этот объект, то он будет удалён из памяти (и из объекта WeakMap) автоматически.
	let john = { name: "John" };
	let weakMap = new WeakMap();
	weakMap.set(john, "...");
	john = null; // перезаписываем ссылку на объект
	// объект john удалён из памяти!
Сравните это поведение с поведением обычного Map, пример которого был приведён ранее. Теперь john существует только как ключ в WeakMap и может быть удалён оттуда автоматически.
WeakMap не поддерживает перебор и методы keys(), values(), entries(), так что нет способа взять все ключи или значения из неё.
В WeakMap присутствуют только следующие методы:
	weakMap.get(key) // возвращает значение по ключу или undefined, если ключ key отсутствует.
	weakMap.set(key, value) // записывает по ключу key значение value.
	weakMap.delete(key) // удаляет элемент по ключу key.
	weakMap.has(key) // возвращает true, если ключ key присутствует в коллекции, иначе false.
К чему такие ограничения? Из-за особенностей технической реализации. Если объект станет недостижим (как объект john в примере выше), то он будет автоматически удалён сборщиком мусора. Но нет информации, в какой момент произойдёт эта очистка.
Решение о том, когда делать сборку мусора, принимает движок JS. Он может посчитать необходимым как удалить объект прямо сейчас, так и отложить эту операцию, чтобы удалить большее количество объектов за раз позже. Так что технически количество элементов в коллекции WeakMap неизвестно. Движок может произвести очистку сразу или потом, или сделать это частично. По этой причине методы для доступа ко всем сразу ключам/значениям недоступны.
Но для чего же нам нужна такая структура данных?

Пример: дополнительные данные
В основном, WeakMap используется в качестве дополнительного хранилища данных.
Если мы работаем с объектом, который принадлежит другому коду, может быть даже сторонней библиотеке, и хотим сохранить у себя какие-то данные для него, которые должны существовать лишь пока существует этот объект, то WeakMap – как раз то, что нужно.
Мы кладём эти данные в WeakMap, используя объект как ключ, и когда сборщик мусора удалит объекты из памяти, ассоциированные с ними данные тоже автоматически исчезнут.
	weakMap.set(john, "секретные документы"); // если john умрёт, "секретные документы" будут автоматически уничтожены
Давайте рассмотрим один пример.
Предположим, у нас есть код, который ведёт учёт посещений для пользователей. Информация хранится в коллекции Map: объект, представляющий пользователя, является ключом, а количество визитов – значением. Когда пользователь нас покидает (его объект удаляется сборщиком мусора), то больше нет смысла хранить соответствующий счётчик посещений.
Вот пример реализации счётчика посещений с использованием Map:
	// 📁 visitsCount.js
	let visitsCountMap = new Map(); // map: пользователь => число визитов
	function countUser(user) {
		let count = visitsCountMap.get(user) || 0;
		visitsCountMap.set(user, count + 1); // увеличиваем счётчик
	}
А вот другая часть кода, возможно, в другом файле, которая использует countUser:
	// 📁 main.js
	let john = { name: "John" };
	countUser(john); // ведём подсчёт посещений
	john = null; // пользователь покинул нас
Теперь объект john должен быть удалён сборщиком мусора, но он продолжает оставаться в памяти, так как является ключом в visitsCountMap.
Нам нужно очищать visitsCountMap при удалении объекта пользователя, иначе коллекция будет бесконечно расти. Подобная очистка может быть неудобна в реализации при сложной архитектуре приложения.
Проблемы можно избежать, если использовать WeakMap:
	// 📁 visitsCount.js
	let visitsCountMap = new WeakMap(); // map: пользователь => число визитов
	function countUser(user){
		let count = visitsCountMap.get(user) || 0;
		visitsCountMap.set(user, count + 1); // увеличиваем счётчик
	}
Теперь нет необходимости вручную очищать visitsCountMap. После того, как объект john стал недостижим другими способами, кроме как через WeakMap, он удаляется из памяти вместе с информацией по такому ключу из WeakMap.

Применение для кеширования.
Другая частая сфера применения – это кеширование, когда результат вызова функции должен где-то запоминаться (кешироваться) для того, чтобы дальнейшие её вызовы на том же объекте могли просто брать уже готовый результат, повторно используя его.
Для хранения результатов мы можем использовать Map, вот так:
	// 📁 cache.js
	let cache = new Map();
	function process(obj) {// вычисляем и запоминаем результат
		if (!cache.has(obj)) {
			let result = /* тут какие-то вычисления результата для объекта */ obj;
			cache.set(obj, result);
		}
		return cache.get(obj);
	}
	// Теперь используем process() в другом файле:
	// 📁 main.js
	let obj = {/* допустим, у нас есть какой-то объект */};
	let result1 = process(obj); // вычислен результат
	// ...позже, из другого места в коде...
	let result2 = process(obj); // ранее вычисленный результат взят из кеша
	// ...позже, когда объект больше не нужен:
	obj = null;
	alert(cache.size); // 1 (Упс! Объект всё ещё в кеше, занимает память!)
Многократные вызовы process(obj) с тем же самым объектом в качестве аргумента ведут к тому, что результат вычисляется только в первый раз, а затем последующие вызовы берут его из кеша. Недостатком является то, что необходимо вручную очищать cache от ставших ненужными объектов.
Но если мы будем использовать WeakMap вместо Map, то эта проблема исчезнет: закешированные результаты будут автоматически удалены из памяти сборщиком мусора.
	// 📁 cache.js
	let cache = new WeakMap();
	function process(obj) { // вычисляем и запоминаем результат
		if (!cache.has(obj)) {
			let result = /* вычисляем результат для объекта */ obj;
			cache.set(obj, result);
		}
		return cache.get(obj);
	}
	// 📁 main.js
	let obj = {/* какой-то объект */};
	let result1 = process(obj);
	let result2 = process(obj);
	// ...позже, когда объект больше не нужен:
	obj = null;
	// Нет возможности получить cache.size, так как это WeakMap, но он равен 0 или скоро будет равен 0.
	// Когда сборщик мусора удаляет obj, связанные с ним данные из кеша тоже удаляются

WeakSet.
Коллекция WeakSet ведёт себя похоже:
	- Она аналогична Set, но мы можем добавлять в WeakSet только объекты (не примитивные значения).
	- Объект присутствует в множестве только до тех пор, пока доступен где-то ещё.
	- Как и Set, она поддерживает add, has и delete, но не size, keys() и не является перебираемой.
		weakSet.add(value) // добавляет значение (если оно уже есть, то ничего не делает), возвращает тот же объект set.
		weakSet.delete(value) // удаляет значение, возвращает true если value было в множестве на момент вызова, иначе false.
		weakSet.has(value) // возвращает true, если значение присутствует в множестве, иначе false.
Будучи "слабой" версией оригинальной структуры данных, она тоже служит в качестве дополнительного хранилища. Но не для произвольных данных, а скорее для значений типа да/нет. Присутствие во множестве WeakSet может что-то сказать нам об объекте.
Например, мы можем добавлять пользователей в WeakSet для учёта тех, кто посещал наш сайт:
	let visitedSet = new WeakSet();
	let john = { name: "John" };
	let pete = { name: "Pete" };
	let mary = { name: "Mary" };
	visitedSet.add(john); // John заходил к нам
	visitedSet.add(pete); // потом Pete
	visitedSet.add(john); // John снова
	// visitedSet сейчас содержит двух пользователей
	// проверим, заходил ли John?
	alert(visitedSet.has(john)); // true
	// проверим, заходила ли Mary?
	alert(visitedSet.has(mary)); // false
	john = null;
	// структура данных visitedSet будет очищена автоматически (объект john будет удалён из visitedSet)
Наиболее значительным ограничением WeakMap и WeakSet является то, что их нельзя перебрать или взять всё содержимое. Это может доставлять неудобства, но не мешает WeakMap/WeakSet выполнять их главную задачу – быть дополнительным хранилищем данных для объектов, управляемых из каких-то других мест в коде.

Итого:
WeakMap – это Map-подобная коллекция, позволяющая использовать в качестве ключей только объекты, и автоматически удаляющая их вместе с соответствующими значениями, как только они становятся недостижимыми иными путями.
WeakSet – это Set-подобная коллекция, которая хранит только объекты и удаляет их, как только они становятся недостижимыми иными путями.
Обе этих структуры данных не поддерживают методы и свойства, работающие со всем содержимым сразу или возвращающие информацию о размере коллекции. Возможны только операции на отдельном элементе коллекции.
WeakMap и WeakSet используются как вспомогательные структуры данных в дополнение к основному месту хранения объекта. Если объект удаляется из основного хранилища и нигде не используется, кроме как в качестве ключа в WeakMap или в WeakSet, то он будет удалён автоматически.

	let john = { name: "John" };
	let weakMap = new WeakMap();
	weakMap.set(john, "...");
	weakMap.set(obj, "ok"); // работает (объект в качестве ключа)
	// weakMap.set("test", "Whoops"); // Ошибка Uncaught TypeError: Invalid value used as weak map key, потому что "test" не объект (нельзя использовать строку в качестве ключа)
	john = null; // перезаписываем ссылку на объект
	console.log(john); // null // объект john удалён из памяти
	console.log(weakMap); // WeakMap {{…} => '...', {…} => 'ok'}

задачи: 1- 2+-
1. Хранение отметок "не прочитано" (важность: 5)
Есть массив сообщений:
	let messages = [
		{text: "Hello", from: "John"},
		{text: "How goes?", from: "John"},
		{text: "See you soon", from: "Alice"}
	];
У вас есть к ним доступ, но управление этим массивом происходит где-то ещё. Добавляются новые сообщения и удаляются старые, и вы не знаете в какой момент это может произойти.
Имея такую вводную информацию, решите, какую структуру данных вы могли бы использовать для ответа на вопрос "было ли сообщение прочитано?". Структура должна быть подходящей, чтобы можно было однозначно сказать, было ли прочитано это сообщение для каждого объекта сообщения.
P.S. Когда сообщение удаляется из массива messages, оно должно также исчезать из структуры данных.
P.P.S. Нам не следует модифицировать сами объекты сообщений, добавлять туда свойства. Если сообщения принадлежат какому-то другому коду, то это может привести к плохим последствиям.
решение:
Можно хранить прочитанные сообщения в WeakSet:
	let messages = [
		{text: "Hello", from: "John"},
		{text: "How goes?", from: "John"},
		{text: "See you soon", from: "Alice"}
	];
	let readMessages = new WeakSet();
	// Два сообщения были прочитаны
	readMessages.add(messages[0]);
	readMessages.add(messages[1]);
	// readMessages содержит 2 элемента
	// ...давайте снова прочитаем первое сообщение!
	readMessages.add(messages[0]);
	// readMessages до сих пор содержит 2 элемента
	// Вопрос: было ли сообщение message[0] прочитано?
	alert("Read message 0: " + readMessages.has(messages[0])); // true
	messages.shift();
	// теперь readMessages содержит 1 элемент (хотя технически память может быть очищена позже)
WeakSet позволяет хранить набор сообщений и легко проверять наличие сообщения в нём.
Он очищается автоматически. Минус в том, что мы не можем перебрать его содержимое, не можем получить все прочитанные сообщения напрямую. Но мы можем сделать это, перебирая все сообщения и фильтруя те, которые находятся в WeakSet.
Альтернативным решением может быть добавление свойства вида message.isRead=true к сообщению после его прочтения. Так как сообщения принадлежат чужому коду, то это не очень хорошо, но если использовать свойство-символ, то вероятность конфликтов будет небольшой.
Например:
	// символьное свойство вместо имени, которое известно только нашему коду
	let isRead = Symbol("isRead");
	messages[0][isRead] = true;
Теперь чужой код вряд ли увидит наше дополнительное свойство.
Хотя символы и позволяют уменьшить вероятность проблем, использование здесь WeakSet лучше с архитектурной точки зрения.

	let readMessages = new WeakSet();
	readMessages.add(messages[0]);
	readMessages.add(messages[1]);
	console.log(readMessages.has(messages[0])); // true
	console.log(readMessages); // WeakSet {{…}, {…}}

2. Хранение времени прочтения (важность: 5)
Есть массив сообщений такой же, как и в предыдущем задании.
	let messages = [
		{ text: "Hello", from: "John" },
		{ text: "How goes?", from: "John" },
		{ text: "See you soon", from: "Alice" }
	];
Теперь вопрос стоит так: какую структуру данных вы бы предложили использовать для хранения информации о том, когда сообщение было прочитано?
В предыдущем задании нам нужно было сохранить только факт прочтения «да или нет». Теперь же нам нужно сохранить дату, и она должна исчезнуть из памяти при удалении «сборщиком мусора» сообщения.
P.S. Даты в JS можно хранить как объекты встроенного класса Date, которые мы разберём позднее.
решение:
Для хранения даты мы можем использовать WeakMap:
	let messages = [
		{text: "Hello", from: "John"},
		{text: "How goes?", from: "John"},
		{text: "See you soon", from: "Alice"}
	];
	let readMap = new WeakMap();
	readMap.set(messages[0], new Date());

	let readMessage = new WeakMap();
	readMessage.set(messages[0], new Date());
	console.log(readMessage); // WeakMap {{…} => Sun Mar 16 2025 14:50:59 GMT+0300 (GMT+03:00)}

#1.5.9. Object.keys, values, entries
17.3.25 - https://learn.javascript.ru/keys-values-entries
Давайте отойдём от отдельных структур данных и поговорим об их переборе вообще.
В предыдущей главе мы видели методы map.keys(), map.values(), map.entries().
Это универсальные методы, и существует общее соглашение использовать их для структур данных. Если бы мы делали собственную структуру данных, нам также следовало бы их реализовать. Методы поддерживаются для структур: Map, Set, Array.
Простые объекты также можно перебирать похожими методами, но синтаксис немного отличается.

Object.keys, values, entries.
Для простых объектов доступны следующие методы:
	Object.keys(obj) // возвращает массив ключей.
	Object.values(obj) // возвращает массив значений.
	Object.entries(obj) // возвращает массив пар [ключ, значение].
Обратите внимание на различия (по сравнению с map, например):
						Map						Object
Синтаксис вызова	map.keys()				Object.keys(obj), не obj.keys()
Возвращает			перебираемый объект		реальный массив

Первое отличие в том, что мы должны вызвать Object.keys(obj), а не obj.keys().
Почему так? Основная причина – гибкость. Помните, что объекты являются основой всех сложных структур в JS. У нас может быть объект data, который реализует свой собственный метод data.values(). И мы всё ещё можем применять к нему стандартный метод Object.values(data).
Второе отличие в том, что методы вида Object.* возвращают реальные массивы, а не просто итерируемые объекты. Это в основном по историческим причинам.
Например:
	let user = {name: "John", age: 30};
	Object.keys(user) // ["name", "age"]
	Object.values(user) // ["John", 30]
	Object.entries(user) // [ ["name","John"], ["age",30] ]
Вот пример использования Object.values ​​для перебора значений свойств в цикле:
	let user = {name: "John", age: 30};
	for (let value of Object.values(user)) { // перебор значений
		alert(value); // John, затем 30
	}

Object.keys/values/entries игнорируют символьные свойства.
Так же, как и цикл for..in, эти методы игнорируют свойства, использующие Symbol(...) в качестве ключей.
Обычно это удобно. Но если требуется учитывать и символьные ключи, то для этого существует отдельный метод 
Object.getOwnPropertySymbols() ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertySymbols'], 
возвращающий массив только символьных ключей. Также, существует метод Reflect.ownKeys(obj) ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Reflect/ownKeys'], который возвращает все ключи.

Трансформации объекта.
У объектов нет множества методов, которые есть в массивах, например map, filter и других.
Если мы хотели бы их применить, то можно использовать Object.entries с последующим вызовом Object.fromEntries:
Вызов Object.entries(obj) возвращает массив пар ключ/значение для obj.
На нём вызываем методы массива, например, map.
Используем Object.fromEntries(array) на результате, чтобы преобразовать его обратно в объект.
Например, у нас есть объект с ценами, и мы хотели бы их удвоить:
	let prices = {banana: 1, orange: 2, meat: 4,};
	let doublePrices = Object.fromEntries( // преобразовать в массив, затем map, затем fromEntries (обратно в объект)
		Object.entries(prices).map(([key, value]) => [key, value * 2])
	);
	alert(doublePrices.meat); // 8
Это может выглядеть сложным на первый взгляд, но становится лёгким для понимания после нескольких раз использования.
Можно делать и более сложные "однострочные" преобразования таким путём. Важно только сохранять баланс, чтобы код при этом был достаточно простым для понимания.

Задачи: 1+ 2+-

1. Сумма свойств объекта (важность: 5)
Есть объект salaries с произвольным количеством свойств, содержащих заработные платы.
Напишите функцию sumSalaries(salaries), которая возвращает сумму всех зарплат с помощью метода Object.values и цикла for..of.
Если объект salaries пуст, то результат должен быть 0.
Например:
	let salaries = {"John": 100, "Pete": 300, "Mary": 250};
	alert( sumSalaries(salaries) ); // 650
решение:
	function sumSalaries(salaries){
		let sum = 0;
		for (let sal of Object.values(salaries)) sum += sal;
		return sum;
	}
	salaries = {"John": 100, "Pete": 300, "Mary": 250};
	console.log(sumSalaries(salaries)); // 650
Или, как вариант, мы можем получить сумму, используя методы Object.values и reduce:
	function sumSalaries(salaries) {
		return Object.values(salaries).reduce((a, b) => a + b, 0) // 650
	} // reduce перебирает массив значений salaries, складывает их и возвращает результат
2. Подсчёт количества свойств объекта (важность: 5)
Напишите функцию count(obj), которая возвращает количество свойств объекта:
	let user = {name: 'John', age: 30};
	alert( count(user) ); // 2
Постарайтесь сделать код как можно короче.
P.S. Игнорируйте символьные свойства, подсчитывайте только «обычные».
решение:
	function count(obj){return Object.entries(obj).length};
	user = {name: 'John', age: 30};
	console.log(count(user)); // 2

#1.5.10. Деструктурирующее присваивание
22.12.24/18.3.25 - https://learn.javascript.ru/destructuring-assignment
В JS есть две чаще всего используемые структуры данных – это Object и Array.
	Объекты (Object) позволяют нам создавать одну сущность, которая хранит элементы данных по ключам.
	Массивы (Array) позволяют нам собирать элементы данных в упорядоченный список.
Но когда мы передаём их в функцию, то ей может понадобиться не объект/массив целиком, а элементы по отдельности.
Деструктурирующее присваивание – это специальный синтаксис, который позволяет нам распаковать массивы или объекты в несколько переменных, так как иногда они более удобны. 
	[elem1, elem2, ..., elemN] = Array;		[elem1, elem2, ..., elemN] = [elem1, elem2, ..., elemN];
	{elem1, elem2, ..., elemN} = Object;	{elem1, elem2, ..., elemN} = {elem1, elem2, ..., elemN};
// возвращает набор переменных, каждой из которых присвоено значение элемента массива/объекта.
Деструктуризация также прекрасно работает со сложными функциями, которые имеют много параметров, значений по умолчанию и так далее.
Деструктурирующее присваивание не уничтожает массив. Оно вообще ничего не делает с массивом, его задача – только скопировать нужные значения в переменные.
Это просто короткий вариант записи:
	// let [firstName, surname] = arr;
	let firstName = arr[0];
	let surname = arr[1];
Нежелательные элементы массива  можно пропускать с помощью дополнительной запятой.
	let [firstName, , title] = ["Julius", "Caesar", "Consul", "of the Roman Republic"]; // второй элемент не нужен
	alert( title ); // Consul
Деструктуризация отлично смотрится в сочетании со split() или другими методами, возвращающими массив:
	let [firstName, surname] = "Имя Фамилия".split(' ');
	console.log(firstName); // Имя
	console.log(surname);  // Фамилия
Деструктуризация работает с любым перебираемым объектом с правой стороны (напр. строками).
…На самом деле мы можем использовать любой перебираемый объект, не только массивы:
	let [a, b, c] = "abc";
	let [one, two, three] = new Set([1, 2, 3]);
Можно использовать что угодно присваивающее с левой стороны:
	let user = {};
	[user.name, user.surname] = 'Имя Фамилия'.split(' ');
	console.log(user.name); // Имя
	console.log(user.surname);  // Фамилия

Можно использовать метод Object.entries(obj) с деструктуризацией для цикличного перебора ключей и значений объекта:
	let user = {name: 'John', age: 30};
	for (let [key, value] of Object.entries(user)) { // цикличный перебор объекта по ключам и значениям
		console.log(`${key}:${value}`); // name:John, age:30
	};
…то же самое для map:
	let user = new Map();
	user.set("name", "John");
	user.set("age", "30");
	for (let [key, value] of user) {
		console.log(`${key}:${value}`); // name:John, age:30
	}; // Map перебирает объект как пары [ключ, значение], что очень удобно для деструктурирования
Обмен значений двух переменных с использованием деструктурирующего присваивания:
	let guest = "Jane";
	let admin = "Pete";
	[guest, admin] = [admin, guest]; // поменяем местами значения
	console.log(guest, admin); // Pete Jane

Остаточные параметры ... .
Обычно, если массив длиннее, чем список слева, то лишние элементы опускаются. Для сбора остальных значений можно использовать троеточие ... :
	let [name1, name2, ...rest] = ["Julius", "Caesar", "Consul", "of the Roman Republic"]; // rest - массив элементов, начиная с 3-го
Переменная rest является массивом из оставшихся элементов.
Вместо rest можно использовать любое другое название переменной, просто убедитесь, что перед переменной есть три точки и она стоит на последнем месте в деструктурирующем присваивании.
	let [name1, name2, ...titles] = ["Julius", "Caesar", "Consul", "of the Roman Republic"];
	// теперь titles = ["Consul", "of the Roman Republic"]

Значения по умолчанию.
Если в массиве меньше значений, чем в присваивании, то ошибки не будет. Отсутствующие значения считаются неопределёнными (undefined).
Если мы хотим, чтобы значение по-умолчанию заменило отсутствующее, мы можем указать его с помощью = :
	let [name = "Guest", surname = "Anonymous"] = ["Julius"]; // значения по умолчанию
	// name == Julius (из массива), surname == Anonymous (значение по умолчанию).
Значения по умолчанию могут быть гораздо более сложными выражениями или даже функциями. Они выполняются, только если значения отсутствуют.
	let [name = prompt('name?'), surname = prompt('surname?')] = ["Julius"];
	alert(name);    // Julius (из массива)
	alert(surname); // результат prompt
	// prompt будет запущен только для пропущенного значения (surname).

Деструктуризация объекта.
Деструктурирующее присваивание также работает с объектами.
Синтаксис:
	let {var1, var2} = {var1:…, var2:…};
При деструктурировании объектов названия переменных должны совпадать с ключами объекта, при этом порядок не имеет значения:
	let {height, width, title} = {title: "Menu", height: 200, width: 100};
	console.log('height:', height, 'width:', width, 'title:', title); // height: 200 width: 100 title: Menu
Если нужно присвоить свойство объекта переменной с другим названием, то можно использовать двоеточие : .
	{sourceProperty: targetVariable} = obj; // {что: куда идёт}
	let options = {title: 'Menu', height: 200, width: 100};
	let {height:h, width:w, title:t} = options;
	console.log('height:', h, 'width:', w, 'title:', t); // height: 200 width: 100 title: Menu
Как и в случае с массивами, значениями по умолчанию могут быть любые выражения или даже функции.
Также можно совмещать : и = .
Если есть большой объект с множеством свойств, можно взять только то, что нужно:
	let {title: t = 'title'} = options;
	console.log(t); // Menu

Остаток объекта …
Если в объекте больше свойств чем задано переменных, то можно взять необходимые нам, а остальные присвоить в переменную ...rest, т.е. использовать троеточие, как и для массивов. В некоторых старых браузерах (IE) это не поддерживается, и нужно использовать Babel для создания полифила.
	let {title, ...rest} = options; // title = свойство с именем title, rest = объект с остальными свойствами
	// сейчас title="Menu", rest={height: 200, width: 100}

Лри отсутствии let, JS может принять деструктуризацию за обычный блок кода, и могут возникнуть ошибки.
	{title, width, height} = {title: "Menu", width: 200, height: 100}; // ошибка, работать не будет
	({title, width, height} = {title: "Menu", width: 200, height: 100}); // теперь всё работает

Вложенная деструктуризация.
Если объект или массив содержит другие вложенные объекты или массивы, то мы можем использовать более сложные шаблоны с левой стороны, чтобы извлечь более глубокие свойства:
	let {size: {width, height}, items: [item1, item2], title = 'Menu'} = {size: {width: 100, height: 200}, items: ['Cake', 'Donut'], extra: true};
	// title = Menu, width = 100, height = 200, item1 = Cake, item2 = Donut
	// title = "Menu" // отсутствует в объекте (используется значение по умолчанию)
Весь объект options, кроме свойства extra, которое в левой части отсутствует, присваивается в соответствующие переменные.
Заметим, что переменные для size и items отсутствуют, так как мы взяли сразу их содержимое.

Можно передать параметры функции как деструктурируемый объект ({obj}), и функция деструктурирует его в переменные:
	let options = {title: "My menu", items: ["Item1", "Item2"]}; // мы передаём объект в функцию
	function showMenu({title = "Untitled", width: w = 200, height: h = 100, items = []}) {
		console.log( `${title} ${w} ${h}` ); // My Menu 200 100
		console.log( items ); // Item1, Item2
	}; // ...и она извлекает свойства в переменные
	showMenu(options);
Полный синтаксис – такой же, как для деструктурирующего присваивания:
	function funcName({incomingProperty: varName = defaultValue, ... }) {...};
// для объекта с параметрами будет создана переменная varName для свойства с именем incomingProperty по умолчанию равная defaultValue.
Такое деструктурирование подразумевает, что в funcName() будет обязательно передан аргумент. Если нужны все значения по умолчанию, то следует передать пустой объект:
	funcName({}); // все значения - по умолчанию
	funcName(); // ошибка
Можно исправить это, сделав {} значением по умолчанию для всего объекта параметров:
	function showMenu({ title = "Menu", width = 100, height = 200 } = {}) {
		console.log(`${title} ${width} ${height}`);
	};
	showMenu(); // Menu 100 200
// весь объект аргументов по умолчанию равен {}, поэтому всегда есть что-то, что можно деструктурировать.

Итого:
	- Деструктуризация позволяет разбивать объект или массив на переменные при присвоении.
	- Полный синтаксис для объекта:
		let {prop : varName = defaultValue, ...rest} = object; 
	// Cвойство prop объекта object здесь должно быть присвоено переменной varName. Если в объекте отсутствует такое свойство, переменной varName присваивается значение по умолчанию. Свойства, которые не были упомянуты, копируются в объект rest.
	- Полный синтаксис для массива:
		let [item1 = defaultValue, item2, ...rest] = array;
	// Первый элемент отправляется в item1; второй отправляется в item2, все остальные элементы попадают в массив rest.
	- Можно извлекать данные из вложенных объектов и массивов, для этого левая сторона должна иметь ту же структуру, что и правая.

Задачи: 1+- 2+-
1. Деструктурирующее присваивание (важность: 5)
У нас есть объект:
	let user = {name: "John", years: 30};
Напишите деструктурирующее присваивание, которое:
	свойство name присвоит в переменную name.
	свойство years присвоит в переменную age.
	свойство isAdmin присвоит в переменную isAdmin (false, если нет такого свойства)
Пример переменных после вашего присваивания:
	let user = { name: "John", years: 30 };
	// ваш код = user
	alert( name ); // John
	alert( age ); // 30
	alert( isAdmin ); // false
решение:
	user = {name: "John", years: 30};
	let {name, years: age, isAdmin = false} = user;
	console.log(name, age, isAdmin); // John 30 false

2. Максимальная зарплата (важность: 5)
У нас есть объект salaries с зарплатами:
	let salaries = {"John": 100, "Pete": 300, "Mary": 250};
Создайте функцию topSalary(salaries), которая возвращает имя самого высокооплачиваемого сотрудника.
Если объект salaries пустой, то нужно вернуть null.
Если несколько высокооплачиваемых сотрудников, можно вернуть любого из них.
P.S. Используйте Object.entries и деструктурирование, чтобы перебрать пары ключ/значение.
решение:
	let salaries = {'John': 100, 'Pete': 300, 'Mary': 250};
	function topSalary(salaries){
		let maxSalary = 0, maxName = null;
		for (let [name, sal] of Object.entries(salaries)) {
			if (sal > maxSalary) {maxSalary = sal; maxName = name};
		}
		return maxName + ': ' + maxSalary;
	}
	console.log(topSalary(salaries)); // Pete: 300
	(function (salaries){
		let sorted = Object.entries(salaries).sort(([, a], [, b]) => b - a);
		return console.log(sorted[0][0], ':', sorted[0][1]);
	})(salaries); // Pete : 300

#1.5.11. Дата и время
19.3.25 - https://learn.javascript.ru/date
Встроенный объект Date содержит дату и время, а также предоставляет методы управления ими.
Например, его можно использовать для хранения времени создания/изменения, для измерения времени или просто для вывода текущей даты.

Создание.
Для создания нового объекта Date нужно вызвать конструктор new Date() с одним из следующих аргументов:

new Date().
Без аргументов – создать объект Date с текущими датой и временем:
	let now = new Date();
	alert( now ); // показывает текущие дату и время

new Date(milliseconds).
Создать объект Date с временем, равным количеству миллисекунд (тысячная доля секунды), прошедших с 1 января 1970 года UTC+0.
	// 0 соответствует 01.01.1970 UTC+0
	let Jan01_1970 = new Date(0);
	alert( Jan01_1970 ); // Thu Jan 01 1970 03:00:00 GMT+0300 (GMT+03:00)
	// теперь добавим 24 часа и получим 02.01.1970 UTC+0
	let Jan02_1970 = new Date(24 * 3600 * 1000);
	alert( Jan02_1970 );
Целое число, представляющее собой количество миллисекунд, прошедших с начала 1970 года, называется таймстамп (англ. timestamp).
Это – легковесное численное представление даты. Из таймстампа всегда можно получить дату с помощью new Date(timestamp) и преобразовать существующий объект Date в таймстамп, используя метод date.getTime() (см. ниже).
Датам до 1 января 1970 будут соответствовать отрицательные таймстампы, например:
	// 31 декабря 1969 года
	let Dec31_1969 = new Date(-24 * 3600 * 1000);
	alert( Dec31_1969 );
	
new Date(datestring).
Если аргумент всего один, и это строка, то из неё прочитывается дата. Алгоритм разбора – такой же, как в Date.parse, который мы рассмотрим позже.
	let date = new Date("2017-01-26");
	alert(date); // Thu Jan 26 2017 03:00:00 GMT+0300 (GMT+03:00)
	// Время не указано, поэтому оно ставится в полночь по Гринвичу и меняется в соответствии с часовым поясом места выполнения кода
	// Так что в результате можно получить Thu Jan 26 2017 11:00:00 GMT+1100 (восточно-австралийское время) или Wed Jan 25 2017 16:00:00 GMT-0800 (тихоокеанское время)

new Date(year, month, date, hours, minutes, seconds, ms).
Создать объект Date с заданными компонентами в местном часовом поясе. Обязательны только первые два аргумента.
	- year должен состоять из четырёх цифр. Для совместимости также принимаются 2 цифры и рассматриваются как 19xx, к примеру, 98 здесь это тоже самое, что и 1998, но настоятельно рекомендуется всегда использовать 4 цифры.
	- month начинается с 0 (январь) по 11 (декабрь).
	- Параметр date здесь представляет собой день месяца. Если параметр не задан, то принимается значение 1.
	- Если параметры hours/minutes/seconds/ms отсутствуют, их значением становится 0.
Например:
	new Date(2011, 0, 1, 0, 0, 0, 0); // 1 Jan 2011, 00:00:00
	new Date(2011, 0, 1); // то же самое, так как часы и проч. равны 0
Максимальная точность – 1 мс (до 1/1000 секунды):
	let date = new Date(2011, 0, 1, 2, 3, 4, 567);
	alert( date ); // 1.01.2011, 02:03:04.567

Получение компонентов даты.
Существуют методы получения года, месяца и т.д. из объекта Date:
	dateObj.getFullYear() // Получить год (4 цифры)
	dateObj.getMonth() // Получить месяц, от 0 до 11.
	dateObj.getDate() // Получить день месяца, от 1 до 31, что несколько противоречит названию метода.
	dateObj.getHours(), dateObj.getMinutes(), dateObj.getSeconds(), dateObj.getMilliseconds() // Получить, соответственно, часы, минуты, секунды или миллисекунды.

Никакого getYear(), только getFullYear().
Многие интерпретаторы JS реализуют нестандартный и устаревший метод getYear(), который порой возвращает год в виде двух цифр. Пожалуйста, обходите его стороной. Если нужно значение года, используйте getFullYear().
	let date = new Date("2017-01-26");
	console.log(date.getYear()); // 117

Кроме того, можно получить определённый день недели:
	dateObj.getDay() // Вернуть день недели от 0 (воскресенье) до 6 (суббота). Несмотря на то, что в ряде стран за первый день недели принят понедельник, в JS начало недели приходится на воскресенье.
Все вышеперечисленные методы возвращают значения в соответствии с местным часовым поясом.
Однако существуют и их UTC-варианты, возвращающие день, месяц, год для временной зоны UTC+0: getUTCFullYear(), getUTCMonth(), getUTCDay(). Для их использования требуется после "get" подставить "UTC".
Если ваш местный часовой пояс смещён относительно UTC, то следующий код покажет разные часы:
	let date = new Date(); // текущая дата
	alert( date.getHours() ); // час в вашем текущем часовом поясе
	alert( date.getUTCHours() ); // час в часовом поясе UTC+0 (лондонское время без перехода на летнее время)
Помимо вышеприведённых методов, существуют два особых метода без UTC-варианта:
dateObj.getTime() // возвращает таймстамп для заданной даты – количество миллисекунд, прошедших с 1 января 1970 года UTC+0.
dateObj.getTimezoneOffset() // возвращает разницу в минутах между UTC и местным часовым поясом:
	// если вы в часовом поясе UTC-1, то выводится 60
	// если вы в часовом поясе UTC+3, выводится -180
	alert( new Date().getTimezoneOffset() );

Установка компонентов даты.
Следующие методы позволяют установить компоненты даты и времени:
	setFullYear(year, [month], [date])
	setMonth(month, [date])
	setDate(date)
	setHours(hour, [min], [sec], [ms])
	setMinutes(min, [sec], [ms])
	setSeconds(sec, [ms])
	setMilliseconds(ms)
	setTime(milliseconds); // устанавливает дату в виде целого количества миллисекунд, прошедших с 01.01.1970 UTC
У всех этих методов, кроме setTime(), есть UTC-вариант, например: setUTCHours().
Как мы видим, некоторые методы могут устанавливать сразу несколько компонентов даты, например: setHours. Если какая-то компонента не указана, она не меняется.
Пример:
	let today = new Date();
	today.setHours(0);
	alert(today); // выводится сегодняшняя дата, но значение часа будет 0
	today.setHours(0, 0, 0, 0);
	alert(today); // всё ещё выводится сегодняшняя дата, но время будет ровно 00:00:00.

Автоисправление даты.
Автоисправление – это очень полезная особенность объектов Date. Можно устанавливать компоненты даты вне обычного диапазона значений, а объект сам себя исправит.
Пример:
	let date = new Date(2013, 0, 32); // 32 Jan 2013 ?!?
	alert(date); // ...1 Feb 2013!
Неправильные компоненты даты автоматически распределяются по остальным.
Предположим, нам требуется увеличить дату "28 февраля 2016" на два дня. В зависимости от того, високосный это год или нет, результатом будет "2 марта" или "1 марта". Нам об этом думать не нужно. Просто прибавляем два дня. Объект Date позаботится об остальном:
	let date = new Date(2016, 1, 28);
	date.setDate(date.getDate() + 2);
	alert( date ); // 1 Mar 2016
Эту возможность часто используют, чтобы получить дату по прошествии заданного отрезка времени. Например, получим дату "спустя 70 секунд с текущего момента":
	let date = new Date();
	date.setSeconds(date.getSeconds() + 70);
	alert( date ); // выводит правильную дату
Также можно установить нулевые или даже отрицательные значения. Например:
	let date = new Date(2016, 0, 2); // 2 Jan 2016
	date.setDate(1); // задать первое число месяца
	alert( date );
	date.setDate(0); // первый день месяца -- это 1, так что выводится последнее число предыдущего месяца
	alert( date ); // 31 Dec 2015

Преобразование к числу, разность дат.
Если объект Date преобразовать в число, то получим таймстамп по аналогии с date.getTime():
	let date = new Date();
	alert(+date); // количество миллисекунд, то же самое, что date.getTime()
Важный побочный эффект: даты можно вычитать, в результате получаем разность в миллисекундах.
Этот приём можно использовать для измерения времени:
	let start = new Date(); // начинаем отсчёт времени
	for (let i = 0; i < 100000; i++) {
		let doSomething = i * i * i;
	}
	let end = new Date(); // заканчиваем отсчёт времени
	console.log( `Цикл отработал за ${end - start} миллисекунд` ); // Цикл отработал за 18 миллисекунд

Date.now().
Если нужно просто измерить время, объект Date нам не нужен.
Существует особый метод Date.now(), возвращающий текущую метку времени.
Семантически он эквивалентен new Date().getTime(), однако метод не создаёт промежуточный объект Date. Так что этот способ работает быстрее и не нагружает сборщик мусора.
Данный метод используется из соображений удобства или когда важно быстродействие, например, при разработке игр на JS или других специализированных приложений.
Вероятно, предыдущий пример лучше переписать так:
	let start = Date.now(); // начинаем отсчёт времени (количество миллисекунд с 1 января 1970 года)
	for (let i = 0; i < 100000; i++) let doSomething = i * i * i;
	let end = Date.now(); // заканчиваем отсчёт времени
	console.log( `Цикл отработал за ${end - start} миллисекунд` ); // вычитаются числа, а не даты // Цикл отработал за 12 миллисекунд

Бенчмаркинг.
Будьте внимательны, если хотите точно протестировать производительность функции, которая зависит от процессора.
Например, сравним две функции, вычисляющие разницу между двумя датами: какая сработает быстрее?
Подобные вычисления, замеряющие производительность, также называют бенчмарками (benchmark).
	// есть date1 и date2, какая функция быстрее вернёт разницу между ними в миллисекундах?
	function diffSubtract(date1, date2) {return date2 - date1}
	// или
	function diffGetTime(date1, date2) {return date2.getTime() - date1.getTime()}
Обе функции делают буквально одно и то же, только одна использует явный метод date.getTime() для получения даты в миллисекундах, а другая полагается на преобразование даты в число. Результат их работы всегда один и тот же.
Но какая функция быстрее?
Для начала можно запустить их много раз подряд и засечь разницу. В нашем случае функции очень простые, так что потребуется хотя бы 100000 повторений.
Проведём измерения:
	function diffSubtract(date1, date2) {return date2 - date1};
	function diffGetTime(date1, date2) {return date2.getTime() - date1.getTime()};
	function bench(func) {
		let date1 = new Date(0);
		let date2 = new Date();
		let start = Date.now();
		for (let i = 0; i < 100000; i++) func(date1, date2);
		return Date.now() - start;
	}
	console.log( 'Время diffSubtract: ' + bench(diffSubtract) + 'мс' ); // Время diffSubtract: 46мс
	console.log( 'Время diffGetTime: ' + bench(diffGetTime) + 'мс' ); // Время diffGetTime: 5мс
Вот это да! Метод getTime() работает ощутимо быстрее! Всё потому, что не производится преобразование типов, и интерпретаторам такое намного легче оптимизировать.
Замечательно, это уже что-то. Но до хорошего бенчмарка нам ещё далеко.
Представьте, что при выполнении bench(diffSubtract) процессор параллельно делал что-то ещё, также потребляющее ресурсы. А к началу выполнения bench(diffGetTime) он это уже завершил.
Достаточно реалистичный сценарий в современных многопроцессорных операционных системах.
В итоге у первого бенчмарка окажется меньше ресурсов процессора, чем у второго. Это может исказить результаты.
Для получения наиболее достоверных результатов тестирования производительности весь набор бенчмарков нужно запускать по нескольку раз.
Например, так:
	function diffSubtract(date1, date2) {return date2 - date1};
	function diffGetTime(date1, date2) {return date2.getTime() - date1.getTime()};
	function bench(f) {
		let date1 = new Date(0);
		let date2 = new Date();
		let start = Date.now();
		for (let i = 0; i < 100000; i++) f(date1, date2);
		return Date.now() - start;
	}
	let time1 = 0;
	let time2 = 0;
	// bench(diffSubtract) и bench(diffGetTime) поочерёдно запускаются 10 раз
	for (let i = 0; i < 10; i++) {
		time1 += bench(diffSubtract);
		time2 += bench(diffGetTime);
	}
	console.log('Итоговое время diffSubtract: ' + time1, 'ms'); // Итоговое время diffSubtract: 429 ms
	console.log('Итоговое время diffGetTime: ' + time2, 'ms'); // Итоговое время diffGetTime: 34 ms
Современные интерпретаторы JS начинают применять продвинутые оптимизации только к "горячему коду", выполняющемуся несколько раз (незачем оптимизировать то, что редко выполняется). Так что в примере выше первые запуски не оптимизированы должным образом. Нелишним будет добавить предварительный запуск для "разогрева":
	// добавляем для "разогрева" перед основным циклом
	bench(diffSubtract);
	bench(diffGetTime);
	// а теперь тестируем производительность
	for (let i = 0; i < 10; i++) {
		time1 += bench(diffSubtract);
		time2 += bench(diffGetTime);
	}

Будьте осторожны с микробенчмарками.
Современные интерпретаторы JS выполняют множество оптимизаций. Они могут повлиять на результаты «искусственных тестов» по сравнению с "нормальным использованием", особенно если мы тестируем что-то очень маленькое, например, работу оператора или встроенной функции. Поэтому если хотите серьёзно понять производительность, пожалуйста, изучите, как работают интерпретаторы JavaScript. И тогда вам, вероятно, уже не понадобятся микробенчмарки. Отличный набор статей о V8 можно найти на https://mrale.ph.

Разбор строки с датой.
Метод Date.parse(str) считывает дату из строки.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Date/parse']
	Date.parse(dateString) // разбирает строковое представление даты и возвращает временную метку (таймстамп).
Формат строки должен быть следующим: YYYY-MM-DDTHH:mm:ss.sssZ, где:
	YYYY-MM-DD – это дата: год-месяц-день.
	Символ "T" используется в качестве разделителя.
	HH:mm:ss.sss – время: часы, минуты, секунды и миллисекунды.
Необязательная часть 'Z' обозначает часовой пояс в формате +-hh:mm. Если указать просто букву Z, то получим UTC+0.
Возможны и более короткие варианты, например, YYYY-MM-DD или YYYY-MM, или даже YYYY.
Вызов Date.parse(str) обрабатывает строку в заданном формате и возвращает таймстамп (количество миллисекунд с 1 января 1970 года UTC+0). Если формат неправильный, возвращается NaN.
Например:
	let ms = Date.parse('2012-01-26T13:51:50.417-07:00');
	alert(ms); // 1327611110417 (таймстамп)
Можно тут же создать объект new Date из таймстампа:
	let date = new Date( Date.parse('2012-01-26T13:51:50.417-07:00') );
	alert(date);

Итого:
Дата и время в JS представлены объектом Date. Нельзя создать только дату или только время: объекты Date всегда содержат и то, и другое.
Счёт месяцев начинается с нуля (да, январь – это нулевой месяц).
Дни недели в getDay() также отсчитываются с нуля, что соответствует воскресенью.
Объект Date самостоятельно корректируется при введении значений, выходящих за рамки допустимых. Это полезно для сложения/вычитания дней/месяцев/недель.
Даты можно вычитать, и разность возвращается в миллисекундах. Так происходит, потому что при преобразовании в число объект Date становится таймстампом.
Используйте Date.now() для быстрого получения текущего времени в формате таймстампа.
Учтите, что, в отличие от некоторых других систем, в JS таймстамп в миллисекундах, а не в секундах.
Порой нам нужно измерить время с большей точностью. Собственными средствами JS измерять время в микросекундах (одна миллионная секунды) нельзя, но в большинстве сред такая возможность есть. К примеру, в браузерах есть метод performance.now() ['https://developer.mozilla.org/ru/docs/Web/API/Performance/now'], возвращающий количество миллисекунд с начала загрузки страницы с точностью до микросекунд (3 цифры после точки):
	alert(`Загрузка началась ${performance.now()}мс назад`);
	// Получаем что-то вроде: "Загрузка началась 34731.26000000001мс назад"
	// .26 –- это микросекунды (260 микросекунд)
	// корректными являются только первые три цифры после точки, а остальные -- это ошибка точности
В Node.js для этого предусмотрен модуль microtime и ряд других способов. Технически почти любое устройство или среда позволяет добиться большей точности, просто её нет в объекте Date.

Задачи: 1+- 2+- 3+- 4-+ 5++ 6+ 7+ 8+-
1. Создайте дату (важность: 5)
Создайте объект Date для даты: 20 февраля 2012 года, 3 часа 12 минут. Временная зона – местная.
решение:
	let date1 = new Date('2012-02-20 3:12'); // моё
	let d = new Date(2012, 1, 20, 3, 12); // учебник
	console.log(date1); // Mon Feb 20 2012 03:12:00 GMT+0300 (GMT+03:00)
	console.log(d); // Mon Feb 20 2012 03:12:00 GMT+0300 (GMT+03:00)
2. Покажите день недели (важность: 5)
Напишите функцию getWeekDay(date), показывающую день недели в коротком формате: «ПН», «ВТ», «СР», «ЧТ», «ПТ», «СБ», «ВС».
Например:
	let date = new Date(2012, 0, 3); // 3 января 2012 года
	console.log( getWeekDay(date) ); // нужно вывести "ВТ"
решение:
	function getWeekDay(date){ // моё
		return date.toLocaleDateString('ru-RU', {weekday: 'short'}).toUpperCase();
	};
	function getWeekDay(date) { // учебник
		let days = ['ВС', 'ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ'];
		return days[date.getDay()];
	}
	let date = new Date(2012, 0, 3);
	console.log(getWeekDay(date)); // ВТ
3. День недели в европейской нумерации (важность: 5)
В Европейских странах неделя начинается с понедельника (день номер 1), затем идёт вторник (номер 2) и так до воскресенья (номер 7). Напишите функцию getLocalDay(date), которая возвращает "европейский" день недели для даты date.
	let date = new Date(2012, 0, 3);  // 3 января 2012 года
	alert( getLocalDay(date) );       // вторник, нужно показать 2
решение:
	function getLocalDay(date){
		let day = date.getDay();
		if (day == 0) day = 7; // день недели 0 (воскресенье) в европейской нумерации будет 7
		return day;
	}
	console.log(getLocalDay(date)); // 2
4. Какой день месяца был много дней назад? (важность: 4)
Создайте функцию getDateAgo(date, days), возвращающую число, которое было days дней назад от даты date.
К примеру, если сегодня двадцатое число, то getDateAgo(new Date(), 1) вернёт девятнадцатое и getDateAgo(new Date(), 2) – восемнадцатое.
Функция должна надёжно работать при значении days=365 и больших значениях:
	let date = new Date(2015, 0, 2);
	alert( getDateAgo(date, 1) ); // 1, (1 Jan 2015)
	alert( getDateAgo(date, 2) ); // 31, (31 Dec 2014)
	alert( getDateAgo(date, 365) ); // 2, (2 Jan 2014)
P.S. Функция не должна изменять переданный ей объект date.
решение:
	function getDateAgo(date, days){
		let newDate = new Date(date);
		newDate.setDate(date.getDate() - days);
		let fullDate = newDate.toLocaleDateString({day: "numeric", month: "short", year: "numeric"});
		return newDate.getDate() + ', (' + fullDate + ')';
	}
	date = new Date(2015, 0, 2);
	console.log( getDateAgo(date, 1) ); // 1, (01.01.2015)
	console.log( getDateAgo(date, 2) ); // 31, (31.12.2014)
	console.log( getDateAgo(date, 365) ); // 2, (02.01.2014)
5. Последнее число месяца? (важность: 5)
Напишите функцию getLastDayOfMonth(year, month), возвращающую последнее число месяца. Иногда это 30, 31 или даже февральские 28/29.
Параметры:
	year – год из четырёх цифр, например, 2012.
	month – месяц от 0 до 11.
К примеру, getLastDayOfMonth(2012, 1) = 29 (високосный год, февраль).
решение:
	function getLastDayOfMonth(year, month){
		let date = new Date(year, month+1, 0);
		return console.log(date.getDate());
	}
	getLastDayOfMonth(2012, 1); // 29
6. Сколько сегодня прошло секунд? (важность: 5)
Напишите функцию getSecondsToday(), возвращающую количество секунд с начала сегодняшнего дня.
Например, если сейчас 10:00, и не было перехода на зимнее/летнее время, то:
getSecondsToday() == 36000 // (3600 * 10)
Функция должна работать в любой день, т.е. в ней не должно быть конкретного значения сегодняшней даты.
решение:
	function getSecondsToday(){
		let dateNow = new Date();
		let dateMidNight = new Date(dateNow.getFullYear(), dateNow.getMonth(), dateNow.getDate());
		return Math.round((dateNow - dateMidNight)/1000);
	}
	console.log(getSecondsToday()); // 53905 (14:58)
В качестве альтернативного решения можно получить часы/минуты и преобразовать их в секунды:
	function getSecondsToday() {
		let d = new Date();
		return d.getHours() * 3600 + d.getMinutes() * 60 + d.getSeconds();
	}
7. Сколько секунд осталось до завтра? (важность: 5)
Создайте функцию getSecondsToTomorrow(), возвращающую количество секунд до завтрашней даты.
Например, если сейчас 23:00, то:
getSecondsToTomorrow() == 3600
P.S. Функция должна работать в любой день, т.е. в ней не должно быть конкретного значения сегодняшней даты.
решение:
	function getSecondsToTomorrow(){
		let dateNow = new Date();
		let dateTomor = new Date(dateNow.getFullYear(), dateNow.getMonth(), dateNow.getDate()+1);
		return Math.round((dateTomor - dateNow)/1000);
	}
	console.log(getSecondsToTomorrow()); // 31854
Альтернативное решение:
	function getSecondsToTomorrow() {
		let now = new Date();
		let hour = now.getHours();
		let minutes = now.getMinutes();
		let seconds = now.getSeconds();
		let totalSecondsToday = (hour * 60 + minutes) * 60 + seconds;
		let totalSecondsInADay = 86400;
		return totalSecondsInADay - totalSecondsToday;
	}
8. Форматирование относительной даты (важность: 4)
Напишите функцию formatDate(date), форматирующую date по следующему принципу:
Если спустя date прошло менее 1 секунды, вывести "прямо сейчас".
В противном случае, если с date прошло меньше 1 минуты, вывести "n сек. назад".
В противном случае, если меньше часа, вывести "m мин. назад".
В противном случае, полная дата в формате "DD.MM.YY HH:mm". А именно: "день.месяц.год часы:минуты", всё в виде двух цифр, т.е. 31.12.16 10:00.
Например:
	alert( formatDate(new Date(new Date - 1)) ); // "прямо сейчас"
	alert( formatDate(new Date(new Date - 30 * 1000)) ); // "30 сек. назад"
	alert( formatDate(new Date(new Date - 5 * 60 * 1000)) ); // "5 мин. назад"
	// вчерашняя дата вроде 31.12.2016, 20:00
	alert( formatDate(new Date(new Date - 86400 * 1000)) );
решение:
8.1. моё:
	function formatDate(date){
		let diff = (new Date() - new Date(date))/1000;
		if (diff <= 1) return 'прямо сейчас';
		if (diff > 1 && diff <= 60) return `${diff} сек. назад`;
		if (diff > 60 && diff <= 3600) return `${Math.round(diff/60)} мин. назад`;
		// if (diff > 3600) return `${date.getDate()}.${date.getMonth()}.${date.getFullYear().toString().slice(-2)}, ${date.getHours()}:${date.getMinutes()}`;
		if (diff > 3600) {
			let d = date;
			d = ['0' + d.getDate(), '0' + (d.getMonth() + 1), '' + d.getFullYear(), '0' + d.getHours(), '0' + d.getMinutes()].map(component => component.slice(-2)); // взять последние 2 цифры из каждой компоненты
			return d.slice(0, 3).join('.') + ', ' + d.slice(3).join(':'); // соединить компоненты в дату
		};
	};
	console.log(formatDate(new Date(new Date - 1))); // прямо сейчас
	console.log(formatDate(new Date(new Date - 30 * 1000))); // 30 сек. назад
	console.log(formatDate(new Date(new Date - 5 * 60 * 1000))); // 5 мин. назад
	console.log(formatDate(new Date(new Date - 86400 * 1000))); // 18.2.25, 15:33
8.2 учебник 1е:
	Чтобы получить время с date по текущий момент, нужно вычесть даты.
	function formatDate(date) {
		let diff = new Date() - date; // разница в миллисекундах
		if (diff < 1000) return 'прямо сейчас'; // меньше 1 секунды
		let sec = Math.floor(diff / 1000); // преобразовать разницу в секунды
		if (sec < 60) return sec + ' сек. назад';
		let min = Math.floor(diff / 60000); // преобразовать разницу в минуты
		if (min < 60) return min + ' мин. назад';
		// отформатировать дату и добавить ведущие нули к единственной цифре дню/месяцу/часам/минутам
		let d = date;
		d = ['0' + d.getDate(), '0' + (d.getMonth() + 1), '' + d.getFullYear(), '0' + d.getHours(), '0' + d.getMinutes()].map(component => component.slice(-2)); // взять последние 2 цифры из каждой компоненты
		// соединить компоненты в дату
		return d.slice(0, 3).join('.') + ' ' + d.slice(3).join(':');
	}
	alert( formatDate(new Date(new Date - 1)) ); // "прямо сейчас"
	alert( formatDate(new Date(new Date - 30 * 1000)) ); // "30 сек. назад"
	alert( formatDate(new Date(new Date - 5 * 60 * 1000)) ); // "5 мин. назад"
	alert( formatDate(new Date(new Date - 86400 * 1000)) ); // вчерашняя дата вроде 31.12.2016, 20:00
8.3 учебник 2е:
	Альтернативное решение:
	function formatDate(date) {
		let dayOfMonth = date.getDate();
		let month = date.getMonth() + 1;
		let year = date.getFullYear();
		let hour = date.getHours();
		let minutes = date.getMinutes();
		let diffMs = new Date() - date;
		let diffSec = Math.round(diffMs / 1000);
		let diffMin = diffSec / 60;
		let diffHour = diffMin / 60;
		// форматирование
		year = year.toString().slice(-2);
		month = month < 10 ? '0' + month : month;
		dayOfMonth = dayOfMonth < 10 ? '0' + dayOfMonth : dayOfMonth;
		hour = hour < 10 ? '0' + hour : hour;
		minutes = minutes < 10 ? '0' + minutes : minutes;
		if (diffSec < 1) {return 'прямо сейчас';
		} else if (diffMin < 1) {return `${diffSec} сек. назад`
		} else if (diffHour < 1) {return `${diffMin} мин. назад`
		} else {return `${dayOfMonth}.${month}.${year} ${hour}:${minutes}`
		}
	}

#1.5.12. Формат JSON, метод toJSON
20.3.25 - https://learn.javascript.ru/json
Допустим, у нас есть сложный объект, и мы хотели бы преобразовать его в строку, чтобы отправить по сети или просто вывести для логирования.
Естественно, такая строка должна включать в себя все важные свойства.
Мы могли бы реализовать преобразование следующим образом:
	let user = {
		name: "John",
		age: 30,
		toString() {
			return `{name: "${this.name}", age: ${this.age}}`;
		}
	};
	alert(user); // {name: "John", age: 30}
…Но в процессе разработки добавляются новые свойства, старые свойства переименовываются и удаляются. Обновление такого toString каждый раз может стать проблемой. Мы могли бы попытаться перебрать свойства в нём, но что, если объект сложный, и в его свойствах имеются вложенные объекты? Мы должны были бы осуществить их преобразование тоже.
К счастью, нет необходимости писать код для обработки всего этого. У задачи есть простое решение.

JSON.stringify.
JSON (JavaScript Object Notation) ['https://ru.wikipedia.org/wiki/JSON'] – это общий формат для представления значений и объектов. Его описание задокументировано в стандарте RFC 4627 ['https://datatracker.ietf.org/doc/html/rfc4627']. Первоначально он был создан для JS, но многие другие языки также имеют библиотеки, которые могут работать с ним. Таким образом, JSON легко использовать для обмена данными, когда клиент использует JS, а сервер написан на Ruby/PHP/Java или любом другом языке.
JS предоставляет методы:
	JSON.stringify для преобразования объектов в JSON.
	JSON.parse для преобразования JSON обратно в объект.
Например, здесь мы преобразуем через JSON.stringify данные студента:
	let student = {
		name: 'John',
		age: 30,
		isAdmin: false,
		courses: ['html', 'css', 'js'],
		wife: null
	};
	let json = JSON.stringify(student);
	alert(typeof json); // string // мы получили строку!
	alert(json); // выведет объект в формате JSON: {"name": "John", "age": 30, "isAdmin": false, "courses": ["html", "css", "js"], "wife": null}
Метод JSON.stringify(student) берёт объект и преобразует его в строку.
	JSON.stringify(obj); // возвращает строку в формате JSON
Полученная строка json называется JSON-форматированным или сериализованным объектом. Мы можем отправить его по сети или поместить в обычное хранилище данных.
Обратите внимание, что объект в формате JSON имеет несколько важных отличий от объектного литерала:
Строки используют двойные кавычки. Никаких одинарных кавычек или обратных кавычек в JSON. Так 'John' становится "John".
Имена свойств объекта также заключаются в двойные кавычки. Это обязательно. Так age:30 становится "age":30.
JSON.stringify может быть применён и к примитивам.
JSON поддерживает следующие типы данных:
	Объекты { ... }
	Массивы [ ... ]
	Примитивы:
		строки,
		числа,
		логические значения true/false,
		null.
Например:
	alert( JSON.stringify(1) ) // 1 // число в JSON остаётся числом
	alert( JSON.stringify('test') ) // "test" // строка в JSON по-прежнему остаётся строкой, но в двойных кавычках
	alert( JSON.stringify(true) ); // true
	alert( JSON.stringify([1, 2, 3]) ); // [1,2,3]
JSON является независимой от языка спецификацией для данных, поэтому JSON.stringify пропускает некоторые специфические свойства объектов JS.
А именно:
	Свойства-функции (методы).
	Символьные ключи и значения.
	Свойства, содержащие undefined.
	let user = {
		sayHi() { // будет пропущено
			alert("Hello");
		},
		[Symbol("id")]: 123, // также будет пропущено
		something: undefined // как и это - пропущено
	};
	alert( JSON.stringify(user) ); // {} (пустой объект)
Обычно это нормально. Если это не то, чего мы хотим, то скоро мы увидим, как можно настроить этот процесс.
Самое замечательное, что вложенные объекты поддерживаются и конвертируются автоматически.
Например:
	let meetup = {
		title: "Conference",
		room: {
			number: 23,
			participants: ["john", "ann"]
		}
	};
	alert( JSON.stringify(meetup) );
	/* вся структура преобразована в строку:
	{
		"title":"Conference",
		"room":{"number":23,"participants":["john","ann"]},
	}
	*/
Важное ограничение: не должно быть циклических ссылок.
Например:
	let room = {number: 23};
	let meetup = {
		title: "Conference",
		participants: ["john", "ann"]
	};
	meetup.place = room;       // meetup ссылается на room
	room.occupiedBy = meetup; // room ссылается на meetup
	JSON.stringify(meetup); // Ошибка: Преобразование цикличной структуры в JSON
Здесь преобразование завершается неудачно из-за циклической ссылки: room.occupiedBy ссылается на meetup, и meetup.place ссылается на room.

Исключаем и преобразуем: replacer.
Полный синтаксис JSON.stringify:
	let json = JSON.stringify(value[, replacer, space])
	value // Значение для кодирования.
	replacer // Массив свойств для кодирования или функция соответствия function(key, value).
	space // Дополнительное пространство (отступы), используемое для форматирования.
В большинстве случаев JSON.stringify используется только с первым аргументом. Но если нам нужно настроить процесс замены, например, отфильтровать циклические ссылки, то можно использовать второй аргумент JSON.stringify.
Если мы передадим ему массив свойств, будут закодированы только эти свойства.
Например:
	let room = {number: 23};
	let meetup = {
		title: "Conference",
		participants: [{name: "John"}, {name: "Alice"}],
		place: room // meetup ссылается на room
	};
	room.occupiedBy = meetup; // room ссылается на meetup
	alert( JSON.stringify(meetup, ['title', 'participants']) ); // {"title":"Conference","participants":[{},{}]}
Здесь мы, наверное, слишком строги. Список свойств применяется ко всей структуре объекта. Так что внутри participants – пустые объекты, потому что name нет в списке.
Давайте включим в список все свойства, кроме room.occupiedBy, из-за которого появляется цикличная ссылка:
	let room = {number: 23};
	let meetup = {
		title: "Conference",
		participants: [{name: "John"}, {name: "Alice"}],
		place: room // meetup ссылается на room
	};
	room.occupiedBy = meetup; // room ссылается на meetup
	alert( JSON.stringify(meetup, ['title', 'participants', 'place', 'name', 'number']) ); // {"title":"Conference", "participants":[{"name":"John"},{"name":"Alice"}], "place":{"number":23}}
Теперь всё, кроме occupiedBy, сериализовано. Но список свойств довольно длинный.
К счастью, в качестве replacer мы можем использовать функцию, а не массив.
Функция будет вызываться для каждой пары (key, value), и она должна возвращать заменённое значение, которое будет использоваться вместо исходного. Или undefined, чтобы пропустить значение.
В нашем случае мы можем вернуть value "как есть" для всего, кроме occupiedBy. Чтобы игнорировать occupiedBy, код ниже возвращает undefined:
	let room = {number: 23};
	let meetup = {
		title: "Conference",
		participants: [{name: "John"}, {name: "Alice"}],
		place: room // meetup ссылается на room
	};
	room.occupiedBy = meetup; // room ссылается на meetup
	alert( JSON.stringify(meetup, function replacer(key, value) {
		alert(`${key}: ${value}`);
		return (key == 'occupiedBy') ? undefined : value;
	}));
	/* пары ключ:значение, которые приходят в replacer:
	:             [object Object]
	title:        Conference
	participants: [object Object],[object Object]
	0:            [object Object]
	name:         John
	1:            [object Object]
	name:         Alice
	place:        [object Object]
	number:       23
	occupiedBy: [object Object]
	*/
Обратите внимание, что функция replacer получает каждую пару ключ/значение, включая вложенные объекты и элементы массива. И она применяется рекурсивно. Значение this внутри replacer – это объект, который содержит текущее свойство.
Первый вызов – особенный. Ему передаётся специальный «объект-обёртка»: {"": meetup}. Другими словами, первая (key, value) пара имеет пустой ключ, а значением является целевой объект в общем. Вот почему первая строка из примера выше будет ":[object Object]".
Идея состоит в том, чтобы дать как можно больше возможностей replacer – у него есть возможность проанализировать и заменить/пропустить даже весь объект целиком, если это необходимо.

Форматирование: space.
Третий аргумент в JSON.stringify(value, replacer, space) – это количество пробелов, используемых для удобного форматирования.
Ранее все JSON-форматированные объекты не имели отступов и лишних пробелов. Это нормально, если мы хотим отправить объект по сети. Аргумент space используется исключительно для вывода в удобочитаемом виде.
Ниже space = 2 указывает JS отображать вложенные объекты в несколько строк с отступом в 2 пробела внутри объекта:
	let user = {name: "John", age: 25, roles: {isAdmin: false, isEditor: true}};
	alert(JSON.stringify(user, null, 2));
	/* отступ в 2 пробела:
	{
	  "name": "John",
	  "age": 25,
	  "roles": {
		"isAdmin": false,
		"isEditor": true
	  }
	}
	*/
	/* для JSON.stringify(user, null, 4) результат содержит больше отступов:
	{
		"name": "John",
		"age": 25,
		"roles": {
			"isAdmin": false,
			"isEditor": true
		}
	}
	*/
Третьим аргументом также может быть строка. В этом случае строка будет использоваться для отступа вместо ряда пробелов.
Параметр space применяется исключительно для логирования и красивого вывода.

Пользовательский toJSON.
Как и toString для преобразования строк, объект может предоставлять метод toJSON для преобразования в JSON. JSON.stringify автоматически вызывает его, если он есть.
Например:
	let room = {number: 23};
	let meetup = {
		title: "Conference",
		date: new Date(Date.UTC(2017, 0, 1)), // (1)
		room // (2)
	};
	alert( JSON.stringify(meetup) ); // {"title":"Conference", "date":"2017-01-01T00:00:00.000Z", "room": {"number":23}}
Как видим, date (1) стал строкой. Это потому, что все объекты типа Date имеют встроенный метод toJSON, который возвращает такую строку.
Теперь давайте добавим собственную реализацию метода toJSON в наш объект room (2):
	let room = {number: 23, toJSON() {return this.number;}};
	let meetup = {title: "Conference", room};
	alert( JSON.stringify(room) ); // 23
	alert( JSON.stringify(meetup) ); // {"title":"Conference", "room": 23}
Как видите, toJSON используется как при прямом вызове JSON.stringify(room), так и когда room вложен в другой сериализуемый объект.

JSON.parse().
Чтобы декодировать JSON-строку, нам нужен другой метод с именем JSON.parse.
Синтаксис:
	let value = JSON.parse(str[, reviver]);
	str // JSON для преобразования в объект.
	reviver // необязательная функция, которая будет вызываться для каждой пары (ключ, значение) и может преобразовывать значение.
Например:
	let numbers = "[0, 1, 2, 3]"; // строковый массив
	numbers = JSON.parse(numbers);
	alert( numbers[1] ); // 1
Или для вложенных объектов:
	let user = '{ "name": "John", "age": 35, "isAdmin": false, "friends": [0,1,2,3] }';
	user = JSON.parse(user);
	alert( user.friends[1] ); // 1
JSON может быть настолько сложным, насколько это необходимо, объекты и массивы могут включать другие объекты и массивы. Но они должны быть в том же JSON-формате.
Вот типичные ошибки в написанном от руки JSON (иногда приходится писать его для отладки):
	let json = `{
		name: "John",                     // Ошибка: имя свойства без кавычек
		"surname": 'Smith',               // Ошибка: одинарные кавычки в значении (должны быть двойными)
		'isAdmin': false,                 // Ошибка: одинарные кавычки в ключе (должны быть двойными)
		"birthday": new Date(2000, 2, 3), // Ошибка: не допускается конструктор "new", только значения
		"gender": "male"                  // Ошибка: отсутствует запятая после непоследнего свойства
		"friends": [0,1,2,3],             // Ошибка: не должно быть запятой после последнего свойства
	}`;
Кроме того, JSON не поддерживает комментарии. Добавление комментария в JSON делает его недействительным.
Существует ещё один формат JSON5, который поддерживает ключи без кавычек, комментарии и т.д. Но это самостоятельная библиотека, а не спецификация языка. Обычный JSON настолько строг не потому, что его разработчики ленивы, а потому, что позволяет легко, надёжно и очень быстро реализовывать алгоритм кодирования и чтения.

Использование reviver.
Представьте, что мы получили объект meetup с сервера в виде строки данных.
Вот такой:
	// title: (meetup title), date: (meetup date)
	let str = '{"title":"Conference","date":"2017-11-30T12:00:00.000Z"}';
…А теперь нам нужно десериализовать её, т.е. снова превратить в объект JS.
Давайте сделаем это, вызвав JSON.parse:
	let str = '{"title":"Conference","date":"2017-11-30T12:00:00.000Z"}';
	let meetup = JSON.parse(str);
	alert( meetup.date.getDate() ); // Ошибка!
Значением meetup.date является строка, а не Date объект. Как JSON.parse мог знать, что он должен был преобразовать эту строку в Date?
Давайте передадим JSON.parse функцию восстановления вторым аргументом, которая возвращает все значения "как есть", но date станет Date:
	let str = '{"title":"Conference","date":"2017-11-30T12:00:00.000Z"}';
	let meetup = JSON.parse(str, function(key, value) {
		if (key == 'date') return new Date(value);
		return value;
	});
	alert( meetup.date.getDate() ); // 30 - теперь работает!
Кстати, это работает и для вложенных объектов:
	let schedule = `{
	  "meetups": [
		{"title":"Conference","date":"2017-11-30T12:00:00.000Z"},
		{"title":"Birthday","date":"2017-04-18T12:00:00.000Z"}
	  ]
	}`;
	schedule = JSON.parse(schedule, function(key, value) {
		if (key == 'date') return new Date(value);
		return value;
	});
	alert( schedule.meetups[1].date.getDate() ); // 18 - отлично!

Итого:
JSON – это формат данных, который имеет собственный независимый стандарт и библиотеки для большинства языков программирования.
JSON поддерживает простые объекты, массивы, строки, числа, логические значения и null.
JavaScript предоставляет методы JSON.stringify для сериализации в JSON и JSON.parse для чтения из JSON.
Оба метода поддерживают функции преобразования для интеллектуального чтения/записи.
Если объект имеет метод toJSON, то он вызывается через JSON.stringify.

Задачи: 1+- 2-
1. Преобразуйте объект в JSON, а затем обратно в обычный объект (важность: 5)
Преобразуйте user в JSON, затем прочитайте этот JSON в другую переменную.
	let user = {name: "Василий Иванович", age: 35};
решение:
	user = {name: "Василий Иванович", age: 35};
	user = JSON.stringify(user);
	console.log(user); // {"name":"Василий Иванович","age":35}
	let user2 = JSON.parse(user);
	console.log(user2); // > {name: 'Василий Иванович', age: 35}
// учебник:
	let user2 = JSON.parse(JSON.stringify(user));
2. Исключить обратные ссылки (важность: 5)
В простых случаях циклических ссылок мы можем исключить свойство, из-за которого они возникают, из сериализации по его имени.
Но иногда мы не можем использовать имя, так как могут быть и другие, нужные, свойства с этим именем во вложенных объектах. Поэтому можно проверять свойство по значению.
Напишите функцию replacer для JSON-преобразования, которая удалит свойства, ссылающиеся на meetup:
	let room = {number: 23};
	let meetup = {
		title: "Совещание",
		occupiedBy: [{name: "Иванов"}, {name: "Петров"}],
		place: room
	};
	// цикличные ссылки
	room.occupiedBy = meetup;
	meetup.self = meetup;
	console.log( JSON.stringify(meetup, function replacer(key, value) {
		/* ваш код */
	}));
	/* в результате должно быть:
		{
			"title":"Совещание",
			"occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],
			"place":{"number":23}
		}
	*/
решение:
	// console.log( JSON.stringify(meetup)); // Uncaught TypeError: Converting circular structure to JSON --> starting at object with constructor 'Object'  property 'place' -> object with constructor 'Object'--- property 'occupiedBy' closes the circle
	console.log( JSON.stringify(meetup, function replacer(key, value) {
		return (key == 'occupiedBy' || key == 'self') ? undefined : value;
	})); // {"title":"Совещание","place":{"number":23}}
	console.log( JSON.stringify(meetup, function replacer(key, value) {
		return (key != "" && value == meetup) ? undefined : value;
	})); // {"title":"Совещание","occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],"place":{"number":23}}
	console.log( JSON.stringify(meetup, (key, value) =>
		(key && value === meetup) ? undefined : value
	)); // {"title":"Совещание","occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],"place":{"number":23}}
	// с помощью рекурсии:
	console.log( JSON.stringify(meetup, function replacer(key, value) {
		if (!key) replacer.self = value;
		if (key && value === replacer.self) return undefined;
		else return value;
	})); // {"title":"Совещание","occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],"place":{"number":23}}
	console.log( JSON.stringify(meetup, function replacer(key, value) {
		if (!key) replacer.self = value;
		if (key && value === replacer.self) return;
		return value;
	})); // {"title":"Совещание","occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],"place":{"number":23}}
/** почему циклические ссылки мешают преобразованию объекта в JSON?
По спецификации JSON не может содержать циклических ссылок, следовательно объект a не может быть преобразован к JSON.
Например, самый простой пример циклической ссылки:
	let a = {};
	a.a = a;
Теперь если мы попробуем обратиться например к a.a.a у нас получиться, и к a.a.a.a.a.a получится. При этом a == a.a == a.a.a == a.a.a.a == и т.д.
Циклическая ссылка появляется когда в свойствах объекта есть ссылка на самого себя, или ссылка на другой объект, который в свою очередь ссылается на первый, тем самым создавая бесконечный цикл. Циклической ссылкой может быть и свойство ссылающеееся на сам объект, и когда цепочка свойств рано или позно ссылается на саму себя или любой родительский объект. */


#1.6. Продвинутая работа с функциями 

#1.6.1. Рекурсия и стек
21.3.25 - https://learn.javascript.ru/recursion
Вернёмся к функциям и изучим их более подробно.
Нашей первой темой будет рекурсия.
Если вы не новичок в программировании, то, возможно, уже знакомы с рекурсией и можете пропустить эту главу.
Рекурсия – это приём программирования, полезный в ситуациях, когда задача может быть естественно разделена на несколько аналогичных, но более простых задач. Или когда задача может быть упрощена до несложных действий плюс простой вариант той же задачи. Или, как мы скоро увидим, для работы с определёнными структурами данных. В процессе выполнения задачи в теле функции могут быть вызваны другие функции для выполнения подзадач. Частный случай подвызова – когда функция вызывает сама себя. Это как раз и называется рекурсией.

Два способа мышления.
В качестве первого примера напишем функцию pow(x, n), которая возводит x в натуральную степень n. Иначе говоря, умножает x на само себя n раз.
	pow(2, 2) = 4
	pow(2, 3) = 8
	pow(2, 4) = 16
Рассмотрим два способа её реализации.
1. Итеративный способ: цикл for:
	function pow(x, n) {
		let result = 1;
		for (let i = 0; i < n; i++) { // умножаем result на x n раз в цикле
			result *= x;
		}
		return result;
	}
	alert( pow(2, 3) ); // 8
2. Рекурсивный способ: упрощение задачи и вызов функцией самой себя:
	function pow(x, n) {
		if (n == 1) return x
		else {return x * pow(x, n - 1)}
	}
	alert( pow(2, 3) ); // 8
Обратите внимание, что рекурсивный вариант отличается принципиально.
Когда функция pow(x, n) вызывается, исполнение делится на две ветви:
	(1) if n==1  = x
	(2) else     = x * pow(x, n - 1)
1. Если n == 1, тогда всё просто. Эта ветвь называется базой рекурсии, потому что сразу же приводит к очевидному результату: pow(x, 1) равно x.
2. Мы можем представить pow(x, n) в виде: x * pow(x, n - 1). Что в математике записывается как: xn = x * xn-1. Эта ветвь – шаг рекурсии: мы сводим задачу к более простому действию (умножение на x) и более простой аналогичной задаче (pow с меньшим n). Последующие шаги упрощают задачу всё больше и больше, пока n не достигает 1.
Говорят, что функция pow рекурсивно вызывает саму себя до n == 1.
Например, рекурсивный вариант вычисления pow(2, 4) состоит из шагов:
	pow(2, 4) = 2 * pow(2, 3) {
		pow(2, 3) = 2 * pow(2, 2) {
			pow(2, 2) = 2 * pow(2, 1) {
				pow(2, 1) = 2 
			}
		}
	}
Итак, рекурсию используют, когда вычисление функции можно свести к её более простому вызову, а его – к ещё более простому и так далее, пока значение не станет очевидно.

Рекурсивное решение задачи обычно короче, чем итеративное.
Используя условный оператор ? вместо if, мы можем переписать pow(x, n), делая код функции более лаконичным, но всё ещё легко читаемым:
	function pow(x, n) {
		return (n == 1) ? x : (x * pow(x, n - 1));
	}
Общее количество вложенных вызовов (включая первый) называют глубиной рекурсии. В нашем случае она будет равна n.
Максимальная глубина рекурсии ограничена движком JS. Точно можно рассчитывать на 10 000 вложенных вызовов, некоторые интерпретаторы допускают и больше, но для большинства из них 100 000 вызовов – за пределами возможностей. Существуют автоматические оптимизации, помогающие избежать переполнения стека вызовов (оптимизация хвостовой рекурсии), но они ещё не поддерживаются везде и работают только для простых случаев.
Это ограничивает применение рекурсии, но она всё равно широко распространена: для решения большого числа задач рекурсивный способ решения даёт более простой код, который легче поддерживать.

Контекст выполнения, стек.
Теперь мы посмотрим, как работают рекурсивные вызовы. Для этого заглянем "под капот" функций.
Информация о процессе выполнения запущенной функции хранится в её контексте выполнения (execution context).
Контекст выполнения – специальная внутренняя структура данных, которая содержит информацию о вызове функции. Она включает в себя конкретное место в коде, на котором находится интерпретатор, локальные переменные функции, значение this (мы не используем его в данном примере) и прочую служебную информацию.
Один вызов функции имеет ровно один контекст выполнения, связанный с ним.
Когда функция производит вложенный вызов, происходит следующее:
	- Выполнение текущей функции приостанавливается.
	- Контекст выполнения, связанный с ней, запоминается в специальной структуре данных – стеке контекстов выполнения.
	- Выполняются вложенные вызовы, для каждого из которых создаётся свой контекст выполнения.
	- После их завершения старый контекст достаётся из стека, и выполнение внешней функции возобновляется с того места, где она была остановлена.
Разберёмся с контекстами более подробно на примере вызова функции pow(2, 3).

pow(2, 3).
В начале вызова pow(2, 3) контекст выполнения будет хранить переменные: x = 2, n = 3, выполнение находится на первой строке функции.
Можно схематически изобразить это так:
	Контекст: { x: 2, n: 3, строка 1 } вызов: pow(2, 3)
Это только начало выполнения функции. Условие n == 1 ложно, поэтому выполнение идёт во вторую ветку if:
	1	function pow(x, n) {
	2		if (n == 1) {return x} 
	3		else return x * pow(x, n - 1);
	4	}
	5	alert( pow(2, 3) );
Значения переменных те же самые, но выполнение функции перешло к другой строке, актуальный контекст:
	Контекст: { x: 2, n: 3, строка 3 } вызов: pow(2, 3)
Чтобы вычислить выражение x * pow(x, n - 1), требуется произвести запуск pow с новыми аргументами pow(2, 2).

pow(2, 2).
Для выполнения вложенного вызова JS запоминает текущий контекст выполнения в стеке контекстов выполнения.
Здесь мы вызываем ту же функцию pow, однако это абсолютно неважно. Для любых функций процесс одинаков:
	1. Текущий контекст запоминается на вершине стека.
	2. Создаётся новый контекст для вложенного вызова.
	3. Когда выполнение вложенного вызова заканчивается – контекст предыдущего вызова восстанавливается, и выполнение соответствующей функции продолжается.
Вид контекста в начале выполнения вложенного вызова pow(2, 2):
	Контекст: { x: 2, n: 2, строка 1 } вызов: pow(2, 2)
	Контекст: { x: 2, n: 3, строка 3 } вызов: pow(2, 3)
Новый контекст выполнения находится на вершине стека, а предыдущие запомненные контексты – под ним.
Когда выполнение подвызова закончится, можно будет легко вернуться назад, потому что контекст сохраняет как переменные, так и точное место кода, в котором он остановился. Слово строка на рисунках условно, на самом деле запоминается более точное место в цепочке команд.

pow(2, 1).
Процесс повторяется: производится новый вызов в строке 5, теперь с аргументами x=2, n=1.
Создаётся новый контекст выполнения, предыдущий контекст добавляется в стек:
	Контекст: { x: 2, n: 1, строка 1 } вызов: pow(2, 1)
	Контекст: { x: 2, n: 2, строка 3 } вызов: pow(2, 2)
	Контекст: { x: 2, n: 3, строка 3 } вызов: pow(2, 3)
Теперь в стеке два старых контекста и один текущий для pow(2, 1).

Выход.
При выполнении pow(2, 1), в отличие от предыдущих запусков, условие n == 1 истинно, поэтому выполняется первая ветка условия if:
	function pow(x, n) {
		if (n == 1) return x;
		else return x * pow(x, n - 1);
	}
Вложенных вызовов больше нет, поэтому функция завершается, возвращая 2.
Когда функция заканчивается, контекст её выполнения больше не нужен, поэтому он удаляется из памяти, а из стека восстанавливается предыдущий:
	Контекст: { x: 2, n: 2, строка 5 } вызов: pow(2, 2)
	Контекст: { x: 2, n: 3, строка 5 } вызов: pow(2, 3)
Возобновляется обработка вызова pow(2, 2). Имея результат pow(2, 1), он может закончить свою работу x * pow(x, n - 1), вернув 4.
Восстанавливается контекст предыдущего вызова:
	Контекст: { x: 2, n: 3, строка 5 } вызов: pow(2, 3)
Самый внешний вызов заканчивает свою работу, его результат: pow(2, 3) = 8.
Глубина рекурсии в данном случае составила 3.
Как видно из иллюстраций выше, глубина рекурсии равна максимальному числу контекстов, одновременно хранимых в стеке.
Обратим внимание на требования к памяти. Рекурсия приводит к хранению всех данных для неоконченных внешних вызовов в стеке, и в данном случае это приводит к тому, что возведение в степень n хранит в памяти n различных контекстов.
Реализация возведения в степень через цикл гораздо более экономна:
	function pow(x, n) {
		let result = 1;
		for (let i = 0; i < n; i++) result *= x;
		return result;
	}
Итеративный вариант функции pow использует один контекст, в котором будут последовательно меняться значения i и result. При этом объём затрачиваемой памяти небольшой, фиксированный и не зависит от n.
Любая рекурсия может быть переделана в цикл. Как правило, вариант с циклом будет эффективнее.
Но переделка рекурсии в цикл может быть нетривиальной, особенно когда в функции в зависимости от условий используются различные рекурсивные подвызовы, результаты которых объединяются, или когда ветвление более сложное. Оптимизация может быть ненужной и совершенно нестоящей усилий.
Часто код с использованием рекурсии более короткий, лёгкий для понимания и поддержки. Оптимизация требуется не везде, как правило, нам важен хороший код, поэтому она и используется.

Рекурсивные обходы.
Другим отличным применением рекурсии является рекурсивный обход.
Представьте, у нас есть компания. Структура персонала может быть представлена как объект:
	let company = {
		sales: [{name: 'John', salary: 1000}, {name: 'Alice', salary: 600}],
		development: {
			sites: [{name: 'Peter', salary: 2000}, {name: 'Alex', salary: 1800}],
			internals: [{name: 'Jack', salary: 1300}]
		}
	};
Другими словами, в компании есть отделы.
	- Отдел может состоять из массива работников. Например, в отделе продаж (sales) работают 2 сотрудника: Джон и Алиса. 
	- Или отдел может быть разделён на подотделы, например, отдел развития (development) состоит из подотделов: sites и internals. В каждом подотделе есть свой персонал.
	- Также возможно, что при росте подотдела он делится на подразделения (или команды). Например, подотдел sites в будущем может быть разделён на команды siteA и siteB. И потенциально они могут быть разделены ещё. Этого нет на картинке, просто нужно иметь это в виду.
Теперь, допустим, нам нужна функция для получения суммы всех зарплат. Как мы можем это сделать?
Итеративный подход не прост, потому что структура довольно сложная. Первая идея заключается в том, чтобы сделать цикл for поверх объекта company с вложенным циклом над отделами 1-го уровня вложенности. Но затем нам нужно больше вложенных циклов для итераций над сотрудниками отделов второго уровня, таких как sites… А затем ещё один цикл по отделам 3-го уровня, которые могут появиться в будущем? Если мы поместим в код 3-4 вложенных цикла для обхода одного объекта, то это будет довольно некрасиво.
Давайте попробуем рекурсию.
Как мы видим, когда наша функция получает отдел для подсчёта суммы зарплат, есть два возможных случая:
	1. Либо это простой отдел с массивом – тогда мы сможем суммировать зарплаты в простом цикле.
	2. Или это объект с N подотделами – тогда мы можем сделать N рекурсивных вызовов, чтобы получить сумму для каждого из подотделов, и объединить результаты.
Случай (1), когда мы получили массив, является базой рекурсии, тривиальным случаем.
Случай (2), при получении объекта, является шагом рекурсии. Сложная задача разделяется на подзадачи для подотделов. Они могут, в свою очередь, снова разделиться на подотделы, но рано или поздно это разделение закончится, и решение сведётся к случаю (1).
Алгоритм даже проще читается в виде кода:
	let company = {
		sales: [{name: 'John', salary: 1000}, {name: 'Alice', salary: 600 }],
		development: {
			sites: [{name: 'Peter', salary: 2000}, {name: 'Alex', salary: 1800 }],
			internals: [{name: 'Jack', salary: 1300}]
		}
	};
	function sumSalaries(department) { // Функция для подсчёта суммы зарплат
		if (Array.isArray(department)) { // случай (1)
			return department.reduce((prev, current) => prev + current.salary, 0); // сумма элементов массива
		} else { // случай (2)
			let sum = 0;
			for (let subdep of Object.values(department)) {
				sum += sumSalaries(subdep); // рекурсивно вызывается для подотделов, суммируя результаты
			}
			return sum;
		}
	}
	alert(sumSalaries(company)); // 6700
Код краток и прост для понимания (надеюсь?). В этом сила рекурсии. Она работает на любом уровне вложенности отделов.
Принцип прост: для объекта {...} используются рекурсивные вызовы, а массивы [...] являются "листьями" дерева рекурсии, они сразу дают результат.
Обратите внимание, что в коде используются возможности, о которых мы говорили ранее:
	- Метод arr.reduce из главы Методы массивов, для получения суммы элементов массива.
	- Цикл for(val of Object.values(obj)) для итерации по значениям объекта: Object.values возвращает массив значений.

Рекурсивные структуры.
Рекурсивная (рекурсивно определяемая) структура данных – это структура, которая повторяет саму себя в своих частях.
Мы только что видели это на примере структуры компании выше.
Отдел компании – это:
	Либо массив людей.
	Либо объект с отделами.
Для веб-разработчиков существуют гораздо более известные примеры: HTML- и XML-документы.
В HTML-документе HTML-тег может содержать:
	Фрагменты текста.
	HTML-комментарии.
	Другие HTML-теги (которые, в свою очередь, могут содержать фрагменты текста/комментарии или другие теги и т.д.).
Это снова рекурсивное определение.
Для лучшего понимания мы рассмотрим ещё одну рекурсивную структуру под названием "связанный список", которая в некоторых случаях может использоваться в качестве альтернативы массиву.

Связанный список.
Представьте себе, что мы хотим хранить упорядоченный список объектов.
Естественным выбором будет массив:
	let arr = [obj1, obj2, obj3];
…Но у массивов есть недостатки. Операции "удалить элемент" и "вставить элемент" являются дорогостоящими. Например, операция arr.unshift(obj) должна переиндексировать все элементы, чтобы освободить место для нового obj, и, если массив большой, на это потребуется время. То же самое с arr.shift().
Единственные структурные изменения, не требующие массовой переиндексации – это изменения, которые выполняются с конца массива: arr.push/pop. Таким образом, массив может быть довольно медленным для больших очередей, когда нам приходится работать с его началом.
Или же, если нам действительно нужны быстрые вставка/удаление, мы можем выбрать другую структуру данных, называемую связанный список.
Элемент связанного списка определяется рекурсивно как объект с:
	- value,
	- next – свойство, ссылающееся на следующий элемент связанного списка или null, если это последний элемент.
Пример:
	let list = {
		value: 1, next: {
			value: 2, next: {
				value: 3, next: {
					value: 4, next: null
				}
			}
		}
	};
Альтернативный код для создания:
	let list = { value: 1 };
	list.next = { value: 2 };
	list.next.next = { value: 3 };
	list.next.next.next = { value: 4 };
	list.next.next.next.next = null;
Здесь мы можем ещё лучше увидеть, что есть несколько объектов, каждый из которых имеет value и next, указывающий на соседа. Переменная list является первым объектом в цепочке, поэтому, следуя по указателям next из неё, мы можем попасть в любой элемент.
Список можно легко разделить на несколько частей и впоследствии объединить обратно:
	let secondList = list.next.next;
	list.next.next = null;
Для объединения:
	list.next.next = secondList;
И, конечно, мы можем вставить или удалить элементы из любого места.
Например, для добавления нового элемента нам нужно обновить первый элемент списка:
	let list = { value: 1 };
	list.next = { value: 2 };
	list.next.next = { value: 3 };
	list.next.next.next = { value: 4 };
	list.next.next.next.next = null;
	list = { value: "new item", next: list }; // добавление нового элемента в список
Чтобы удалить элемент из середины списка, нужно изменить значение next предыдущего элемента:
	list.next = list.next.next;
list.next перепрыгнуло с 1 на значение 2. Значение 1 теперь исключено из цепочки. Если оно не хранится где-нибудь ещё, оно будет автоматически удалено из памяти.
В отличие от массивов, нет перенумерации, элементы легко переставляются.
Естественно, списки не всегда лучше массивов. В противном случае все пользовались бы только списками.
Главным недостатком является то, что мы не можем легко получить доступ к элементу по его индексу. В простом массиве: arr[n] является прямой ссылкой. Но в списке мы должны начать с первого элемента и перейти в next N раз, чтобы получить N-й элемент.
…Но нам не всегда нужны такие операции. Например, нам может быть нужна очередь или даже двухсторонняя очередь – это упорядоченная структура, которая позволяет очень быстро добавлять/удалять элементы с обоих концов, но там не нужен доступ в середину.
Списки могут быть улучшены:
	- Можно добавить свойство prev в дополнение к next для ссылки на предыдущий элемент, чтобы легко двигаться по списку назад.
	- Можно также добавить переменную tail, которая будет ссылаться на последний элемент списка (и обновлять её при добавлении/удалении элементов с конца).
	- Возможны другие изменения: главное, чтобы структура данных соответствовала нашим задачам с точки зрения производительности и удобства.

Итого:
Термины:
	Рекурсия – это термин в программировании, означающий вызов функцией самой себя. Рекурсивные функции могут быть использованы для элегантного решения определённых задач.
	Когда функция вызывает саму себя, это называется шагом рекурсии. База рекурсии – это такие аргументы функции, которые делают задачу настолько простой, что решение не требует дальнейших вложенных вызовов.
	Рекурсивно определяемая структура данных – это структура данных, которая может быть определена с использованием самой себя.
	Например, связанный список может быть определён как структура данных, состоящая из объекта, содержащего ссылку на список (или null).
		list = { value, next -> list }
	Деревья, такие как дерево HTML-элементов или дерево отделов из этой главы, также являются рекурсивными: у них есть ветви, и каждая ветвь может содержать другие ветви.
	Как мы видели в примере sumSalary, рекурсивные функции могут быть использованы для прохода по ним.
Любая рекурсивная функция может быть переписана в итеративную. И это иногда требуется для оптимизации работы. Но для многих задач рекурсивное решение достаточно быстрое и простое в написании и поддержке.

Задачи: 1+- 2+- 3+- 4-+- 5+-
1. Вычислить сумму чисел до данного (важность: 5)
Напишите функцию sumTo(n), которая вычисляет сумму чисел 1 + 2 + ... + n.
Например:
	sumTo(1) = 1
	sumTo(2) = 2 + 1 = 3
	sumTo(3) = 3 + 2 + 1 = 6
	sumTo(4) = 4 + 3 + 2 + 1 = 10
	...
	sumTo(100) = 100 + 99 + ... + 2 + 1 = 5050
Сделайте три варианта решения:
- 1.1. С использованием цикла.
- 1.2. Через рекурсию, т.к. sumTo(n) = n + sumTo(n-1) for n > 1.
- 1.3. С использованием формулы арифметической прогрессии.
Пример работы вашей функции:
	function sumTo(n) { /*... ваш код ... */ }
	alert( sumTo(100) ); // 5050
P.S. Какой вариант решения самый быстрый? Самый медленный? Почему?
P.P.S. Можно ли при помощи рекурсии посчитать sumTo(100000)?
решение:
	// 1.1. С использованием цикла.
	function sumTo1(n){
		let sum = 0;
		for (let i = 0; i <= n; i++) sum += i;
		return sum;
	}
	// 1.2. Через рекурсию, т.к. sumTo(n) = n + sumTo(n-1) for n > 1.
	function sumTo2(n) {
		if (n == 1) return 1;
		return n + sumTo2(n - 1);
	}
	// 1.3. С использованием формулы арифметической прогрессии.
	function sumTo3(n) {
		return n * (n + 1) / 2;
	}
P.S. Решение по формуле (1.3) работает быстрее всех. Оно использует всего три операции для любого n, а цикл и рекурсия требуют как минимум n операций сложения. Вариант с циклом (1.1) – второй по скорости. Он быстрее рекурсии (1.2), так как операций сложения столько же, но нет дополнительных вычислительных затрат на организацию вложенных вызовов. Поэтому рекурсия в данном случае работает медленнее всех.
P.P.S. Некоторые движки поддерживают оптимизацию "хвостового вызова": если рекурсивный вызов является самым последним в функции, без каких-либо других вычислений, то внешней функции не нужно будет возобновлять выполнение и не нужно запоминать контекст его выполнения. В итоге требования к памяти снижаются. Но если JS-движок не поддерживает это (большинство не поддерживают), будет ошибка: максимальный размер стека превышен, так как обычно существует ограничение на максимальный размер стека.
2. Вычислить факториал (важность: 4)
Факториал натурального числа – это число, умноженное на "себя минус один", затем на "себя минус два", и так далее до 1. Факториал n обозначается как n! Определение факториала можно записать как:
	n! = n * (n - 1) * (n - 2) * ... * 1
Примеры значений для разных n:
	1! = 1
	2! = 2 * 1 = 2
	3! = 3 * 2 * 1 = 6
	4! = 4 * 3 * 2 * 1 = 24
	5! = 5 * 4 * 3 * 2 * 1 = 120
Задача – написать функцию factorial(n), которая возвращает n!, используя рекурсию.
	alert( factorial(5) ); // 120
P.S. Подсказка: n! можно записать как n * (n-1)! Например: 3! = 3*2! = 3*2*1! = 6
решение:
	function factorial(n){
		return (!n) ? 1 : n * factorial(n - 1);
	};
	console.log(factorial(5)); // 120
// учебник:
По определению факториал n! можно записать как n * (n-1)!.
Другими словами, factorial(n) можно получить как n умноженное на результат factorial(n-1). И результат для n-1, в свою очередь, может быть вычислен рекурсивно и так далее до 1.
	function factorial(n) {
		return (n != 1) ? n * factorial(n - 1) : 1;
	}
	alert( factorial(5) ); // 120
Базисом рекурсии является значение 1. А можно было бы сделать базисом и 0, однако это добавило рекурсии дополнительный шаг:
	function factorial(n) {
		return n ? n * factorial(n - 1) : 1;
	}
	alert( factorial(5) ); // 120

3. Числа Фибоначчи (важность: 5)
Последовательность чисел Фибоначчи определяется формулой Fn = Fn-1 + Fn-2. То есть, следующее число получается как сумма двух предыдущих.
Первые два числа равны 1, затем 2(1+1), затем 3(1+2), 5(2+3) и так далее: 1, 1, 2, 3, 5, 8, 13, 21....
Числа Фибоначчи тесно связаны с золотым сечением и множеством природных явлений вокруг нас.
Напишите функцию fib(n) которая возвращает n-е число Фибоначчи.
Пример работы:
	function fib(n) { /* ваш код */ }
	alert(fib(3)); // 2
	alert(fib(7)); // 13
	alert(fib(77)); // 5527939700884757
P.S. Все запуски функций из примера выше должны работать быстро. Вызов fib(77) должен занимать не более доли секунды.
решение:
// мой код
	function fib(n){
		let numb, arr = [];
		for (let i = 2; i <= n+1; i++){
			arr[0] = 1;
			arr[1] = 1;
			numb = arr[i-1] + arr[i-2];
			arr.push(numb);
		}
		return arr[n-1];
	}
	console.log(fib(3)); // 2
	console.log(fib(7)); // 13
	console.log(fib(77)); // 5527939700884757
// учебник
	Сначала решим через рекурсию.
	Числа Фибоначчи рекурсивны по определению:
		function fib(n) {
			return n <= 1 ? n : fib(n - 1) + fib(n - 2);
		}
		alert( fib(3) ); // 2
		alert( fib(7) ); // 13
		// fib(77); // вычисляется очень долго
	При больших значениях n такое решение будет работать очень долго. Например, fib(77) может повесить браузер на некоторое время, съев все ресурсы процессора.
	Это потому, что функция порождает обширное дерево вложенных вызовов. При этом ряд значений вычисляется много раз снова и снова.
	Например, посмотрим на отрывок вычислений для fib(5):
		...
		fib(5) = fib(4) + fib(3)
		fib(4) = fib(3) + fib(2)
		...
	Здесь видно, что значение fib(3) нужно одновременно и для fib(5) и для fib(4). В коде оно будет вычислено два раза, совершенно независимо.
	Можно заметить, что fib(3) вычисляется дважды, а fib(2) – трижды. Общее количество вычислений растёт намного быстрее, чем n, что делает его огромным даже для n=77.
	Можно это оптимизировать, запоминая уже вычисленные значения: если значение, скажем, fib(3) вычислено однажды, затем мы просто переиспользуем это значение для последующих вычислений.
	Другим вариантом было бы отказаться от рекурсии и использовать совершенно другой алгоритм на основе цикла.
	Вместо того, чтобы начинать с n и вычислять необходимые предыдущие значения, можно написать цикл, который начнёт с 1 и 2, затем из них получит fib(3) как их сумму, затем fib(4)как сумму предыдущих значений, затем fib(5) и так далее, до финального результата. На каждом шаге нам нужно помнить только значения двух предыдущих чисел последовательности.
	Вот детальные шаги нового алгоритма.
	Начало:
	// a = fib(1), b = fib(2), эти значения по определению равны 1
	let a = 1, b = 1;
	// получим c = fib(3) как их сумму
	let c = a + b;
	/* теперь у нас есть fib(1), fib(2), fib(3)
	a  b  c
	1, 1, 2
	*/
	Теперь мы хотим получить fib(4) = fib(2) + fib(3).
	Переставим переменные: a,b, присвоим значения fib(2),fib(3), тогда c можно получить как их сумму:
	a = b; // теперь a = fib(2)
	b = c; // теперь b = fib(3)
	c = a + b; // c = fib(4)
	/* имеем последовательность: a  b  c : 1, 1, 2, 3 */
	Следующий шаг даёт новое число последовательности:
	a = b; // now a = fib(3)
	b = c; // now b = fib(4)
	c = a + b; // c = fib(5)
	/* последовательность теперь (на одно число больше): a  b  c : 1, 1, 2, 3, 5 */
	…И так далее, пока не получим искомое значение. Это намного быстрее рекурсии и не требует повторных вычислений.
	Полный код:
	function fib(n) {
		let a = 1;
		let b = 1;
		for (let i = 3; i <= n; i++) {
			let c = a + b;
			a = b;
			b = c;
		}
		return b;
	}
	alert( fib(3) ); // 2
	alert( fib(7) ); // 13
	alert( fib(77) ); // 5527939700884757
	Цикл начинается с i=3, потому что первое и второе значения последовательности заданы a=1, b=1.
	Такой способ называется динамическое программирование снизу вверх ['https://ru.wikipedia.org/wiki/Динамическое_программирование'].

4. Вывод односвязного списка (важность: 5)
Допустим, у нас есть односвязный список (как описано в главе Рекурсия и стек):
	let list = {
		value: 1, next: {
			value: 2, next: {
				value: 3, next: {
					value: 4, next: null
				}
			}
		}
	};
Напишите функцию printList(list), которая выводит элементы списка по одному.
Сделайте два варианта решения: используя цикл и через рекурсию.
Как лучше: с рекурсией или без?
решение:
	function printList(list){// моё
		Object.entries(list).forEach(function([key, val]) {
			if (val !=null && typeof val == 'object') printList(val);
			console.log(key, ':', val);
		});
	}
	printList(list);// value : 1 value : 2 value : 3 value : 4 next : null next : {value: 4, next: null} next : {value: 3, next: {…}} next : {value: 2, next: {…}}
// учебник
	1. Решение с использованием цикла:
		function printList2(list) {
			let tmp = list;
			while (tmp) {
				console.log(tmp.value);
				tmp = tmp.next;
			}
		}
		printList2(list); // 1 2 3 4
	Обратите внимание, что мы используем временную переменную tmp для перемещения по списку. Технически, мы могли бы использовать параметр функции list вместо неё, но это было бы неблагоразумно. В будущем нам может понадобиться расширить функцию, сделать что-нибудь ещё со списком. Если мы меняем list, то теряем такую возможность.
	Говоря о хороших именах для переменных, list здесь – это сам список, его первый элемент. Так и должно быть, это просто и понятно.
	С другой стороны, tmp используется исключительно для обхода списка, как i в цикле for.
	//!! ошибка в задача 4 - в задании надо вывести элементы списка (?все), а в решении выводятся только числовые значения...
	2. Решение через рекурсию.
	Рекурсивный вариант printList(list) следует простой логике: для вывода списка мы должны вывести текущий list, затем сделать то же самое для list.next:
		function printList3(list) {
			console.log(list.value); // выводим текущий элемент
			if (list.next) printList3(list.next); // делаем то же самое для остальной части списка
		}
		printList(list); // 1 2 3 4
	Какой способ лучше? Технически, способ с циклом более эффективный. В обеих реализациях делается то же самое, но для цикла не тратятся ресурсы для вложенных вызовов. С другой стороны, рекурсивный вариант более короткий и, возможно, более простой для понимания.
5. Вывод односвязного списка в обратном порядке (важность: 5)
Выведите односвязный список из предыдущего задания "Вывод односвязного списка" в обратном порядке.
Сделайте два решения: с использованием цикла и через рекурсию.
решение:
// моё -  цикл
	function printListInverse1(list){
		let tmp = list;
		let arr = [];
		while (tmp) {
			arr.push(tmp.value);
			tmp = tmp.next;
		}
		arr.reverse().forEach((val) => console.log(val));
	}
	printListInverse1(list); // 4 3 2 1
// учебник 
	5.1. С использованием рекурсии
	Рекурсивная логика в этом случае немного сложнее.
	Сначала надо вывести оставшуюся часть списка, а затем текущий элемент:
		function printReverseList(list) {
			if (list.next) printReverseList(list.next);
			console.log(list.value);
		}
		printReverseList(list); // 4 3 2 1
	5.2. С использованием цикла
	Вариант с использованием цикла сложнее, чем в предыдущей задаче. Нет способа сразу получить последнее значение в списке list. Мы также не можем вернуться назад, к предыдущему элементу списка. Поэтому мы можем сначала перебрать элементы в прямом порядке и запомнить их в массиве, а затем вывести то, что мы запомнили, в обратном порядке:
	function printReverseList(list) {
		let arr = [];
		let tmp = list;
		while (tmp) {
			arr.push(tmp.value);
			tmp = tmp.next;
		}
		for (let i = arr.length - 1; i >= 0; i--) console.log(arr[i]);
	}
	printReverseList(list);
	Обратите внимание, что рекурсивное решение на самом деле делает то же самое: проходит список, запоминает элементы в цепочке вложенных вызовов (в контексте выполнения), а затем выводит их.

#1.6.2. Остаточные параметры и оператор расширения
22.3.25 - https://learn.javascript.ru/rest-parameters-spread-operator
Многие встроенные функции JS поддерживают произвольное количество аргументов.
Например:
	Math.max(arg1, arg2, ..., argN) // вычисляет максимальное число из переданных.
	Object.assign(dest, src1, ..., srcN) // копирует свойства из исходных объектов src1..N в целевой объект dest.
…и так далее.
В этой главе мы узнаем, как сделать то же самое с нашими собственными функциями и как передавать таким функциям параметры в виде массива.

Остаточные параметры (...).
Вызывать функцию можно с любым количеством аргументов независимо от того, как она была определена.
Например:
	function sum(a, b) {return a + b};
	alert( sum(1, 2, 3, 4, 5) );
Лишние аргументы не вызовут ошибку. Но, конечно, посчитаются только первые два.
Остаточные параметры могут быть обозначены через три точки ... . Буквально это значит: "собери оставшиеся параметры и положи их в массив".
Например, соберём все аргументы в массив args:
	function sumAll(...args) { // args — имя массива
		let sum = 0;
		for (let arg of args) sum += arg;
		return sum;
	}
	alert( sumAll(1) ); // 1
	alert( sumAll(1, 2) ); // 3
	alert( sumAll(1, 2, 3) ); // 6
Мы можем положить первые несколько параметров в переменные, а остальные – собрать в массив.
В примере ниже первые два аргумента функции станут именем и фамилией, а третий и последующие превратятся в массив titles:
	function showName(firstName, lastName, ...titles) {
		alert( firstName + ' ' + lastName ); // Юлий Цезарь
		// Оставшиеся параметры пойдут в массив
		// titles = ["Консул", "Император"]
		alert( titles[0] ); // Консул
		alert( titles[1] ); // Император
		alert( titles.length ); // 2
	}
	showName("Юлий", "Цезарь", "Консул", "Император");

Остаточные параметры должны располагаться в конце.
Остаточные параметры собирают все остальные аргументы, поэтому бессмысленно писать что-либо после них. Это вызовет ошибку:
	function f(arg1, ...rest, arg2) { // arg2 после ...rest ?!
		// Ошибка
	}
...rest должен всегда быть последним.

Переменная "arguments".
Все аргументы функции находятся в псевдомассиве arguments под своими порядковыми номерами.
Например:
	function showName() {
		alert( arguments.length );
		alert( arguments[0] );
		alert( arguments[1] );
		// Объект arguments можно перебирать
		// for (let arg of arguments) alert(arg);
	}
	showName("Юлий", "Цезарь"); // Вывод: 2, Юлий, Цезарь
	showName("Илья"); // Вывод: 1, Илья, undefined (второго аргумента нет)
Раньше в языке не было остаточных параметров, и получить все аргументы функции можно было только с помощью arguments. Этот способ всё ещё работает, мы можем найти его в старом коде.
Но у него есть один недостаток. Хотя arguments похож на массив, и его тоже можно перебирать, это всё же не массив. Он не поддерживает методы массивов, поэтому мы не можем, например, вызвать arguments.map(...).
К тому же, arguments всегда содержит все аргументы функции — мы не можем получить их часть. А остаточные параметры позволяют это сделать.
Соответственно, для более удобной работы с аргументами лучше использовать остаточные параметры.

Стрелочные функции не имеют "arguments".
Если мы обратимся к arguments из стрелочной функции, то получим аргументы внешней "нормальной" функции.
Пример:
	function f() {
		let showArg = () => alert(arguments[0]);
		showArg(2);
	}
	f(1); // 1
Как мы помним, у стрелочных функций нет собственного this. Теперь мы знаем, что нет и своего объекта arguments.

Оператор расширения.
Мы узнали, как получить массив из списка параметров.
Но иногда нужно сделать в точности противоположное.
Например, есть встроенная функция Math.max. Она возвращает наибольшее число из списка:
	alert( Math.max(3, 5, 1) ); // 5
Допустим, у нас есть массив чисел [3, 5, 1]. Как вызвать для него Math.max?
Просто так их не вставишь — Math.max ожидает получить список чисел, а не один массив.
	let arr = [3, 5, 1];
	alert( Math.max(arr) ); // NaN
Конечно, мы можем вводить числа вручную : Math.max(arr[0], arr[1], arr[2]). Но, во-первых, это плохо выглядит, а, во-вторых, мы не всегда знаем, сколько будет аргументов. Их может быть как очень много, так и не быть совсем.
И тут нам поможет оператор расширения. Он похож на остаточные параметры – тоже использует ..., но делает совершенно противоположное.
Когда ...arr используется при вызове функции, он "расширяет" перебираемый объект arr в список аргументов.
Для Math.max:
	let arr = [3, 5, 1];
	alert( Math.max(...arr) ); // 5 (оператор ... раскрывает массив arr в список аргументов)
Этим же способом мы можем передать несколько итерируемых объектов:
	let arr1 = [1, -2, 3, 4];
	let arr2 = [8, 3, -8, 1];
	alert( Math.max(...arr1, ...arr2) ); // 8
Мы даже можем комбинировать оператор расширения с обычными значениями:
	let arr1 = [1, -2, 3, 4];
	let arr2 = [8, 3, -8, 1];
	alert( Math.max(1, ...arr1, 2, ...arr2, 25) ); // 25
Оператор расширения можно использовать и для слияния массивов:
	let arr = [3, 5, 1];
	let arr2 = [8, 9, 15];
	let merged = [0, ...arr, 2, ...arr2];
	alert(merged); // 0,3,5,1,2,8,9,15 (0, затем arr, затем 2, в конце arr2)
В примерах выше мы использовали массив, чтобы продемонстрировать свойства оператора расширения, но он работает с любым перебираемым объектом.
Например, оператор расширения подойдёт для того, чтобы превратить строку в массив символов:
	let str = "Привет";
	alert( [...str] ); // П,р,и,в,е,т
Посмотрим, что происходит. Под капотом оператор расширения использует итераторы, чтобы перебирать элементы. Так же, как это делает for..of.
Цикл for..of перебирает строку как последовательность символов, поэтому из ...str получается "П", "р", "и", "в", "е", "т". Получившиеся символы собираются в массив при помощи стандартного объявления массива: [...str].
Для этой задачи мы можем использовать и Array.from. Он тоже преобразует перебираемый объект (такой как строка) в массив:
	let str = "Привет";
	// Array.from преобразует перебираемый объект в массив
	alert( Array.from(str) ); // П,р,и,в,е,т
Результат аналогичен [...str].
Но между Array.from(obj) и [...obj] есть разница: 
	- Array.from работает как с псевдомассивами, так и с итерируемыми объектами
	- Оператор расширения работает только с итерируемыми объектами
Выходит, что если нужно сделать из чего угодно массив, то Array.from — более универсальный метод.

Итого:
Когда мы видим "..." в коде, это могут быть как остаточные параметры, так и оператор расширения.
Как отличить их друг от друга:
	- Если ... располагается в конце списка параметров функции, то это "остаточные параметры". Он собирает остальные неуказанные аргументы и делает из них массив.
	- Если ... встретился в вызове функции или где-либо ещё, то это "оператор расширения". Он извлекает элементы из массива.
Полезно запомнить:
	- Остаточные параметры используются, чтобы создавать новые функции с неопределённым числом аргументов.
	- С помощью оператора расширения можно вставить массив в функцию, которая по умолчанию работает с обычным списком аргументов.
Вместе эти конструкции помогают легко преобразовывать наборы значений в массивы и обратно.
К аргументам функции можно обращаться и по-старому — через псевдомассив arguments.

#1.6.3. Область видимости переменных, замыкание
23.3.25 - https://learn.javascript.ru/closure
JavaScript – язык с сильным функционально-ориентированным уклоном. Он даёт нам много свободы. Функция может быть динамически создана, скопирована в другую переменную или передана как аргумент другой функции и позже вызвана из совершенно другого места.
Мы знаем, что функция может получить доступ к переменным из внешнего окружения, эта возможность используется очень часто.
Но что произойдёт, когда внешние переменные изменятся? Функция получит последнее значение или то, которое существовало на момент создания функции?
И что произойдёт, когда функция переместится в другое место в коде и будет вызвана оттуда – получит ли она доступ к внешним переменным своего нового местоположения? Разные языки ведут себя по-разному в таких случаях, и в этой главе мы рассмотрим поведение JavaScript.

Мы будем говорить здесь о переменных let/const.
В JS существует три способа объявить переменную: let, const (современные), и var (пережиток прошлого). В этой статье мы будем использовать переменные let в примерах. Переменные, объявленные с помощью const, ведут себя так же, так что эта статья и о них.
Старые переменные var имеют несколько характерных отличий, они будут рассмотрены в главе Устаревшее ключевое слово "var".

Блоки кода.
Если переменная объявлена внутри блока кода {...}, то она видна только внутри этого блока.
Например:
	{ // выполняем некоторые действия с локальной переменной, которые не должны быть видны снаружи
		let message = "Hello"; // переменная видна только в этом блоке
		alert(message); // Hello
	}
	alert(message); // ReferenceError: message is not defined
С помощью блоков {...} мы можем изолировать часть кода, выполняющую свою собственную задачу, с переменными, принадлежащими только ей:
	{ // показать сообщение
		let message = "Hello";
		alert(message);
	}
	{ // показать другое сообщение
		let message = "Goodbye";
		alert(message);
	}
Без блоков была бы ошибка.
Обратите внимание, что без отдельных блоков возникнет ошибка, если мы используем let с существующим именем переменной:
	// показать сообщение
	let message = "Hello";
	alert(message);
	// показать другое сообщение
	let message = "Goodbye"; // SyntaxError: Identifier 'message' has already been declared
	alert(message);
Для if, for, while и т.д. переменные, объявленные в блоке кода {...}, также видны только внутри:
	if (true) {
		let phrase = "Hello";
		alert(phrase); // Hello
	}
	alert(phrase); // Ошибка, нет такой переменной!
В этом случае после завершения работы if нижний alert не увидит phrase, что и приведет к ошибке.
И это замечательно, поскольку это позволяет нам создавать блочно-локальные переменные, относящиеся только к ветви if.
То же самое можно сказать и про циклы for и while:
	for (let i = 0; i < 3; i++) { // переменная i видна только внутри for
		alert(i); // 0, потом 1, потом 2
	}
	alert(i); // Ошибка, нет такой переменной!
Визуально let i = 0; находится вне блока кода {...}, однако здесь в случае с for есть особенность: переменная, объявленная внутри (...), считается частью блока for(){}.

Вложенные функции.
Функция называется вложенной, когда она создаётся внутри другой функции.
Это очень легко сделать в JS.
Мы можем использовать это для упорядочивания нашего кода, например, как здесь:
	function sayHiBye(firstName, lastName) {
		function getFullName() { // функция-помощник, которую мы используем ниже
			return firstName + " " + lastName;
		}
		alert( "Hello, " + getFullName() );
		alert( "Bye, " + getFullName() );
	}
Здесь вложенная функция getFullName() создана для удобства. Она может получить доступ к внешним переменным и, значит, вывести полное имя. В JS вложенные функции используются очень часто.
Что ещё интереснее, вложенная функция может быть возвращена: либо в качестве свойства нового объекта (если внешняя функция создаёт объект с методами), либо сама по себе. И затем может быть использована в любом месте. Не важно где, она всё так же будет иметь доступ к тем же внешним переменным.
Ниже, makeCounter создает функцию-счётчик, которая при каждом вызове возвращает следующее число:
	function makeCounter() {
		let count = 0;
		return function() {
			return count++; // есть доступ к внешней переменной "count"
		};
	}
	let counter = makeCounter();
	alert( counter() ); // 0
	alert( counter() ); // 1
	alert( counter() ); // 2
Несмотря на простоту этого примера, немного модифицированные его варианты применяются на практике, например, в генераторе псевдослучайных чисел и во многих других случаях.
Как это работает? Если мы создадим несколько таких счётчиков, будут ли они независимыми друг от друга? Что происходит с переменными?
Понимание таких вещей полезно для повышения общего уровня владения JS и для более сложных сценариев. Так что давайте немного углубимся.

Лексическое окружение.
Для большей наглядности объяснение разбито на несколько шагов.

Шаг 1. Переменные.

В JS у каждой выполняемой функции, блока кода {...} и скрипта есть связанный с ними внутренний (скрытый) объект, называемый лексическим окружением LexicalEnvironment.
Объект лексического окружения состоит из двух частей:
	1. Environment Record – объект, в котором как свойства хранятся все локальные переменные (а также некоторая другая информация, такая как значение this).
	2. Ссылка на внешнее лексическое окружение – то есть то, которое соответствует коду снаружи (снаружи от текущих фигурных скобок).
Переменная – это просто свойство специального внутреннего объекта: Environment Record. Получить или изменить переменную, означает, получить или изменить свойство этого объекта.
Например, в этом простом коде только одно лексическое окружение:
	let phrase = "Hello";  // Лексическое Окружение: phrase: "Hello" ---(outer)--> null
Это, так называемое, глобальное лексическое окружение, связанное со всем скриптом.
На картинке выше прямоугольник означает Environment Record (хранилище переменных), а стрелка означает ссылку на внешнее окружение. У глобального лексического окружения нет внешнего окружения, так что она указывает на null.
По мере выполнения кода лексическое окружение меняется.
Вот более длинный код:
	начало выполнения 		phrase: <uninitialized> ---(outer)--> null
	let phrase;				phrase: undefined
	phrase = "Hello";		phrase: "Hello"
	phrase = "Bye";			phrase: "Bye"
Свойства с правой стороны демонстрируют, как глобальное лексическое окружение изменяется в процессе выполнения кода:
	1. При запуске скрипта лексическое окружение предварительно заполняется всеми объявленными переменными.
		Изначально они находятся в состоянии <uninitialized>. Это особое внутреннее состояние, которое означает, что движок знает о переменной, но на нее нельзя ссылаться, пока она не будет объявлена с помощью let. Это почти то же самое, как если бы переменная не существовала.
	2. Появляется определение переменной let phrase. У неё ещё нет присвоенного значения, поэтому присваивается undefined. С этого момента мы можем использовать переменную.
	3. Переменной phrase присваивается значение.
	4. Переменная phrase меняет значение.
Пока что всё выглядит просто, правда?
	- Переменная – это свойство специального внутреннего объекта, связанного с текущим выполняющимся блоком/функцией/скриптом.
	- Работа с переменными – это на самом деле работа со свойствами этого объекта.

Лексическое окружение – объект спецификации.
Лексическое окружение – это объект спецификации: он существует только теоретически в спецификации языка для описания того, как все работает. Мы не можем получить этот объект в нашем коде и манипулировать им напрямую.
JS-движки также могут оптимизировать его, отбрасывать неиспользуемые переменные для экономии памяти и выполнять другие внутренние действия, но при этом видимое поведение остается таким, как описано.

Шаг 2. Function Declaration.
Функция – это тоже значение, как и переменная.
Разница заключается в том, что Function Declaration мгновенно инициализируется полностью.
Когда создается лексическое окружение, Function Declaration сразу же становится функцией, готовой к использованию (в отличие от let, который до момента объявления не может быть использован).
Именно поэтому мы можем вызвать функцию, объявленную как Function Declaration, до самого её объявления.
Вот, к примеру, начальное состояние глобального лексического окружения при добавлении функции:
	начало выполнения					phrase: <uninitialized> 
										say: function  			---(outer)--> null
	let phrase = "Hello"; 					...
	function say(name){alert(phrase, name)}
Конечно, такое поведение касается только Function Declaration, а не Function Expression, в которых мы присваиваем функцию переменной, 
например, let say = function(name) {...}.

Шаг 3. Внутреннее и внешнее лексическое окружение
Когда запускается функция, в начале ее вызова автоматически создается новое лексическое окружение для хранения локальных переменных и параметров вызова.
Например, для say("John") это выглядит так (выполнение находится на строке, отмеченной стрелкой):
	let phrase = "Hello"; 						Лексическое Окружение вызова				
	function say(name){alert(phrase, name)}		name: "John" ---(outer)-->  say: function 	---(outer)--> null
																			phrase: "Hello" 
	say("John");
В процессе вызова функции у нас есть два лексических окружения: внутреннее (для вызываемой функции) и внешнее (глобальное):
	- Внутреннее лексическое окружение соответствует текущему выполнению say.
		В нём находится одна переменная name, параметр функции. Мы вызываем say("John"), так что значение переменной name равно "John".
	- Внешнее лексическое окружение – это глобальное лексическое окружение.
		В нём находятся переменная phrase и сама функция.
У внутреннего лексического окружения есть ссылка на внешнее outer.
Когда код хочет получить доступ к переменной – сначала происходит поиск во внутреннем лексическом окружении, затем во внешнем, затем в следующем и так далее, до глобального.
Если переменная не была найдена, это будет ошибкой в строгом режиме (use strict). Без строгого режима, для обратной совместимости, присваивание несуществующей переменной создаёт новую глобальную переменную с таким же именем.
Давайте посмотрим, как происходит поиск в нашем примере:
	- Для переменной name, alert внутри say сразу же находит ее во внутреннем лексическом окружении.
	- Когда alert хочет получить доступ к phrase, он не находит её локально, поэтому вынужден обратиться к внешнему лексическому окружению и находит phrase там.

Шаг 4. Возврат функции
Давайте вернёмся к примеру с makeCounter:
	function makeCounter(){
		let count = 0;
		return function(){return count++};
	}
	let counter = makeCounter();
В начале каждого вызова makeCounter() создается новый объект лексического окружения, в котором хранятся переменные для конкретного запуска makeCounter.
Таким образом, мы имеем два вложенных лексических окружения, как в примере выше.
Отличие заключается в том, что во время выполнения makeCounter() создается крошечная вложенная функция, состоящая всего из одной строки: return count++. Мы ее еще не запускаем, а только создаем.
Все функции помнят лексическое окружение, в котором они были созданы. Технически здесь нет никакой магии: все функции имеют скрытое свойство [[Environment]], которое хранит ссылку на лексическое окружение, в котором была создана функция.
Таким образом, counter.[[Environment]] имеет ссылку на {count: 0} лексического окружения. Так функция запоминает, где она была создана, независимо от того, где она вызывается. Ссылка на [[Environment]] устанавливается один раз и навсегда при создании функции.
Впоследствии, при вызове counter(), для этого вызова создается новое лексическое окружение, а его внешняя ссылка на лексическое окружение берется из counter.[[Environment]].
Теперь, когда код внутри counter() ищет переменную count, он сначала ищет ее в собственном лексическом окружении (пустом, так как там нет локальных переменных), а затем в лексическом окружении внешнего вызова makeCounter(), где находит count и изменяет ее.
Переменная обновляется в том лексическом окружении, в котором она существует.
Если мы вызовем counter() несколько раз, то в одном и том же месте переменная count будет увеличена до 2, 3 и т.д.

Замыкания. ['https://ru.wikipedia.org/wiki/Замыкание_(программирование)']
В программировании есть общий термин: замыкание (closure), – который должен знать каждый разработчик.
Замыкание – это функция, которая запоминает свои внешние переменные и может получить к ним доступ. В некоторых языках это невозможно, или функция должна быть написана специальным образом, чтобы получилось замыкание. Но, как было описано выше, в JS, все функции изначально являются замыканиями (есть только одно исключение, про которое будет рассказано в главе Синтаксис "new Function"). То есть они автоматически запоминают, где были созданы, с помощью скрытого свойства [[Environment]], и все они могут получить доступ к внешним переменным.

Сборка мусора.
Обычно лексическое окружение удаляется из памяти вместе со всеми переменными после завершения вызова функции. Это связано с тем, что на него нет ссылок. Как и любой объект JS, оно хранится в памяти только до тех пор, пока к нему можно обратиться.
Однако если существует вложенная функция, которая все еще доступна после завершения функции, то она имеет свойство [[Environment]], ссылающееся на лексическое окружение.
В этом случае лексическое окружение остается доступным даже после завершения работы функции.
Например:
	function f() {
		let value = 123;
		return function(){alert(value)}
	}
	let g = f(); // g.[[Environment]] хранит ссылку на лексическое окружение из соответствующего вызова f()
Обратите внимание, что если f() вызывается много раз и результирующие функции сохраняются, то все соответствующие объекты лексического окружения также будут сохранены в памяти. В приведенном ниже коде – все три:
	function f() {
		let value = Math.random();
		return function() { alert(value) };
	}
	let arr = [f(), f(), f()]; // 3 функции в массиве, каждая из которых ссылается на лексическое окружение из соответствующего вызова f()
Объект лексического окружения исчезает, когда становится недоступным (как и любой другой объект). Другими словами, он существует только до тех пор, пока на него ссылается хотя бы одна вложенная функция.
В приведенном ниже коде после удаления вложенной функции ее окружающее лексическое окружение (а значит, и value) очищается из памяти:
	function f() {
		let value = 123;
		return function() {alert(value)}
	}
	let g = f(); // пока существует функция g, value остается в памяти
	g = null; // ...и теперь память очищена.

Оптимизация на практике.
Как мы видели, в теории, пока функция жива, все внешние переменные тоже сохраняются.
Но на практике движки JS пытаются это оптимизировать. Они анализируют использование переменных и, если легко по коду понять, что внешняя переменная не используется – она удаляется.
Одним из важных побочных эффектов в V8 (Chrome, Edge, Opera) является то, что такая переменная становится недоступной при отладке.
Попробуйте запустить следующий пример в Chrome с открытой Developer Tools.
Когда код будет поставлен на паузу, напишите в консоли alert(value).
	function f() {
		let value = Math.random();
		function g() {
			debugger; // в консоли: напишите alert(value); Такой переменной нет!
		}
		return g;
	}
	let g = f();
	g();
Как вы можете видеть – такой переменной не существует! В теории, она должна быть доступна, но попала под оптимизацию движка.
Это может приводить к забавным (если удаётся решить быстро) проблемам при отладке. Одна из них – мы можем увидеть не ту внешнюю переменную при совпадающих названиях:
	let value = "Сюрприз!";
	function f() {
		let value = "ближайшее значение";
		function g() {
			debugger; // в консоли: напишите alert(value); Сюрприз!
		}
		return g;
	}
	let g = f();
	g();
Эту особенность V8 полезно знать. Если вы занимаетесь отладкой в Chrome/Edge/Opera, рано или поздно вы с ней столкнётесь.
Это не баг в отладчике, а скорее особенность V8. Возможно со временем это изменится. Вы всегда можете проверить это, запустив примеры на этой странице.

Задачи: 1+ 2- 3+ 4+ 5- 6+ 7- 8+- 9-+ 10
1. Учитывает ли функция последние изменения? (важность: 5)
Функция sayHi использует имя внешней переменной. Какое значение будет использоваться при выполнении функции?
	let name = "John";
	function sayHi() {alert("Hi, " + name)}
	name = "Pete";
	sayHi(); // что будет показано: "John" или "Pete"?
Такие ситуации встречаются как при разработке для браузера, так и для сервера. Функция может быть назначена на выполнение позже, чем она была создана, например, после действия пользователя или сетевого запроса.
Итак, вопрос: учитывает ли она последние изменения?
решение: // Hi, Pete
	Ответ: Pete.
	Функция получает внешние переменные в том виде, в котором они находятся сейчас, она использует самые последние значения.
	Старые значения переменных нигде не сохраняются. Когда функция обращается к переменной, она берет текущее значение из своего или внешнего лексического окружения.

2. Какие переменные доступны? (важность: 5)
Приведенная ниже функция makeWorker создает другую функцию и возвращает ее. Эта новая функция может быть вызвана из другого места.
Будет ли она иметь доступ к внешним переменным из места своего создания, или из места вызова, или из обоих мест?
	function makeWorker() {
		let name = "Pete";
		return function() {alert(name)};
	}
	let name = "John";
	let work = makeWorker(); // создаём функцию
	work(); // вызываем её // что будет показано?
Какое значение будет показано? «Pete» или «John»?
решение: // John
	Ответ: Pete.
	Функция work() в приведенном ниже коде получает name из места его происхождения через ссылку на внешнее лексическое окружение.
	Таким образом, в результате мы получаем "Pete".
	Но если бы в makeWorker() не было let name, то поиск шел бы снаружи и брал глобальную переменную, что мы видим из приведенной выше цепочки. В этом случае результатом было бы "John".

3. Независимы ли счётчики? (важность: 5)
Здесь мы делаем два счётчика: counter и counter2, используя одну и ту же функцию makeCounter.
Они независимы? Что покажет второй счётчик? 0,1 или 2,3 или что-то ещё?
	function makeCounter() {
		let count = 0;
		return function() {return count++};
	}
	let counter = makeCounter();
	let counter2 = makeCounter();
	console.log( counter() ); // 0
	console.log( counter() ); // 1
	console.log( counter2() ); // ? 0
	console.log( counter2() ); // ? 1
решение: 
	Ответ: 0,1.
	Функции counter и counter2 созданы разными вызовами makeCounter.
	Так что у них независимые внешние лексические окружения, у каждого из которых свой собственный count.

4. Объект счётчика (важность: 5)
Здесь объект счётчика создан с помощью функции-конструктора.
Будет ли он работать? Что покажет?
	function Counter() {
		let count = 0;
		this.up = function() {return ++count};
		this.down = function() {return --count};
	}
	let counter = new Counter();
	console.log( counter.up() ); // ? 1
	console.log( counter.up() ); // ? 2
	console.log( counter.down() ); // ? 1
решение:
	Несомненно, он отлично будет работать.
	Обе вложенные функции были созданы с одним и тем же внешним лексическим окружением, так что они имеют доступ к одной и той же переменной count.

5. Функция внутри if (важность: 5)
Посмотрите на код. Какой будет результат у вызова на последней строке?
Обратите внимание: результат зависит от режима выполнения кода. Здесь используется строгий режим "use strict".
	let phrase = "Hello";
	if (true) {
	  let user = "John";
	  function sayHi() {
		console.log(`${phrase}, ${user}`);
	  }
	}
	sayHi(); // Hello, John
решение:
	Результатом будет ошибка.
	Функция sayHi объявлена внутри if, так что она живёт только внутри этого блока. Снаружи нет sayHi.
	// у меня ошибки нет.

6. Сумма с помощью замыканий (важность: 4)
Напишите функцию sum, которая работает таким образом: sum(a)(b) = a+b.
Да, именно таким образом, используя двойные круглые скобки (не опечатка).
Например:
	sum(1)(2) = 3
	sum(5)(-1) = 4
решение:
	Чтобы вторые скобки заработали, первые – должны вернуть функцию.
	function sum2 (a){
		return function(b){return a + b};
	}
	console.log(sum2(5)(7)); // 12

7. Видна ли переменная? (важность: 4)
Что выведет данный код?
	let x = 1;
	function func() {
		console.log(x); // ? 1 // Uncaught ReferenceError: Cannot access 'x' before initialization
		let x = 2;
	}
	func();
P.S. В этой задаче есть подвох. Решение не очевидно.
решение:
	ошибка: Uncaught ReferenceError: Cannot access 'x' before initialization
	В этом примере мы можем наблюдать характерную разницу между «несуществующей» и «неинициализированной» переменной.
	Как вы могли прочитать в статье, переменная находится в неинициализированном состоянии с момента входа в блок кода (или функцию). И остается неинициализированной до соответствующего оператора let.
	Другими словами, переменная технически существует, но не может быть использована до let.
	Приведенный выше код демонстрирует это.
		function func() {
		  // локальная переменная x известна движку с самого начала выполнения функции,
		  // но она является неинициализированной до let ("мёртвая зона")
		  // следовательно, ошибка
		  console.log(x); // ReferenceError: Cannot access 'x' before initialization
		  let x = 2;
		}
	Эту зону временной непригодности переменной (от начала блока кода до let) иногда называют «мёртвой зоной».

8. Фильтрация с помощью функции (важность: 5)
У нас есть встроенный метод arr.filter(f) для массивов. Он фильтрует все элементы с помощью функции f. Если она возвращает true, то элемент добавится в возвращаемый массив.
Сделайте набор "готовых к употреблению" фильтров:
	inBetween(a, b) – между a и b (включительно).
	inArray([...]) – находится в данном массиве.
Они должны использоваться таким образом:
	arr.filter(inBetween(3,6)) – выбирает только значения между 3 и 6 (включительно).
	arr.filter(inArray([1,2,3])) – выбирает только элементы, совпадающие с одним из элементов массива
Например:
	/* .. ваш код для inBetween и inArray */
	let arr = [1, 2, 3, 4, 5, 6, 7];
	alert( arr.filter(inBetween(3, 6)) ); // 3,4,5,6
	alert( arr.filter(inArray([1, 2, 10])) ); // 1,2
решение:
	arr = [1, 2, 3, 4, 5, 6, 7];
	function inBetween(a, b) {
		return function(e) {return e >= a && e <= b};
	}
	console.log(arr.filter(inBetween(3, 6))); // (4) [3, 4, 5, 6]
	function inArray(arr) {
		return function(x) {return arr.includes(x)};
	}
	console.log(arr.filter(inArray([1, 2, 10]))); // (2) [1, 2]

9. Сортировать по полю (важность: 5)
У нас есть массив объектов, который нужно отсортировать:
	let users = [
	  { name: "Иван", age: 20, surname: "Иванов" },
	  { name: "Пётр", age: 18, surname: "Петров" },
	  { name: "Анна", age: 19, surname: "Каренина" }
	];
Обычный способ был бы таким:
	users.sort((a, b) => a.name > b.name ? 1 : -1);// по имени (Анна, Иван, Пётр)
	users.sort((a, b) => a.age > b.age ? 1 : -1);// по возрасту (Пётр, Анна, Иван)
Можем ли мы сделать его короче, например вот таким?
	users.sort(byField('name'));
	users.sort(byField('age'));
То есть чтобы вместо функции мы просто писали byField(fieldName).
Напишите функцию byField, которая может быть использована для этого.
решение:
	function byField(fieldName){
		return (a, b) => a[fieldName] > b[fieldName] ? 1 : -1;
	}

10. Армия функций (важность: 5)
Следующий код создаёт массив из стрелков (shooters).
Каждая функция предназначена выводить их порядковые номера. Но что-то пошло не так…
	function makeArmy() {
		let shooters = [];
		let i = 0;
		while (i < 10) {
			let shooter = function() {console.log(i)}; // функция shooter должна выводить порядковый номер
			shooters.push(shooter); // и добавлять стрелка в массив
			i++;
		}
		return shooters; // ...а в конце вернуть массив из всех стрелков
	}
	let army = makeArmy();
	// все стрелки выводят 10 вместо их порядковых номеров (0, 1, 2, 3...)
	army[0](); // 10 от стрелка с порядковым номером 0
	army[1](); // 10 от стрелка с порядковым номером 1
	army[2](); // 10 ...и т.д.
Почему у всех стрелков одинаковые номера?
Почините код, чтобы он работал как задумано.
решение:
	Давайте посмотрим, что происходит внутри makeArmy, и решение станет очевидным.
	1. Она создаёт пустой массив shooters:
		let shooters = [];
	2. В цикле заполняет его shooters.push(function...).
	Каждый элемент – это функция, так что получится такой массив:
		shooters = [
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); },
		  function () { alert(i); }
		];
	3. Функция возвращает массив.
	Позже вызов army[5]() получит элемент army[5] из массива (это будет функция) и вызовет её.
	Теперь, почему все эти функции показывают одно и то же?
	Всё потому, что внутри функций shooter нет локальной переменной i. Когда вызывается такая функция, она берёт i из своего внешнего лексического окружения.
	Какое будет значение у i?
	Если мы посмотрим в исходный код:
		function makeArmy() {
		  ...
		  let i = 0;
		  while (i < 10) {
			let shooter = function() { // функция shooter
			  alert( i ); // должна выводить порядковый номер
			};
			shooters.push(shooter); // и добавлять стрелка в массив
			i++;
		  }
		  ...
		}
	…Мы увидим, что оно живёт в лексическом окружении, связанном с текущим вызовом makeArmy(). Но, когда вызывается army[5](), makeArmy уже завершила свою работу, и последнее значение i: 10 (конец цикла while).
	Как результат, все функции shooter получат одно и то же значение из внешнего лексического окружения: последнее значение i=10.

	Как вы можете видеть выше, на каждой итерации блока while {...} создается новое лексическое окружение. Чтобы исправить это, мы можем скопировать значение i в переменную внутри блока while {...}, например, так:
		function makeArmy() {
		  let shooters = [];
		  let i = 0;
		  while (i < 10) {
			  let j = i;
			  let shooter = function() { // функция shooter
				alert( j ); // должна выводить порядковый номер
			  };
			shooters.push(shooter);
			i++;
		  }
		  return shooters;
		}
		let army = makeArmy();
		// теперь код работает правильно
		army[0](); // 0
		army[5](); // 5
	Здесь let j = i объявляет «итерационно-локальную» переменную j и копирует в нее i. Примитивы копируются «по значению», поэтому фактически мы получаем независимую копию i, принадлежащую текущей итерации цикла. Функции shooter работают правильно, потому что значение i теперь живет чуть ближе. Не в лексическом окружении makeArmy(), а в лексическом окружении, соответствующем текущей итерации цикла.
	Этой проблемы также можно было бы избежать, если бы мы использовали for в начале, например, так:
		function makeArmy() {
			let shooters = [];
			for (let i = 0; i < 10; i++) {
				let shooter = function() { // функция shooter
					alert( i ); // должна выводить порядковый номер
				};
			shooters.push(shooter);
			}  
			return shooters;
		}
		let army = makeArmy();
		army[0](); // 0
		army[5](); // 5
	По сути, это то же самое, поскольку for на каждой итерации создает новое лексическое окружение со своей переменной i. Поэтому функция shooter, создаваемая на каждой итерации, ссылается на свою собственную переменную i, причем именно с этой итерации.
	Теперь, когда вы приложили столько усилий, чтобы прочитать это объяснение, а конечный вариант оказался так прост – использовать for, вы можете задаться вопросом – стоило ли оно того?
	Что ж, если бы вы могли легко ответить на вопрос из задачи, вы бы не стали читать решение. Так что, должно быть, эта задача помогла вам лучше понять суть дела.
	Кроме того, действительно встречаются случаи, когда человек предпочитает while, а не for, и другие сценарии, где такие проблемы реальны.

#1.6.4. Устаревшее ключевое слово "var"
24.3.25 - https://learn.javascript.ru/var
// Информация, приведенная в этой статье, полезна для понимания старых скриптов. Мы не пишем современный код таким образом.
В самой первой главе про переменные мы ознакомились с тремя способами объявления переменных: let, const, var.
let и const ведут себя одинаково по отношению к лексическому окружению, области видимости.
Но var – это совершенно другой зверь, берущий своё начало с давних времён. Обычно var не используется в современных скриптах, но всё ещё может скрываться в старых.
Если в данный момент вы не работаете с подобными скриптами, вы можете пропустить или отложить прочтение данной главы, однако, есть шанс, что вы столкнётесь с var в будущем.
На первый взгляд, поведение var похоже на let. Например, объявление переменной:
	function sayHi() {
		var phrase = "Привет"; // локальная переменная, "var" вместо "let"
		alert(phrase); // Привет
	}
	sayHi();
	alert(phrase); // Ошибка: phrase не определена
…Однако, отличия всё же есть.

Для var не существует блочной области видимости.
Область видимости переменных var ограничивается либо функцией, либо, если переменная глобальная, то скриптом. Такие переменные доступны за пределами блока.
Например:
	if (true) {var test = true}; // используем var вместо let
	alert(test); // true, переменная существует вне блока if
Так как var игнорирует блоки, мы получили глобальную переменную test.
А если бы мы использовали let test вместо var test, тогда переменная была бы видна только внутри if:
	if (true) {let test = true}; // используем let
	alert(test); // Error: test is not defined
Аналогично для циклов: var не может быть блочной или локальной внутри цикла:
	for (var i = 0; i < 10; i++) {/* ... */};
	alert(i); // 10, переменная i доступна вне цикла, т.к. является глобальной переменной
Если блок кода находится внутри функции, то var становится локальной переменной в этой функции:
	function sayHi() {
		if (true) {var phrase = "Привет"};
		alert(phrase); // срабатывает и выводит "Привет"
	}
	sayHi();
	alert(phrase); // Ошибка: phrase не определена (видна в консоли разработчика)
Как мы видим, var выходит за пределы блоков if, for и подобных. Это происходит потому, что на заре развития JS блоки кода не имели лексического окружения. Поэтому можно сказать, что var – это пережиток прошлого.

var допускает повторное объявление.
Если в блоке кода дважды объявить одну и ту же переменную let, будет ошибка:
	let user;
	let user; // SyntaxError: 'user' has already been declared
Используя var, можно переобъявлять переменную сколько угодно раз. Повторные var игнорируются:
	var user = "Пётр";
	var user; // ничего не делает, переменная объявлена раньше, ...нет ошибки
	alert(user); // Пётр
Если дополнительно присвоить значение, то переменная примет новое значение:
	var user = "Пётр";
	var user = "Иван";
	alert(user); // Иван

var обрабатываются в начале запуска функции.
Объявления переменных var обрабатываются в начале выполнения функции (или запуска скрипта, если переменная является глобальной).
Другими словами, переменные var считаются объявленными с самого начала исполнения функции вне зависимости от того, в каком месте функции реально находятся их объявления (при условии, что они не находятся во вложенной функции).
Т.е. этот код:
	function sayHi() {
		phrase = "Привет";
		alert(phrase);
		var phrase;
	}
	sayHi();
…Технически полностью эквивалентен следующему (объявление переменной var phrase перемещено в начало функции):
	function sayHi() {
		var phrase;
		phrase = "Привет";
		alert(phrase);
	}
	sayHi();
…И даже коду ниже (как вы помните, блочная область видимости игнорируется):
	function sayHi() {
		phrase = "Привет"; // (*)
		if (false) {var phrase};
		alert(phrase);
	}
	sayHi();
Это поведение называется hoisting (всплытие, поднятие), потому что все объявления переменных var "всплывают" в самый верх функции.
В примере выше if (false) условие никогда не выполнится. Но это никаким образом не препятствует созданию переменной var phrase, которая находится внутри него, поскольку объявления var "всплывают" в начало функции. Т.е. в момент присвоения значения (*) переменная уже существует.
Объявления переменных "всплывают", но присваивания значений – нет.
Это проще всего продемонстрировать на примере:
	function sayHi() {
		alert(phrase);
		var phrase = "Привет";
	}
	sayHi();
Строка var phrase = "Привет" состоит из двух действий:
	1. Объявление переменной var
	2. Присвоение значения в переменную =.
Объявление переменной обрабатывается в начале выполнения функции (всплывает), однако присвоение значения всегда происходит в той строке кода, где оно указано. Т.е. код выполняется по следующему сценарию:
	function sayHi() {
		var phrase; // объявление переменной срабатывает вначале...
		alert(phrase); // undefined
		phrase = "Привет"; // ...присвоение - в момент, когда исполнится данная строка кода.
	}
	sayHi();
Поскольку все объявления переменных var обрабатываются в начале функции, мы можем ссылаться на них в любом месте. Однако, переменные имеют значение undefined до строки с присвоением значения.
В обоих примерах выше вызов alert происходил без ошибки, потому что переменная phrase уже существовала. Но её значение ещё не было присвоено, поэтому мы получали undefined.

IIFE.
В прошлом, поскольку существовал только var, а он не имел блочной области видимости, программисты придумали способ её эмулировать. Этот способ получил название - Immediately-Invoked Function Expressions (Немедленно-Вызываемое Функциональное Выражение, сокращенно IIFE).
Это не то, что мы должны использовать сегодня, но, так как вы можете встретить это в старых скриптах, полезно понимать принцип работы.
IIFE выглядит следующим образом:
	(function() {
		var message = "Привет";
		alert(message); // Привет
	})();
Здесь создаётся и немедленно вызывается Function Expression. Так что код выполняется сразу же и у него есть свои локальные переменные.
Function Expression обёрнуто в скобки (function {...}), потому что, когда JS встречает "function" в основном потоке кода, он воспринимает это как начало Function Declaration. Но у Function Declaration должно быть имя, так что такой код вызовет ошибку:
	// Пробуем объявить и сразу же вызвать функцию
	function() { // <-- SyntaxError: Function statements require a function name
		var message = "Привет";
		alert(message); // Привет
	}();
Даже если мы скажем: «хорошо, давайте добавим имя», – это не сработает, потому что JS не позволяет вызывать Function Declaration немедленно.
	function go() { // ошибка синтаксиса из-за скобок ниже
	}(); // <-- нельзя вызывать Function Declaration немедленно
Так что скобки вокруг функции – это трюк, который позволяет объяснить JS, что функция была создана в контексте другого выражения, а значит, что это Function Expression: ей не нужно имя и её можно вызвать немедленно.
Помимо круглых скобок существуют и другие способы сообщить JS, что мы имеем в виду Function Expression:
	// Способы создания IIFE
	(function() {alert("Круглые скобки вокруг функции")})();
	(function() {alert("Круглые скобки вокруг всего выражения")}());
	!function() {alert("Выражение начинается с логического оператора НЕ")}();
	+function() {alert("Выражение начинается с унарного плюса")}();
Во всех перечисленных случаях мы объявляем Function Expression и немедленно запускаем его. Ещё раз отметим: в настоящее время необходимости писать подобный код нет.

Итого:
Существует 2 основных отличия var от let/const:
	1. Переменные var не имеют блочной области видимости, они ограничены, как минимум, телом функции.
	2. Объявления (инициализация) переменных var производится в начале исполнения функции (или скрипта для глобальных переменных).
Есть ещё одно небольшое отличие, относящееся к глобальному объекту, мы рассмотрим его в следующей главе.
Эти особенности, как правило, не очень хорошо влияют на код. Блочная область видимости – это удобно. Поэтому много лет назад let и const были введены в стандарт и сейчас являются основным способом объявления переменных.

/** Svyatoslav Olshanechky (2 года назад)
Не так давно смотрел работу одной исследовательской группы, которые заморачивались над performance. Так вот, эти ребята многие переменные определяли как var, так как если использовать const везде без разбора, то происходит проверка на уникальность и все это как оказалось жрет ресурсы. Поэтому считаю, что статья полезна, а все новые чудо учителя с своими курсами утверждающими, что нужно забыть про var не правы. */
/** Сергей Блиничкин (2 года назад)
не пойму, для чего эта статья? Если не показано принципиальное отличие var и let. Где механизмы? как они работают с памятью? Почему var всплывает? Как let не выходит из области видимости? Что не даёт всплывать? Единственное, что понятно: есть [[Environment]] и let с ним не плохо работает - всё! я чуть не забыл прошлую тему...
	Veh Gerli to Сергей Блиничкин (2 года назад)
	Это учебник для чайников, а не для самоваров.*/
/** Никита Горбачёв (3 года назад)
Область видимости переменных var ограничивается либо функцией, либо, если переменная глобальная, то скриптом. Такие переменные доступны за пределами блока.
Предыдущая глава: Например, в браузере все скрипты (кроме type="module") разделяют одну общую глобальную область. Так что, если мы создадим глобальную переменную в одном скрипте, она станет доступна и в других.
Было бы неплохо уточнить что - Область видимости переменных var ограничивается либо функцией, либо, если переменная глобальная, то скриптом если скрипты (type="module").*/

#1.6.5. Глобальный объект
25.3.25 - https://learn.javascript.ru/global-object
Глобальный объект предоставляет переменные и функции, доступные в любом месте программы. По умолчанию это те, что встроены в язык или среду исполнения.
В браузере он называется window, в Node.js — global, в другой среде исполнения может называться иначе.
Недавно globalThis был добавлен в язык как стандартизированное имя для глобального объекта, которое должно поддерживаться в любом окружении. Он поддерживается во всех основных браузерах.
Далее мы будем использовать window, полагая, что наша среда – браузер. Если скрипт может выполняться и в другом окружении, лучше будет globalThis.
Ко всем свойствам глобального объекта можно обращаться напрямую:
	alert("Привет");
	// это то же самое, что и
	window.alert("Привет");
В браузере глобальные функции и переменные, объявленные с помощью var (не let/const!), становятся свойствами глобального объекта:
	var gVar = 5;
	alert(window.gVar); // 5 (становится свойством глобального объекта)
То же самое касается функций, объявленных с помощью синтаксиса Function Declaration (выражения с ключевым словом function в основном потоке кода, не Function Expression).
Пожалуйста, не полагайтесь на это. Такое поведение поддерживается для совместимости. В современных проектах, использующих JS-модули, такого не происходит.
Если бы мы объявили переменную при помощи let, то такого бы не произошло:
	let gLet = 5;
	alert(window.gLet); // undefined (не становится свойством глобального объекта)
Если свойство настолько важное, что вы хотите сделать его доступным для всей программы, запишите его в глобальный объект напрямую:
	window.currentUser = {
		name: "John"
	}; // сделать информацию о текущем пользователе глобальной, для предоставления доступа всем скриптам
	// где угодно в коде
	alert(currentUser.name); // John
	// или, если у нас есть локальная переменная с именем "currentUser",
	// получим её из window явно (безопасно!)
	alert(window.currentUser.name); // John
При этом обычно не рекомендуется использовать глобальные переменные. Следует применять их как можно реже. Дизайн кода, при котором функция получает входные параметры и выдаёт определённый результат, чище, надёжнее и удобнее для тестирования, чем когда используются внешние, а тем более глобальные переменные.

Использование для полифилов.
Глобальный объект можно использовать, чтобы проверить поддержку современных возможностей языка.
Например, проверить наличие встроенного объекта Promise (такая поддержка отсутствует в очень старых браузерах):
	if (!window.Promise) {
		alert("Ваш браузер очень старый!");
	}
Если нет (скажем, используется старый браузер), мы можем создать полифил: добавить функции, которые не поддерживаются окружением, но существуют в современном стандарте.
	if (!window.Promise) {
		window.Promise = ... // собственная реализация современной возможности языка
	}

Итого:
Глобальный объект хранит переменные, которые должны быть доступны в любом месте программы.
Это включает в себя как встроенные объекты, например, Array, так и характерные для окружения свойства, например, window.innerHeight – высота окна браузера.
Глобальный объект имеет универсальное имя – globalThis.
…Но чаще на него ссылаются по-старому, используя имя, характерное для данного окружения, такое как window (браузер) и global (Node.js).
Следует хранить значения в глобальном объекте, только если они действительно глобальны для нашего проекта. И стараться свести их количество к минимуму.
В браузерах, если только мы не используем модули, глобальные функции и переменные, объявленные с помощью var, становятся свойствами глобального объекта.
Для того, чтобы код был проще и в будущем его легче было поддерживать, следует обращаться к свойствам глобального объекта напрямую, как window.x.

#1.6.6. Объект функции, NFE
26.3.25 - https://learn.javascript.ru/function-object
Как мы уже знаем, в JS функция – это значение. 
Каждое значение в JS имеет свой тип. А функция – это какой тип? В JS функции – это объекты.
Можно представить функцию как "объект, который может делать какое-то действие". Функции можно не только вызывать, но и использовать их как обычные объекты: добавлять/удалять свойства, передавать их по ссылке и т.д.

Свойство name.
Объект функции содержит несколько полезных свойств.
Например, имя функции нам доступно как свойство name:
	function sayHi() {alert("Hi")}
	alert(sayHi.name); // sayHi
Что довольно забавно, логика назначения name весьма умная. Она присваивает корректное имя даже в случае, когда функция создаётся без имени и тут же присваивается, вот так:
	let sayHi = function() {alert("Hi")};
	alert(sayHi.name); // sayHi (есть имя!)
Это работает даже в случае присваивания значения по умолчанию:
	function f(sayHi = function() {}) {
		alert(sayHi.name); // sayHi (работает!)
	}
	f();
В спецификации это называется "контекстное имя": если функция не имеет name, то JS пытается определить его из контекста.
Также имена имеют и методы объекта:
	let user = {
		sayHi() {/*...*/},
		sayBye: function() {/*...*/}
	}
	alert(user.sayHi.name); // sayHi
	alert(user.sayBye.name); // sayBye
В этом нет никакой магии. Бывает, что корректное имя определить невозможно. В таких случаях свойство name имеет пустое значение. Например:
	let arr = [function() {}]; // функция объявлена внутри массива
	alert( arr[0].name ); // <пустая строка> // здесь отсутствует возможность определить имя, поэтому его нет
Впрочем, на практике такое бывает редко, обычно функции имеют name.

Свойство length.
Ещё одно встроенное свойство length содержит количество параметров функции в её объявлении. Например:
	function f1(a) {}
	function f2(a, b) {}
	function many(a, b, ...more) {}
	alert(f1.length); // 1
	alert(f2.length); // 2
	alert(many.length); // 2
Как мы видим, троеточие, обозначающее "остаточные параметры", здесь как бы "не считается".
Свойство length иногда используется для интроспекций в функциях, которые работают с другими функциями.
Например, в коде ниже функция ask принимает в качестве параметров вопрос question и произвольное количество функций-обработчиков ответа handler.
Когда пользователь отвечает на вопрос, функция вызывает обработчики. Мы можем передать два типа обработчиков:
	- Функцию без аргументов, которая будет вызываться только в случае положительного ответа.
	- Функцию с аргументами, которая будет вызываться в обоих случаях и возвращать ответ.
Чтобы вызвать обработчик handler правильно, будем проверять свойство handler.length.
Идея состоит в том, чтобы иметь простой синтаксис обработчика без аргументов для положительных ответов (наиболее распространённый случай), но также и возможность передавать универсальные обработчики:
	function ask(question, ...handlers) {
		let isYes = confirm(question);
		for (let handler of handlers) {
			if (handler.length == 0) {
				if (isYes) handler();
			} else {
				handler(isYes);
			}
		}
	}
	// для положительных ответов вызываются оба типа обработчиков
	// для отрицательных - только второго типа
	ask("Вопрос?", () => alert('Вы ответили да'), result => alert(result));
Это частный случай так называемого Ad-hoc-полиморфизма – обработка аргументов в зависимости от их типа или, как в нашем случае – от значения length. Эта идея имеет применение в библиотеках JS.

Пользовательские свойства.
Мы также можем добавить свои собственные свойства.
Давайте добавим свойство counter для отслеживания общего количества вызовов:
	function sayHi() {
		alert("Hi");
		sayHi.counter++; // давайте посчитаем, сколько вызовов мы сделали
	}
	sayHi.counter = 0; // начальное значение
	sayHi(); // Hi
	sayHi(); // Hi
	alert( `Вызвана ${sayHi.counter} раза` ); // Вызвана 2 раза
/**Свойство не есть переменная.
Свойство функции, назначенное как sayHi.counter = 0, не объявляет локальную переменную counter внутри неё. Другими словами, свойство counter и переменная let counter – это две независимые вещи.
Мы можем использовать функцию как объект, хранить в ней свойства, но они никак не влияют на её выполнение. Переменные – это не свойства функции и наоборот. Это два параллельных мира.*/
Иногда свойства функции могут использоваться вместо замыканий. Например, мы можем переписать функцию-счётчик из главы Область видимости переменных, замыкание, используя её свойство:
	function makeCounter() {
		// вместо let count = 0
		function counter() {return counter.count++};
		counter.count = 0;
		return counter;
	}
	let counter = makeCounter();
	alert( counter() ); // 0
	alert( counter() ); // 1
Свойство count теперь хранится прямо в функции, а не в её внешнем лексическом окружении.
Это хуже или лучше, чем использовать замыкание?
Основное отличие в том, что если значение count живёт во внешней переменной, то оно не доступно для внешнего кода. Изменить его могут только вложенные функции. А если оно присвоено как свойство функции, то мы можем его получить:
	function makeCounter() {
		function counter() {return counter.count++};
		counter.count = 0;
		return counter;
	}
	let counter = makeCounter();
	counter.count = 10;
	alert( counter() ); // 10
Поэтому выбор реализации зависит от наших целей.

Named Function Expression.
Named Function Expression или NFE (именованное функциональное выражение) – это термин для Function Expression, у которого есть имя.
Например, давайте объявим Function Expression:
	let sayHi = function(who) {alert(`Hello, ${who}`)};
И присвоим ему имя:
	let sayHi = function func(who) {alert(`Hello, ${who}`)};
Чего мы здесь достигли? Какова цель этого дополнительного имени func?
Для начала заметим, что функция всё ещё задана как Function Expression. Добавление "func" после function не превращает объявление в Function Declaration, потому что оно все ещё является частью выражения присваивания.
Добавление такого имени ничего не ломает.
Функция все ещё доступна как sayHi():
	let sayHi = function func(who) {alert(`Hello, ${who}`)};
	sayHi("John"); // Hello, John
Есть две важные особенности имени func, ради которого оно даётся:
Оно позволяет функции ссылаться на себя же.
Оно не доступно за пределами функции.
Например, ниже функция sayHi вызывает себя с "Guest", если не передан параметр who:
	let sayHi = function func(who) {
		if (who) {alert(`Hello, ${who}`)} 
		else {func("Guest")} // использует func, чтобы снова вызвать себя же
	};
	sayHi(); // Hello, Guest
	// А вот так - не cработает:
	func(); // Ошибка, func не определена (недоступна вне функции)
Почему мы используем func? Почему просто не использовать sayHi для вложенного вызова?
Вообще, обычно мы можем так поступить:
	let sayHi = function(who) {
		if (who) {alert(`Hello, ${who}`)} 
		else {sayHi("Guest")}
	};
Однако, у этого кода есть проблема, которая заключается в том, что значение sayHi может быть изменено. Функция может быть присвоена другой переменной, и тогда код начнёт выдавать ошибки:
	let sayHi = function(who) {
		if (who) {alert(`Hello, ${who}`)} 
		else {sayHi("Guest")} // Ошибка: sayHi не является функцией
	};
	let welcome = sayHi;
	sayHi = null;
	welcome(); // Ошибка, вложенный вызов sayHi больше не работает!
Так происходит, потому что функция берёт sayHi из внешнего лексического окружения. Так как локальная переменная sayHi отсутствует, используется внешняя. И на момент вызова эта внешняя sayHi равна null.
Необязательное имя, которое можно вставить в Function Expression, как раз и призвано решать такого рода проблемы.
Давайте используем его, чтобы исправить наш код:
	let sayHi = function func(who) {
		if (who) {alert(`Hello, ${who}`)} 
		else {func("Guest")} // Теперь всё в порядке
	};
	let welcome = sayHi;
	sayHi = null;
	welcome(); // Hello, Guest (вложенный вызов работает)
Теперь всё работает, потому что имя "func" локальное и находится внутри функции. Теперь оно взято не снаружи (и недоступно оттуда). Спецификация гарантирует, что оно всегда будет ссылаться на текущую функцию.
Внешний код все ещё содержит переменные sayHi и welcome, но теперь func – это внутреннее имя функции, таким образом она может вызвать себя изнутри.

Это не работает с Function Declaration.
Трюк с внутренним именем, описанный выше, работает только для Function Expression и не работает для Function Declaration. Для Function Declaration синтаксис не предусматривает возможность объявить дополнительное внутреннее имя.
Зачастую, когда нам нужно надёжное внутреннее имя, стоит переписать Function Declaration на Named Function Expression.

Итого:
Функции – это объекты.
Их свойства:
	name – имя функции. Обычно берётся из объявления функции, но если там нет – JS пытается понять его из контекста.
	length – количество аргументов в объявлении функции. Троеточие ("остаточные параметры") не считается.
Если функция объявлена как Function Expression (вне основного потока кода) и имеет имя, тогда это называется Named Function Expression (Именованным Функциональным Выражением). Это имя может быть использовано для ссылки на себя же, для рекурсивных вызовов и т.п.
Также функции могут содержать дополнительные свойства. Многие известные JS-библиотеки искусно используют эту возможность.
Они создают "основную" функцию и добавляют множество "вспомогательных" функций внутрь первой. Например, библиотека jQuery создаёт функцию с именем $. Библиотека lodash создаёт функцию _, а потом добавляет в неё _.clone, _.keyBy и другие свойства (чтобы узнать о ней побольше см. документацию). Они делают это, чтобы уменьшить засорение глобального пространства имён посредством того, что одна библиотека предоставляет только одну глобальную переменную, уменьшая вероятность конфликта имён.
Таким образом, функция может не только делать что-то сама по себе, но также и предоставлять полезную функциональность через свои свойства.

Задачи: 1+- 2-
1. Установка и уменьшение значения счётчика (важность: 5)
Измените код makeCounter() так, чтобы счётчик мог уменьшать и устанавливать значение:
	counter() должен возвращать следующее значение (как и раньше).
	counter.set(value) должен устанавливать счётчику значение value.
	counter.decrease() должен уменьшать значение счётчика на 1.
		function makeCounter() {
			let count = 0;
			/* ... ваш код ...*/
		}
		let counter = makeCounter();
		console.log( counter() ); // 0
		console.log( counter() ); // 1
		counter.set(10); // установить новое значение счётчика
		console.log( counter() ); // 10
		counter.decrease(); // уменьшить значение счётчика на 1
		console.log( counter() ); // 10 (вместо 11)
P.S. Для того, чтобы сохранить текущее значение счётчика, можно воспользоваться как замыканием, так и свойством функции. Или сделать два варианта решения: и так, и так.
решение:
	// 1. 
		function makeCounter() {
			// let count = 0;
			let counter = function() {return counter.count++};
			counter.count = 0;
			return counter;
		}
		let counter = makeCounter();
		counter.set = function(value){return counter.count = value};
		counter.decrease = function(){return counter.count--};
	// 2. 
		function makeCounter() {
			// let count = 0;
			let counter = function() {return counter.count++};
			counter.set = function(value){return counter.count = value};
			counter.decrease = function(){return counter.count--};
			counter.count = 0;
			return counter;
		}
		let counter = makeCounter();
	// учебник:
		В решении использована локальная переменная count, а методы сложения записаны прямо в counter. Они разделяют одно и то же лексическое окружение и также имеют доступ к текущей переменной count.
		function makeCounter() {
			let count = 0;
			function counter() {return count++}
			counter.set = value => count = value;
			counter.decrease = () => count--;
			return counter;
		}

2. Сумма с произвольным количеством скобок (важность: 2)
Напишите функцию sum, которая бы работала следующим образом:
	sum(1)(2) == 3; // 1 + 2
	sum(1)(2)(3) == 6; // 1 + 2 + 3
	sum(5)(-1)(2) == 6
	sum(6)(-1)(-2)(-3) == 0
	sum(0)(1)(2)(3)(4)(5) == 15
P.S. Подсказка: возможно вам стоит сделать особый метод преобразования в примитив для функции.
решение:
	1. В общем, чтобы это хоть как-нибудь заработало, результат, возвращаемый sum, должен быть функцией.
	2. Между вызовами эта функция должна удерживать в памяти текущее значение счётчика.
	3. Согласно заданию, функция должна преобразовываться в число, когда она используется с оператором ==. Функции – объекты, так что преобразование происходит, как описано в главе "Преобразование объектов в примитивы", поэтому можно создать наш собственный метод, возвращающий число.
		function sumA(a){
			let currentSum = a;
			function f(b) {
				currentSum += b;
				return f;
			}
			f.toString = function() {return currentSum};
			return f;
		};
		console.log(String(sumA(1)(2))); // 3
		console.log(String(sumA(0)(1)(2)(3)(4)(5))); // 15
		console.log(String(sumA(5)(-1)(2))); // 6
		console.log(String(sumA(6)(-1)(-2)(-3))); // 0
	Пожалуйста, обратите внимание на то, что функция sum выполняется лишь однажды и просто возвращает функцию f.
	Далее, при каждом последующем вызове, f суммирует свой аргумент со значением currentSum и возвращает себя же.
	В последней строке f нет никакой рекурсии.
	Вот как выглядит рекурсия:
		function f(b) {
			currentSum += b;
			return f(); // <-- рекурсивный вызов
		}
	В нашем случае мы просто возвращаем функцию, не вызывая её:
		function f(b) {
			currentSum += b;
			return f; // <-- не вызывает себя. Просто возвращает
		}
	Функция f будет использоваться в последующем вызове и снова возвращать себя столько раз, сколько будет необходимо. Затем, при использовании в качестве числа или строки, метод toString возвращает currentSum – число. Также здесь мы можем использовать Symbol.toPrimitive или valueOf для преобразования.

#1.6.7. Синтаксис "new Function"
27.3.25 - https://learn.javascript.ru/new-function
Синтаксис "new Function".
Существует ещё один вариант объявления функции. Он используется крайне редко, но иногда другого решения не найти.

Синтаксис для объявления функции:
	let func = new Function([arg1, arg2, ...argN], functionBody);
Функция создаётся с заданными аргументами arg1...argN и телом functionBody.
Это проще понять на конкретном примере. Здесь объявлена функция с двумя аргументами:
	let sum = new Function('a', 'b', 'return a + b');
	alert( sum(1, 2) ); // 3
А вот функция без аргументов, в этом случае достаточно указать только тело:
	let sayHi = new Function('alert("Hello")');
	sayHi(); // Hello
Главное отличие от других способов объявления функции, которые были рассмотрены ранее, заключается в том, что функция создаётся полностью "на лету" из строки, переданной во время выполнения.
Все предыдущие объявления требовали от нас, программистов, писать объявление функции в скрипте.
Но new Function позволяет превратить любую строку в функцию. Например, можно получить новую функцию с сервера и затем выполнить её:
	let str = /*... код, полученный с сервера динамически ...*/;
	let func = new Function(str);
	func();
Это используется в очень специфических случаях, например, когда мы получаем код с сервера для динамической компиляции функции из шаблона, в сложных веб-приложениях.

Замыкание.
Обычно функция запоминает, где родилась, в специальном свойстве [[Environment]]. Это ссылка на лексическое окружение (Lexical Environment), в котором она создана (мы разбирали это в главе Область видимости переменных, замыкание).
Но когда функция создаётся с использованием new Function, в её [[Environment]] записывается ссылка не на внешнее лексическое окружение, в котором она была создана, а на глобальное. Поэтому такая функция имеет доступ только к глобальным переменным.
	function getFunc() {
		let value = "test";
		let func = new Function('alert(value)');
		return func;
	}
	getFunc()(); // ошибка: value не определено
Сравним это с обычным объявлением:
	function getFunc() {
		let value = "test";
		let func = function() { alert(value); };
		return func;
	}
	getFunc()(); // "test", из лексического окружения функции getFunc
Эта особенность new Function выглядит странно, но оказывается очень полезной на практике.
Представьте, что нужно создать функцию из строки. Код этой функции неизвестен во время написания скрипта (поэтому не используем обычные функции), а будет определён только в процессе выполнения. Мы можем получить код с сервера или с другого ресурса.
Наша новая функция должна взаимодействовать с основным скриптом.
Что если бы она имела доступ к внешним переменным?
Проблема в том, что перед отправкой JS-кода на реальные работающие проекты код сжимается с помощью минификатора – специальной программы, которая уменьшает размер кода, удаляя комментарии, лишние пробелы, и, что самое главное, локальным переменным даются укороченные имена.
Например, если в функции объявляется переменная let userName, то минификатор изменяет её на let a (или другую букву, если она не занята) и изменяет её везде. Обычно так делать безопасно, потому что переменная является локальной, и никто снаружи не имеет к ней доступ. И внутри функции минификатор заменяет каждое её упоминание. Минификаторы достаточно умные. Они не просто осуществляют "тупой" поиск-замену, они анализируют структуру кода, и поэтому ничего не ломается.
Так что если бы даже new Function и имела доступ к внешним переменным, она не смогла бы найти переименованную userName.
Если бы new Function имела доступ к внешним переменным, при этом были бы проблемы с минификаторами.
Кроме того, такой код был бы архитектурно хуже и более подвержен ошибкам.
Чтобы передать что-то в функцию, созданную как new Function, можно использовать её аргументы.

Итого:
Синтаксис:
	let func = new Function ([arg1, arg2, ...argN], functionBody);
По историческим причинам аргументы также могут быть объявлены через запятую в одной строке.
Эти 3 объявления ниже эквивалентны:
	new Function('a', 'b', 'return a + b'); // стандартный синтаксис
	new Function('a,b', 'return a + b'); // через запятую в одной строке
	new Function('a , b', 'return a + b'); // через запятую с пробелами в одной строке
Функции, объявленные через new Function, имеют [[Environment]], ссылающийся на глобальное лексическое окружение, а не на родительское. Поэтому они не могут использовать внешние локальные переменные. Но это очень хорошо, потому что страхует нас от ошибок. Переданные явно параметры – гораздо лучшее архитектурное решение, которое не вызывает проблем у минификаторов.

#1.6.8. Планирование: setTimeout и setInterval
27.12.24/28.3.25 - https://learn.javascript.ru/settimeout-setinterval
Методы планирования вызова:
setTimeout(объект_вызова|код, задержка[, аргументы]); // вызвает функцию один раз через определённый интервал времени (вызов с задержкой).
clearTimeout(объект_вызова); // отмена дальнейшего выполнения функции.
setInterval(объект_вызова|код, интервал); // вызывает функцию регулярно, повторяя вызов через определённый интервал времени (периодический вызов через интервал в мсек).
clearInterval(объект_вызова) // остановка счётчика.

setTimeout():
Синтаксис:	let timerId = setTimeout(func|code, [delay], [arg1], [arg2], ...);
	func|code // Функция или строка кода для выполнения. Обычно это функция. 
	// По историческим причинам можно передать и строку кода, но это не рекомендуется.
	// Если первый аргумент является строкой, то JS создаст из неё функцию.
	delay // Задержка перед запуском в миллисекундах (1000 мс = 1 с). Значение по умолчанию – 0.
	arg1, arg2… // Аргументы, передаваемые в функцию
вместо строк лучше использовать стрелочные функции:
	setTimeout("alert('Привет')", 1000); // Привет
	setTimeout(() => alert('Привет'), 1000); // Привет

Начинающие разработчики иногда ошибаются, добавляя скобки () после названия функции func, но это неправильно. Это не работает, потому что setTimeout ожидает ссылку на функцию, а () запускают выполнение функции, и результат выполнения отправляется в setTimeout. Обычно результатом выполнения функции является undefined (если функция ничего не возвращает), поэтому ничего не выполняется.

Отмена через clearTimeout():
Вызов setTimeout() возвращает идентификатор таймера timerId, который можно использовать для отмены дальнейшего выполнения.
Синтаксис для отмены:
	let timerId = setTimeout(...);
	clearTimeout(timerId);
В браузере идентификатором таймера является число. В других средах это может быть что-то ещё. Например, Node.js возвращает объект таймера с дополнительными методами. Для браузеров таймеры описаны в разделе таймеров стандарта HTML5 ['https://www.w3.org/TR/html5/webappapis.html#timers'].

setInterval():
синтаксис:	let timerId = setInterval(func|code, [delay], [arg1], [arg2], ...);
Все аргументы имеют такое же значение как в setTimeout. Но в отличие от setTimeout, функция запускается не один раз, а периодически через указанный интервал времени.
Чтобы остановить дальнейшее выполнение функции, необходимо вызвать clearInterval(timerId).
// В большинстве браузеров, включая Chrome и Firefox, внутренний счётчик продолжает идти во время показа alert/confirm/prompt.
Следующий пример выводит сообщение каждые 2 секунды, и через 5 секунд вывод прекращается:
	let timerId = setInterval(() => alert('tick'), 2000); // повторить с интервалом 2 секунды
	setTimeout(() => { clearInterval(timerId); alert('stop'); }, 5000); // остановить вывод через 5 секунд

Есть два способа запускать что-то регулярно:
	- setInterval(),
	- вложенный setTimeout().

Вложенный setTimeout – более гибкий метод, чем setInterval. С его помощью последующий вызов может быть задан по-разному в зависимости от результатов предыдущего.
Например, необходимо написать сервис, который отправляет запрос для получения данных на сервер каждые 5 секунд, но если сервер перегружен, то необходимо увеличить интервал запросов до 10, 20, 40 секунд… Вот псевдокод:
	let delay = 5000;
	let timerId = setTimeout(function request() {
		/*...отправить запрос...*/
		if (/*ошибка запроса из-за перегрузки сервера*/) {
			delay *= 2; // увеличить интервал для следующего запроса
		}
		timerId = setTimeout(request, delay);
	}, delay);
Вложенный setTimeout позволяет задать задержку между выполнениями более точно, чем setInterval.
Сравним два фрагмента кода. 
1. Первый использует setInterval:
	let i = 1;
	setInterval(function() {func(i)}, 100);
2. Второй использует вложенный рекурсивный setTimeout:
	let i = 1;
	setTimeout(function run() {
		func(i); 
		setTimeout(run, 100);
	}, 100);
Для setInterval внутренний планировщик будет запускать func(i) каждые 100 мс. Но реальная задержка между вызовами func с помощью setInterval меньше, чем указано в коде. Это нормально, потому что время, затраченное на выполнение func, использует часть заданного интервала времени.
Если выполнение func будет дольше 100 мс, то тогда движок ждёт окончания выполнения func и затем проверяет планировщик и, если время истекло, немедленно запускает его снова. В крайнем случае, если функция всегда выполняется дольше, чем задержка delay, то вызовы будут выполняться без задержек вообще.
Вложенный рекурсивный setTimeout гарантирует фиксированную задержку (здесь 100 мс), т.к. новый вызов планируется в конце предыдущего.

Сборка мусора и колбэк setTimeout/setInterval.
Когда функция передаётся в setInterval/setTimeout, на неё создаётся внутренняя ссылка и сохраняется в планировщике. Это предотвращает попадание функции в сборщик мусора, даже если на неё нет других ссылок.
	setTimeout(function() {...}, 100); // функция остаётся в памяти до тех пор, пока планировщик обращается к ней
Для setInterval функция остаётся в памяти до тех пор, пока не будет вызван clearInterval.
Есть и побочный эффект. Функция ссылается на внешнее лексическое окружение, поэтому пока она существует, внешние переменные существуют тоже. Они могут занимать больше памяти, чем сама функция. Поэтому, если регулярный вызов функции больше не нужен, то лучше отменить его, даже если функция очень маленькая.

Вызов setTimeout с нулевой задержкой.
Особый вариант использования: setTimeout(func, 0) или просто setTimeout(func). Это планирует вызов func настолько быстро, насколько это возможно. Но планировщик будет вызывать функцию только после завершения выполнения текущего кода. 
Так вызов функции будет запланирован сразу после выполнения текущего кода.
	setTimeout(() => func1()); func2();
Есть и более продвинутые случаи использования нулевой задержки в браузерах, которые мы рассмотрим в главе Событийный цикл: микрозадачи и макрозадачи ['https://learn.javascript.ru/event-loop'].

Минимальная задержка вложенных таймеров в браузере.
В браузере есть ограничение на то, как часто внутренние счётчики могут выполняться. В стандарте HTML5 говорится: "после пяти вложенных таймеров интервал должен составлять не менее 4 миллисекунд".
Например:
	let start = Date.now();
	let times = [];
	let counter = setTimeout(function run() {
		times.push(Date.now() - start); // запоминаем задержку от предыдущего вызова
		if (start + 200 < Date.now()) console.log(times); // показываем массив задержек, пока они не превысят 200 мс
		else setTimeout(run); // если нужно ещё запланировать
	});
// => (6) [1, 5, 55, 125, 191, 385]
Первый таймер запускается сразу (как и указано в спецификации), а затем задержка вступает в игру, и мы видим 9, 15, 20, 24....
Аналогичное происходит при использовании setInterval вместо setTimeout: setInterval(f) запускает f несколько раз с нулевой задержкой, а затем с задержкой 4+ мс. Это ограничение существует давно, многие скрипты полагаются на него, поэтому оно сохраняется по историческим причинам.
Этого ограничения нет в серверном JS. Там есть и другие способы планирования асинхронных задач. Например, setImmediate для Node.js ['https://nodejs.org/api/timers.html']. Так что это ограничение относится только к браузерам.

Итого:
- Методы setInterval(func, delay, ...args) и setTimeout(func, delay, ...args) позволяют выполнять func регулярно или только один раз после задержки delay, заданной в мс.
- Для отмены выполнения необходимо вызвать clearInterval/clearTimeout со значением, которое возвращают методы setInterval/setTimeout.
- Вложенный вызов setTimeout является более гибкой альтернативой setInterval. Также он позволяет более точно задать интервал между выполнениями.
- Планирование с нулевой задержкой setTimeout(func,0) или, что то же самое, setTimeout(func) используется для вызовов, которые должны быть исполнены как можно скорее, после завершения исполнения текущего кода.
- Браузер ограничивает 4-мя мс минимальную задержку между пятью и более вложенными вызовами setTimeout, а также для setInterval, начиная с 5-го вызова. Обратим внимание, что все методы планирования не гарантируют точную задержку.

Например, таймер в браузере может замедляться по многим причинам:
- Перегружен процессор.
- Вкладка браузера в фоновом режиме.
- Работа ноутбука от аккумулятора.
Всё это может увеличивать минимальный интервал срабатывания таймера (и минимальную задержку) до 300 или даже 1000 мс в зависимости от браузера и настроек производительности ОС.

Задачи: 1+ 2-
1. Напишите функцию printNumbers(from, to), которая выводит число каждую секунду, начиная от from и заканчивая to.
Сделайте два варианта решения.
	// моё
	// 1.1. Используя setInterval.
		function printNumbers(from, to){
			let i = from;
			let counter = setInterval(() => {
				console.log(i);
				if (i === to) clearInterval(counter);
				i++;
			}, 1000);
		};
		printNumbers(1, 5); // 1 2 3 4 5
	// 1.2. Используя рекурсивный setTimeout.
		function printNumbers2(from, to){
			let i = from;
			let counter = setTimeout(function run(){
				console.log(i); 
				i++;
				if (i <= to) setTimeout(run, 1000);
			}, 1000);
		}
		printNumbers2(1, 5); // 1 2 3 4 5
	// учебник
	// 1.1. Используя setInterval:
		function printNumbers1(from, to){
			let current = from;
			let timerId = setInterval(function() {
				console.log(current);
				if (current == to) {clearInterval(timerId)}
				current++;
			}, 1000);
		};
		printNumbers1(7,15); // 7 8 9 10 11 12 13 14 15
	// 1.2. Используя рекурсивный setTimeout:
		function printNumbers2(from, to) {
			let current = from;
			setTimeout(function go() {
				console.log(current);
				if (current < to) {setTimeout(go, 1000)}
				current++;
			}, 1000);
		};
		printNumbers2(5, 10); // 5 6 7 8 9 10

2. В коде запланирован вызов setTimeout, а затем выполняется сложное вычисление, для завершения которого требуется более 100 мс.
Когда будет выполнена запланированная функция? (1) После цикла, (2) Перед циклом, (3) В начале цикла.
Что покажет console.log()?
	let i = 0;
	setTimeout(() => console.log(i), 100); // ? 1000000
	for (let j = 0; j < 1000000; j++) i++; // предположим, что время выполнения этой функции >100 мс
=> функция будет выполнена после цикла.

#1.6.9. Декораторы и переадресация вызова, call/apply
29.3.25 - https://learn.javascript.ru/call-apply-decorators
JS предоставляет исключительно гибкие возможности по работе с функциями: они могут быть переданы в другие функции, использованы как объекты, и сейчас мы рассмотрим, как перенаправлять вызовы между ними и как их декорировать.

Прозрачное кеширование.
Представим, что у нас есть функция slow(x), выполняющая ресурсоёмкие вычисления, но возвращающая стабильные результаты. Другими словами, для одного и того же x она всегда возвращает один и тот же результат.
Если функция вызывается часто, то, вероятно, мы захотим кешировать (запоминать) возвращаемые ею результаты, чтобы сэкономить время на повторных вычислениях.
Вместо того, чтобы усложнять slow(x) дополнительной функциональностью, мы заключим её в функцию-обёртку – wrapper (от англ. wrap – обёртывать), которая добавит кеширование. Далее мы увидим, что в таком подходе масса преимуществ.
Вот код с объяснениями:
	function slow(x) {
		// здесь могут быть ресурсоёмкие вычисления
		alert(`Called with ${x}`);
		return x;
	}
	function cachingDecorator(func) {
		let cache = new Map();
		return function(x) {
			if (cache.has(x)) {    // если кеш содержит такой x,
				return cache.get(x); // читаем из него результат
			}
			let result = func(x); // иначе, вызываем функцию
			cache.set(x, result); // и кешируем (запоминаем) результат
			return result;
		};
	}
	slow = cachingDecorator(slow);
	alert( slow(1) ); // slow(1) кешируем
	alert( "Again: " + slow(1) ); // возвращаем из кеша
	alert( slow(2) ); // slow(2) кешируем
	alert( "Again: " + slow(2) ); // возвращаем из кеша
В коде выше cachingDecorator – это декоратор, специальная функция, которая принимает другую функцию и изменяет её поведение.
Идея состоит в том, что мы можем вызвать cachingDecorator с любой функцией, в результате чего мы получим кеширующую обёртку. Это здорово, т.к. у нас может быть множество функций, использующих такую функциональность, и всё, что нам нужно сделать – это применить к ним cachingDecorator.
Отделяя кеширующий код от основного кода, мы также сохраняем чистоту и простоту последнего.
Результат вызова cachingDecorator(func) является обёрткой, т.е. function(x) оборачивает вызов func(x) в кеширующую логику.
С точки зрения внешнего кода, обёрнутая функция slow по-прежнему делает то же самое. Обёртка всего лишь добавляет к её поведению аспект кеширования.
Подводя итог, можно выделить несколько преимуществ использования отдельной cachingDecorator вместо изменения кода самой slow:
- Функцию cachingDecorator можно использовать повторно. Мы можем применить её к другой функции.
- Логика кеширования является отдельной, она не увеличивает сложность самой slow (если таковая была).
- При необходимости мы можем объединить несколько декораторов (речь об этом пойдёт позже).

Применение func.call для передачи контекста.
Упомянутый выше кеширующий декоратор не подходит для работы с методами объектов.
Например, в приведённом ниже коде worker.slow() перестаёт работать после применения декоратора:
	let worker = { // сделаем worker.slow кеширующим
		someMethod() {return 1},
		slow(x) { // здесь может быть страшно тяжёлая задача для процессора
			alert("Called with " + x);
			return x * this.someMethod(); // (*)
		}
	};
	function cachingDecorator(func) { // тот же код, что и выше
		let cache = new Map();
		return function(x) {
			if (cache.has(x)) return cache.get(x);
			let result = func(x); // (**)
			cache.set(x, result);
			return result;
		};
	}
	alert( worker.slow(1) ); // оригинальный метод работает
	worker.slow = cachingDecorator(worker.slow); // теперь сделаем его кеширующим
	alert( worker.slow(2) ); // Ой! Ошибка: не удаётся прочитать свойство 'someMethod' из 'undefined'
Ошибка возникает в строке (*). Функция пытается получить доступ к this.someMethod и завершается с ошибкой. Видите почему?
Причина в том, что в строке (**) декоратор вызывает оригинальную функцию как func(x), и она в данном случае получает this = undefined.
Мы бы наблюдали похожую ситуацию, если бы попытались запустить:
	let func = worker.slow;
	func(2);
Т.е. декоратор передаёт вызов оригинальному методу, но без контекста. Следовательно – ошибка. Давайте это исправим.
Существует специальный встроенный метод функции func.call(context, …args), который позволяет вызывать функцию, явно устанавливая this.
	Синтаксис: func.call(context, arg1, arg2, ...);
Он запускает функцию func, используя первый аргумент как её контекст this, а последующие – как её аргументы.
Проще говоря, эти два вызова делают почти то же самое:
	func(1, 2, 3);
	func.call(obj, 1, 2, 3)
Они оба вызывают func с аргументами 1, 2 и 3. Единственное отличие состоит в том, что func.call ещё и устанавливает this равным obj.
Например, в приведённом ниже коде мы вызываем sayHi в контексте различных объектов: sayHi.call(user) запускает sayHi, передавая this=user, а следующая строка устанавливает this=admin:
	function sayHi() {alert(this.name)}
	let user = { name: "John" };
	let admin = { name: "Admin" };
	// используем 'call' для передачи различных объектов в качестве 'this'
	sayHi.call( user ); // John
	sayHi.call( admin ); // Admin
Здесь мы используем call для вызова say с заданным контекстом и фразой:
	function say(phrase) {alert(this.name + ': ' + phrase)};
	let user = { name: "John" };
	// 'user' становится 'this', и "Hello" становится первым аргументом
	say.call( user, "Hello" ); // John: Hello
В нашем случае мы можем использовать call в обёртке для передачи контекста в исходную функцию:
	let worker = {
		someMethod() {return 1},
		slow(x) {
			alert("Called with " + x);
			return x * this.someMethod(); // (*)
		}
	};
	function cachingDecorator(func) {
		let cache = new Map();
		return function(x) {
			if (cache.has(x)) {return cache.get(x)};
			let result = func.call(this, x); // теперь 'this' передаётся правильно
			cache.set(x, result);
			return result;
		};
	}
	worker.slow = cachingDecorator(worker.slow); // теперь сделаем её кеширующей
	alert( worker.slow(2) ); // работает
	alert( worker.slow(2) ); // работает, не вызывая первоначальную функцию (кешируется)
Теперь всё в порядке.
Чтобы всё было понятно, давайте посмотрим глубже, как передаётся this:
	1. После декорации worker.slow становится обёрткой function (x) { ... }.
	2. Так что при выполнении worker.slow(2) обёртка получает 2 в качестве аргумента и this=worker (так как это объект перед точкой).
	3. Внутри обёртки, если результат ещё не кеширован, func.call(this, x) передаёт текущий this (=worker) и текущий аргумент (=2) в оригинальную функцию.

Переходим к нескольким аргументам с func.apply.
Теперь давайте сделаем cachingDecorator ещё более универсальным. До сих пор он работал только с функциями с одним аргументом.
Как же кешировать метод с несколькими аргументами worker.slow?
	let worker = {
		slow(min, max) {return min + max} // здесь может быть тяжёлая задача
	};
	// будет кешировать вызовы с одинаковыми аргументами
	worker.slow = cachingDecorator(worker.slow);
Здесь у нас есть две задачи для решения.
Во-первых, как использовать оба аргумента min и max для ключа в коллекции cache? Ранее для одного аргумента x мы могли просто сохранить результат cache.set(x, result) и вызвать cache.get(x), чтобы получить его позже. Но теперь нам нужно запомнить результат для комбинации аргументов (min,max). Встроенный Map принимает только одно значение как ключ.
Есть много возможных решений:
	1. Реализовать новую (или использовать стороннюю) структуру данных для коллекции, которая более универсальна, чем встроенный Map, и поддерживает множественные ключи.
	2. Использовать вложенные коллекции: cache.set(min) будет Map, которая хранит пару (max, result). Тогда получить result мы сможем, вызвав cache.get(min).get(max).
	3. Соединить два значения в одно. В нашем конкретном случае мы можем просто использовать строку "min,max" как ключ к Map. Для гибкости, мы можем позволить передавать хеширующую функцию в декоратор, которая знает, как сделать одно значение из многих.
Для многих практических применений третий вариант достаточно хорош, поэтому мы будем придерживаться его.
Также нам понадобится заменить func.call(this, x) на func.call(this, ...arguments), чтобы передавать все аргументы обёрнутой функции, а не только первый.
Вот более мощный cachingDecorator:
	let worker = {
		slow(min, max) {
			alert(`Called with ${min},${max}`);
			return min + max;
		}
	};
	function cachingDecorator(func, hash) {
		let cache = new Map();
		return function() {
			let key = hash(arguments); // (*)
			if (cache.has(key)) {return cache.get(key)};
			let result = func.call(this, ...arguments); // (**)
			cache.set(key, result);
			return result;
		};
	}
	function hash(args) {
		return args[0] + ',' + args[1];
	}
	worker.slow = cachingDecorator(worker.slow, hash);
	alert( worker.slow(3, 5) ); // работает
	alert( "Again " + worker.slow(3, 5) ); // аналогично (из кеша)
Теперь он работает с любым количеством аргументов.
Есть два изменения:
	- В строке (*) вызываем hash для создания одного ключа из arguments. Здесь мы используем простую функцию «объединения», которая превращает аргументы (3, 5) в ключ "3,5". В более сложных случаях могут потребоваться другие функции хеширования.
	- Затем в строке (**) используем func.call(this, ...arguments) для передачи как контекста, так и всех аргументов, полученных обёрткой (независимо от их количества), в исходную функцию.
Вместо func.call(this, ...arguments) мы могли бы написать func.apply(this, arguments).
	Синтаксис встроенного метода func.apply: func.apply(context, args);
Он выполняет func, устанавливая this=context и принимая в качестве списка аргументов псевдомассив args.
Единственная разница в синтаксисе между call и apply состоит в том, что call ожидает список аргументов, в то время как apply принимает псевдомассив.
Эти два вызова почти эквивалентны:
	func.call(context, ...args); // передаёт массив как список с оператором расширения
	func.apply(context, args);   // тот же эффект
Есть только одна небольшая разница:
	- Оператор расширения ... позволяет передавать перебираемый объект args в виде списка в call.
	- А apply принимает только псевдомассив args.
Так что эти вызовы дополняют друг друга. Для перебираемых объектов сработает call, а где мы ожидаем псевдомассив – apply.
А если у нас объект, который и то, и другое, например, реальный массив, то технически мы могли бы использовать любой метод, но apply, вероятно, будет быстрее, потому что большинство движков JS внутренне оптимизируют его лучше.
Передача всех аргументов вместе с контекстом другой функции называется "перенаправлением вызова" (call forwarding).
Простейший вид такого перенаправления:
	let wrapper = function() {
		return func.apply(this, arguments);
	};
При вызове wrapper из внешнего кода его не отличить от вызова исходной функции.

Заимствование метода.
Теперь давайте сделаем ещё одно небольшое улучшение функции хеширования:
	function hash(args) {
		return args[0] + ',' + args[1];
	}
На данный момент она работает только для двух аргументов. Было бы лучше, если бы она могла склеить любое количество args.
Естественным решением было бы использовать метод arr.join:
	function hash(args) {return args.join()};
…К сожалению, это не сработает, потому что мы вызываем hash(arguments), а объект arguments является перебираемым и псевдомассивом, но не реальным массивом.
Таким образом, вызов join для него потерпит неудачу, что мы и можем видеть ниже:
	function hash() {
		alert( arguments.join() ); // Ошибка: arguments.join не является функцией
	}
	hash(1, 2);
Тем не менее, есть простой способ использовать соединение массива:
	function hash() {
		alert( [].join.call(arguments) ); // 1,2
	}
	hash(1, 2);
Этот трюк называется заимствование метода.
Мы берём (заимствуем) метод join из обычного массива [].join. И используем [].join.call, чтобы выполнить его в контексте arguments.
Почему это работает?
Это связано с тем, что внутренний алгоритм встроенного метода arr.join(glue) очень прост. Взято из спецификации практически как есть:
	1. Пускай первым аргументом будет glue или, в случае отсутствия аргументов, им будет запятая ","
	2. Пускай result будет пустой строкой "".
	3. Добавить this[0] к result.
	4. Добавить glue и this[1].
	5. Добавить glue и this[2].
	6. …выполнять до тех пор, пока this.length элементов не будет склеено.
	7. Вернуть result.
Таким образом, технически он принимает this и объединяет this[0], this[1]… и т.д. вместе. Он намеренно написан так, что допускает любой псевдомассив this (не случайно, многие методы следуют этой практике). Вот почему он также работает с this=arguments.

Итого:
Декоратор – это обёртка вокруг функции, которая изменяет поведение последней. Основная работа по-прежнему выполняется функцией.
Обычно безопасно заменить функцию или метод декорированным, за исключением одной мелочи. Если исходная функция предоставляет свойства, такие как func.calledCount или типа того, то декорированная функция их не предоставит. Потому что это обёртка. Так что нужно быть осторожным в их использовании. Некоторые декораторы предоставляют свои собственные свойства.
Декораторы можно рассматривать как "дополнительные возможности" или "аспекты", которые можно добавить в функцию. Мы можем добавить один или несколько декораторов. И всё это без изменения кода оригинальной функции!
Для реализации cachingDecorator мы изучили методы:
	func.call(context, arg1, arg2…); // вызывает func с данным контекстом и аргументами.
	func.apply(context, args); // вызывает func, передавая context как this и псевдомассив args как список аргументов.
В основном переадресация вызова выполняется с помощью apply:
	let wrapper = function(original, arguments) {
		return original.apply(this, arguments);
	};
Мы также рассмотрели пример заимствования метода, когда мы вызываем метод у объекта в контексте другого объекта. Весьма распространено заимствовать методы массива и применять их к arguments. В качестве альтернативы можно использовать объект с остаточными параметрами ...args, который является реальным массивом.
На практике декораторы используются для самых разных задач. Проверьте, насколько хорошо вы их освоили, решая задачи этой главы.

Задачи: 1- 2-+ 3- 4-
1. Декоратор-шпион (важность: 5)
Создайте декоратор spy(func), который должен возвращать обёртку, которая сохраняет все вызовы функции в своём свойстве calls.
Каждый вызов должен сохраняться как массив аргументов.
Например:
	function work(a, b){alert(a + b)}; // произвольная функция или метод
	work = spy(work);
	work(1, 2); // 3
	work(4, 5); // 9
	for (let args of work.calls) {
		alert('call:' + args.join()); // "call:1,2", "call:4,5"
	}
P.S.: Этот декоратор иногда полезен для юнит-тестирования. 
Его расширенная форма – sinon.spy – содержится в библиотеке Sinon.JS ['https://sinonjs.org/'].
решение:
	Обертка, возвращаемая spy(f), должна хранить все аргументы, и затем использовать f.apply для переадресации вызова.
	function spy(func){
		function wrapper(...args) {
			wrapper.calls.push(args);
			return func.apply(this, args);
		}
		wrapper.calls = [];
		console.log('calls', wrapper.calls);
		return wrapper;
	}
	function workS(a, b) {console.log(a + b)}; // произвольная функция или метод
	workS = spy(workS);
	workS(1, 2); // 3
	workS(4, 5); // 9
	console.log(workS.calls); // ?undefined
	for (let args of workS.calls) {
		console.log("call:" + args.join()); // "call:1,2", "call:4,5"
	}

2. Задерживающий декоратор (важность: 5)
Создайте декоратор delay(f, ms), который задерживает каждый вызов f на ms миллисекунд. Например:
	function f(x) {alert(x)}
	// создаём обёртки
	let f1000 = delay(f, 1000);
	let f1500 = delay(f, 1500);
	f1000("test"); // показывает "test" после 1000 мс
	f1500("test"); // показывает "test" после 1500 мс
Другими словами, delay(f, ms) возвращает вариант f с «задержкой на ms мс».
В приведённом выше коде f – функция с одним аргументом, но ваше решение должно передавать все аргументы и контекст this.
решение:
		function delay(f, ms) {
			return function() {
				setTimeout(() => f.apply(this, arguments), ms);
			};
		}
		function f(x) {console.log(x)};
		let f1000 = delay(f, 1000);
		f1000("test"); // показывает "test" после 1000 мс
	Обратите внимание, как здесь используется функция-стрелка. Как мы знаем, функция-стрелка не имеет собственных this и arguments, поэтому f.apply(this, arguments) берет this и arguments из обёртки.
	Если мы передадим обычную функцию, setTimeout вызовет её без аргументов и с this=window (при условии, что код выполняется в браузере).
	Мы всё ещё можем передать правильный this, используя промежуточную переменную, но это немного громоздко:
		function delay(f, ms) {
			return function(...args) {
				let savedThis = this; // сохраняем this в промежуточную переменную
				setTimeout(function() {
					f.apply(savedThis, args); // используем её
				}, ms);
			};
		}

3. Декоратор debounce (важность: 5)
Результат декоратора debounce(f, ms) – это обёртка, которая откладывает вызовы f, пока не пройдёт ms миллисекунд бездействия (без вызовов, "cooldown period"), а затем вызывает f один раз с последними аргументами.
Другими словами, debounce – это так называемый секретарь, который принимает "телефонные звонки", и ждёт, пока не пройдет ms миллисекунд тишины. И только после этого передает "начальнику" информацию о последнем звонке (вызывает непосредственно f).
Например, у нас была функция f и мы заменили её на f = debounce(f, 1000).
Затем, если обёрнутая функция вызывается в 0, 200 и 500 мс, а потом вызовов нет, то фактическая f будет вызвана только один раз, в 1500 мс. То есть: по истечению 1000 мс от последнего вызова.
…И она получит аргументы самого последнего вызова, остальные вызовы игнорируются.
Ниже код этого примера (используется декоратор debounce из библиотеки Lodash):
	let f = _.debounce(alert, 1000);
	f("a");
	setTimeout( () => f("b"), 200);
	setTimeout( () => f("c"), 500);
	// Обёрнутая в debounce функция ждёт 1000 мс после последнего вызова, а затем запускает: alert("c")
Теперь практический пример. Предположим, пользователь набирает какой-то текст, и мы хотим отправить запрос на сервер, когда ввод этого текста будет завершён. Нет смысла отправлять запрос для каждого набранного символа. Вместо этого мы хотели бы подождать, а затем обработать весь результат.
В браузере мы можем настроить обработчик событий – функцию, которая вызывается при каждом изменении поля для ввода. Обычно обработчик событий вызывается очень часто, для каждого набранного символа. Но если мы воспользуемся debounce на 1000мс, то он будет вызван только один раз, через 1000мс после последнего ввода символа. На втором поле вызывается функция, обёрнутая в debounce, поэтому его содержимое обрабатывается через 1000мс с момента последнего ввода.
Таким образом, debounce – это отличный способ обработать последовательность событий: будь то последовательность нажатий клавиш, движений мыши или ещё что-либо. Он ждёт заданное время после последнего вызова, а затем запускает свою функцию, которая может обработать результат.
Задача — реализовать декоратор debounce.
Подсказка: это всего лишь несколько строк, если вдуматься :)
решение:
	function debounce(func, ms) {
		let timeout;
		return function() {
			clearTimeout(timeout);
			timeout = setTimeout(() => func.apply(this, arguments), ms);
		};
	} // Вызов debounce возвращает обёртку. При вызове он планирует вызов исходной функции через указанное количество ms и отменяет предыдущий такой тайм-аут.

4. Тормозящий (throttling) декоратор (важность: 5)
Создайте тормозящий декоратор throttle(f, ms), который возвращает обёртку.
При многократном вызове он передает вызов f не чаще одного раза в ms миллисекунд.
По сравнению с декоратором debounce поведение совершенно другое:
	debounce запускает функцию один раз после периода бездействия. Подходит для обработки конечного результата.
	throttle запускает функцию не чаще, чем указанное время ms. Подходит для регулярных обновлений, которые не должны быть слишком частыми.
Другими словами, throttle похож на секретаря, который принимает телефонные звонки, но при этом беспокоит начальника (вызывает непосредственно f) не чаще, чем один раз в ms миллисекунд.
Давайте рассмотрим реальное применение, чтобы лучше понять это требование и выяснить, откуда оно взято.
Например, мы хотим отслеживать движения мыши.
В браузере мы можем реализовать функцию, которая будет запускаться при каждом перемещении указателя и получать его местоположение. Во время активного использования мыши эта функция запускается очень часто, что-то около 100 раз в секунду (каждые 10 мс). Мы бы хотели обновлять некоторую информацию на странице при передвижении указателя.
…Но функция обновления update() слишком ресурсоёмкая, чтобы делать это при каждом микродвижении. Да и нет смысла делать обновление чаще, чем один раз в 1000 мс.
Поэтому мы обернём вызов в декоратор: будем использовать throttle(update, 1000) как функцию, которая будет запускаться при каждом перемещении указателя вместо оригинальной update(). Декоратор будет вызываться часто, но передавать вызов в update() максимум раз в 1000 мс.
Визуально это будет выглядеть вот так:
Для первого движения указателя декорированный вариант сразу передаёт вызов в update. Это важно, т.к. пользователь сразу видит нашу реакцию на его перемещение.
Затем, когда указатель продолжает движение, в течение 1000 мс ничего не происходит. Декорированный вариант игнорирует вызовы.
По истечению 1000 мс происходит ещё один вызов update с последними координатами.
Затем, наконец, указатель где-то останавливается. Декорированный вариант ждёт, пока не истечёт 1000 мс, и затем вызывает update с последними координатами. В итоге окончательные координаты указателя тоже обработаны.
Пример кода:
	function f(a) {console.log(a)}
	let f1000 = throttle(f, 1000); // f1000 передаёт вызовы f максимум раз в 1000 мс
	f1000(1); // показывает 1
	f1000(2); // (ограничение, 1000 мс ещё нет)
	f1000(3); // (ограничение, 1000 мс ещё нет)
	// когда 1000 мс истекли, выводим 3, промежуточное значение 2 было проигнорировано
P.S. Аргументы и контекст this, переданные в f1000, должны быть переданы в оригинальную f.
решение:
	function throttle(func, ms) {
		let isThrottled = false, savedArgs, savedThis;
		function wrapper() {
			if (isThrottled) { // (2)
				savedArgs = arguments;
				savedThis = this;
				return;
			}
			func.apply(this, arguments); // (1)
			isThrottled = true;
			setTimeout(function() {
				isThrottled = false; // (3)
				if (savedArgs) {
					wrapper.apply(savedThis, savedArgs);
					savedArgs = savedThis = null;
				}
			}, ms);
		}
		return wrapper;
	}
Вызов throttle(func, ms) возвращает wrapper.
Во время первого вызова обёртка просто вызывает func и устанавливает состояние задержки (isThrottled = true).
В этом состоянии все вызовы запоминаются в saveArgs / saveThis. Обратите внимание, что контекст и аргументы одинаково важны и должны быть запомнены. Они нам нужны для того, чтобы воспроизвести вызов позднее.
Затем по прошествии ms миллисекунд срабатывает setTimeout. Состояние задержки сбрасывается (isThrottled = false). И если мы проигнорировали вызовы, то «обёртка» выполняется с последними запомненными аргументами и контекстом.
На третьем шаге выполняется не func, а wrapper, потому что нам нужно не только выполнить func, но и ещё раз установить состояние задержки и таймаут для его сброса.

#1.6.10. Привязка контекста к функции
31.3.25 - https://learn.javascript.ru/bind
При передаче методов объекта в качестве колбэков, например для setTimeout, возникает известная проблема – потеря this.
В этой главе мы посмотрим, как её можно решить.

Потеря this.
Мы уже видели примеры потери this. Как только метод передаётся отдельно от объекта – this теряется.
Вот как это может произойти в случае с setTimeout:
	let user = {
		firstName: "Вася",
		sayHi() {alert(`Привет, ${this.firstName}!`)}
	};
	setTimeout(user.sayHi, 1000); // Привет, undefined!
При запуске этого кода мы видим, что вызов this.firstName возвращает не «Вася», а undefined!
Это произошло потому, что setTimeout получил функцию sayHi отдельно от объекта user (именно здесь функция и потеряла контекст). То есть последняя строка может быть переписана как:
	let f = user.sayHi;
	setTimeout(f, 1000); // контекст user потеряли
Метод setTimeout в браузере имеет особенность: он устанавливает this=window для вызова функции (в Node.js this становится объектом таймера, но здесь это не имеет значения). Таким образом, для this.firstName он пытается получить window.firstName, которого не существует. В других подобных случаях this обычно просто становится undefined.
Задача довольно типичная – мы хотим передать метод объекта куда-то ещё (в этом конкретном случае – в планировщик), где он будет вызван. Как бы сделать так, чтобы он вызывался в правильном контексте?

Решение 1: сделать функцию-обёртку.
Самый простой вариант решения – это обернуть вызов в анонимную функцию, создав замыкание:
	let user = {
		firstName: "Вася",
		sayHi() {alert(`Привет, ${this.firstName}!`)}
	};
	setTimeout(function() {
		user.sayHi(); // Привет, Вася!
	}, 1000);
Теперь код работает корректно, так как объект user достаётся из замыкания, а затем вызывается его метод sayHi.
То же самое, только короче:
	setTimeout(() => user.sayHi(), 1000); // Привет, Вася!
Выглядит хорошо, но теперь в нашем коде появилась небольшая уязвимость.
Что произойдёт, если до момента срабатывания setTimeout (ведь задержка составляет целую секунду!) в переменную user будет записано другое значение? Тогда вызов неожиданно будет совсем не тот!
	let user = {
		firstName: "Вася",
		sayHi() {alert(`Привет, ${this.firstName}!`)}
	};
	setTimeout(() => user.sayHi(), 1000);
	user = {sayHi(){alert("Другой пользователь в 'setTimeout'!")}}; // ...в течение 1 секунды
	// Другой пользователь в 'setTimeout'!
Следующее решение гарантирует, что такого не случится.

Решение 2: привязать контекст с помощью bind.
В современном JS у функций есть встроенный метод bind, который позволяет зафиксировать this.
Базовый синтаксис bind:
	// полный синтаксис будет представлен немного позже
	let boundFunc = func.bind(context);
Результатом вызова func.bind(context) является особый "экзотический объект" (термин взят из спецификации), который вызывается как функция и прозрачно передаёт вызов в func, при этом устанавливая this=context.
Другими словами, вызов boundFunc подобен вызову func с фиксированным this.
Например, здесь funcUser передаёт вызов в func, фиксируя this=user:
	let user = {firstName: "Вася"};
	function func() {alert(this.firstName)}
	let funcUser = func.bind(user);
	funcUser(); // Вася
Здесь func.bind(user) – это "связанный вариант" func, с фиксированным this=user.
Все аргументы передаются исходному методу func как есть, например:
	let user = {firstName: "Вася"};
	function func(phrase) {alert(phrase + ', ' + this.firstName)}
	let funcUser = func.bind(user); // привязка this к user
	funcUser("Привет"); // Привет, Вася (аргумент "Привет" передан, при этом this = user)
Теперь давайте попробуем с методом объекта:
	let user = {
		firstName: "Вася",
		sayHi() {alert(`Привет, ${this.firstName}!`)}
	};
	let sayHi = user.sayHi.bind(user); // (*)
	sayHi(); // Привет, Вася!
	setTimeout(sayHi, 1000); // Привет, Вася!
В строке (*) мы берём метод user.sayHi и привязываем его к user. Теперь sayHi – это "связанная" функция, которая может быть вызвана отдельно или передана в setTimeout (контекст всегда будет правильным).
Здесь мы можем увидеть, что bind исправляет только this, а аргументы передаются как есть:
	let user = {
		firstName: "Вася",
		say(phrase) {alert(`${phrase}, ${this.firstName}!`)}
	};
	let say = user.say.bind(user);
	say("Привет"); // Привет, Вася (аргумент "Привет" передан в функцию "say")
	say("Пока"); // Пока, Вася (аргумент "Пока" передан в функцию "say")

Удобный метод: bindAll.
Если у объекта много методов и мы планируем их активно передавать, то можно привязать контекст для них всех в цикле:
	for (let key in user) {
		if (typeof user[key] == 'function') user[key] = user[key].bind(user);
	}
Некоторые JS-библиотеки предоставляют встроенные функции для удобной массовой привязки контекста, например _.bindAll(obj) в lodash.

Частичное применение.
До сих пор мы говорили только о привязывании this. Давайте шагнём дальше.
Мы можем привязать не только this, но и аргументы. Это делается редко, но иногда может быть полезно.
Полный синтаксис bind:
	let bound = func.bind(context, [arg1], [arg2], ...); // привязка контекст this и начальных аргументов функции func.
Это позволяет привязать контекст this и начальные аргументы функции.
Например, у нас есть функция умножения mul(a, b):
	function mul(a, b) {return a * b};
Давайте воспользуемся bind, чтобы создать функцию double на её основе:
	function mul(a, b) {return a * b};
	let double = mul.bind(null, 2);
	alert( double(3) ); // = mul(2, 3) = 6
	alert( double(4) ); // = mul(2, 4) = 8
	alert( double(5) ); // = mul(2, 5) = 10
Вызов mul.bind(null, 2) создаёт новую функцию double, которая передаёт вызов mul, фиксируя null как контекст, и 2 – как первый аргумент. Следующие аргументы передаются как есть.
Это называется частичное применение – мы создаём новую функцию, фиксируя некоторые из существующих параметров.
Обратите внимание, что в данном случае мы на самом деле не используем this. Но для bind это обязательный параметр, так что мы должны передать туда что-нибудь вроде null.
В следующем коде функция triple умножает значение на три:
	function mul(a, b) {return a * b};
	let triple = mul.bind(null, 3);
	alert( triple(3) ); // = mul(3, 3) = 9
	alert( triple(4) ); // = mul(3, 4) = 12
	alert( triple(5) ); // = mul(3, 5) = 15
Для чего мы обычно создаём частично применённую функцию?
Польза от этого в том, что возможно создать независимую функцию с понятным названием (double, triple). Мы можем использовать её и не передавать каждый раз первый аргумент, т.к. он зафиксирован с помощью bind.
В других случаях частичное применение полезно, когда у нас есть очень общая функция и для удобства мы хотим создать её более специализированный вариант.
Например, у нас есть функция send(from, to, text). Потом внутри объекта user мы можем захотеть использовать её частный вариант: sendTo(to, text), который отправляет текст от имени текущего пользователя.

Частичное применение без контекста.
Что если мы хотим зафиксировать некоторые аргументы, но не контекст this? Например, для метода объекта.
Встроенный bind не позволяет этого. Мы не можем просто опустить контекст и перейти к аргументам.
К счастью, легко создать вспомогательную функцию partial, которая привязывает только аргументы.
Вот так:
	function partial(func, ...argsBound) {
		return function(...args) { // (*)
			return func.call(this, ...argsBound, ...args);
		}
	}
	// использование:
	let user = {
		firstName: "John",
		say(time, phrase) {alert(`[${time}] ${this.firstName}: ${phrase}!`)}
	};
	// добавляем частично применённый метод с фиксированным временем
	user.sayNow = partial(user.say, new Date().getHours() + ':' + new Date().getMinutes());
	user.sayNow("Hello");
	// Что-то вроде этого:
	// [10:00] John: Hello!
Результатом вызова partial(func[, arg1, arg2...]) будет обёртка (*), которая вызывает func с:
	Тем же this, который она получает (для вызова user.sayNow – это будет user)
	Затем передаёт ей ...argsBound – аргументы из вызова partial ("10:00")
	Затем передаёт ей ...args – аргументы, полученные обёрткой ("Hello")
Благодаря оператору расширения ... реализовать это очень легко, не правда ли?
Также есть готовый вариант _.partial из библиотеки lodash.

Итого:
Метод bind возвращает привязанный вариант функции func, фиксируя контекст this и первые аргументы arg1, arg2…, если они заданы.
Обычно bind применяется для фиксации this в методе объекта, чтобы передать его в качестве колбэка. Например, для setTimeout.
Когда мы привязываем аргументы, такая функция называется частично применённой или частичной.
Частичное применение удобно, когда мы не хотим повторять один и тот же аргумент много раз. Например, если у нас есть функция send(from, to) и from всё время будет одинаков для нашей задачи, то мы можем создать частично применённую функцию и дальше работать с ней.

Задачи: 1- 2- 3- 4+ 5+
1. Связанная функция как метод (важность: 5)
Что выведет функция?
	function f() {alert(this)}; // ? 
	let user = {g: f.bind(null)};
	user.g();
решение:
	Ответ: null.
		function f() {alert( this )}; // null
		let user = {g: f.bind(null)};
		user.g();
	Контекст связанной функции жёстко фиксирован. Изменить однажды привязанный контекст уже нельзя.
	Так что хоть мы и вызываем user.g(), внутри исходная функция будет вызвана с this=null. Однако, функции g совершенно без разницы, какой this она получила. Её единственное предназначение – это передать вызов в f вместе с аргументами и ранее указанным контекстом null, что она и делает.
	Таким образом, когда мы запускаем user.g(), исходная функция вызывается с this=null.
2. Повторный bind (важность: 5)
Можем ли мы изменить this дополнительным связыванием?
Что выведет этот код?
	function f() {alert(this.name)};
	f = f.bind({name: "Вася"}).bind({name: "Петя"});
	f();
решение: // -
	Ответ: Вася.
		function f() {alert(this.name)};
		f = f.bind({name: "Вася"}).bind({name: "Петя"});
		f(); // Вася
	Экзотический объект bound function, возвращаемый при первом вызове f.bind(...), запоминает контекст (и аргументы, если они были переданы) только во время создания.
	Следующий вызов bind будет устанавливать контекст уже для этого объекта. Это ни на что не повлияет.
	Можно сделать новую привязку, но нельзя изменить существующую.
3. Свойство функции после bind (важность: 5)
В свойство функции записано значение. Изменится ли оно после применения bind? Обоснуйте ответ.
	function sayHi() {alert(this.name)};
	sayHi.test = 5;
	let bound = sayHi.bind({name: "Вася"});
	alert( bound.test ); // что выведет? почему?
решение:
	Ответ: undefined.
	Результатом работы bind является другой объект. У него уже нет свойства test.
4. Исправьте функцию, теряющую "this" (важность: 5)
Вызов askPassword() в приведённом ниже коде должен проверить пароль и затем вызвать user.loginOk/loginFail в зависимости от ответа.
Однако, его вызов приводит к ошибке. Почему?
Исправьте выделенную строку, чтобы всё работало (других строк изменять не надо).
	function askPassword(ok, fail) {
		let password = prompt("Password?", '');
		if (password == "rockstar") ok();
		else fail();
	}
	let user = {
		name: 'Вася',
		loginOk() {alert(`${this.name} logged in`)},
		loginFail() {alert(`${this.name} failed to log in`)},
	};
	askPassword(user.loginOk, user.loginFail); // исправить
решение:
	Ошибка происходит потому, что askPassword получает функции loginOk/loginFail без контекста.
	Когда они вызываются, то, естественно, this=undefined.
	Используем bind, чтобы передать в askPassword функции loginOk/loginFail с уже привязанным контекстом:
		function askPassword(ok, fail) {
			let password = prompt("Password?", '');
			if (password == "rockstar") ok();
			else fail();
		}
		let user = {
			name: 'Вася',
			loginOk() {alert(`${this.name} logged in`)},
			loginFail() {alert(`${this.name} failed to log in`)},
		};
		askPassword(user.loginOk.bind(user), user.loginFail.bind(user));
	Теперь всё работает корректно.
	Альтернативное решение – сделать функции-обёртки над user.loginOk/loginFail:
		//...
		askPassword(() => user.loginOk(), () => user.loginFail());
	Обычно это также работает и хорошо выглядит. Но может не сработать в более сложных ситуациях, а именно – когда значение переменной user меняется между вызовом askPassword и выполнением () => user.loginOk().
5. Использование частично применённой функции для логина (важность: 5)
Это задание является немного усложнённым вариантом одного из предыдущих – Исправьте функцию, теряющую "this".
Объект user был изменён. Теперь вместо двух функций loginOk/loginFail у него есть только одна – user.login(true/false).
Что нужно передать в вызов функции askPassword в коде ниже, чтобы она могла вызывать функцию user.login(true) как ok и функцию user.login(false) как fail?
	function askPassword(ok, fail) {
		let password = prompt("Password?", '');
		if (password == "rockstar") ok();
		else fail();
	}
	let user = {
		name: 'John',
		login(result) {
			alert( this.name + (result ? ' logged in' : ' failed to log in') );
		}
	};
	askPassword(?, ?); // ?
Ваши изменения должны затрагивать только выделенный фрагмент кода.
решение:
	1. Можно использовать стрелочную функцию-обёртку:
		askPassword(() => user.login(true), () => user.login(false));
	Теперь она получает user извне и нормально выполняется.
	2. Или же можно создать частично применённую функцию на основе user.login, которая использует объект user в качестве контекста и получает соответствующий первый аргумент:
		askPassword(user.login.bind(user, true), user.login.bind(user, false));

#1.6.11. Повторяем стрелочные функции
2.4.25 - https://learn.javascript.ru/arrow-functions
Давайте вернёмся к стрелочным функциям.
Стрелочные функции – это не просто "сокращение", чтобы меньше писать. У них есть ряд других полезных особенностей.
При написании JS-кода часто возникают ситуации, когда нам нужно написать небольшую функцию, которая будет выполнена где-то ещё.
Например:
	arr.forEach(func) – func выполняется forEach для каждого элемента массива.
	setTimeout(func) – func выполняется встроенным планировщиком.
…и так далее.
Это очень в духе JS – создать функцию и передать её куда-нибудь.
И в таких функциях мы обычно не хотим выходить из текущего контекста. Здесь как раз и полезны стрелочные функции.

У стрелочных функций нет this.
Как мы помним из главы Методы объекта, "this", у стрелочных функций нет this. Если происходит обращение к this, его значение берётся снаружи.
Например, мы можем использовать это для итерации внутри метода объекта:
	let group = {
		title: "Our Group",
		students: ["John", "Pete", "Alice"],
		showList() {
			this.students.forEach(
				student => alert(this.title + ': ' + student)
			);
		}
	};
	group.showList();
Здесь внутри forEach использована стрелочная функция, таким образом this.title в ней будет иметь точно такое же значение, как в методе showList: group.title.
Если бы мы использовали обычную функцию, была бы ошибка:
	let group = {
		title: "Our Group",
		students: ["John", "Pete", "Alice"],
		showList() {
			this.students.forEach(function(student) {alert(this.title + ': ' + student)});
		}
	};
	group.showList(); // Error: Cannot read property 'title' of undefined
Ошибка возникает потому, что forEach по умолчанию выполняет функции с this, равным undefined, и в итоге мы пытаемся обратиться к undefined.title.
Это не влияет на стрелочные функции, потому что у них просто нет this.

Стрелочные функции нельзя использовать с new.
Отсутствие this естественным образом ведёт к другому ограничению: стрелочные функции не могут быть использованы как конструкторы. Они не могут быть вызваны с new.

Стрелочные функции vs bind.
Существует тонкая разница между стрелочной функцией => и обычной функцией, вызванной с .bind(this):
	- .bind(this) создаёт "связанную версию" функции.
	- Стрелка => ничего не привязывает. У функции просто нет this. При получении значения this – оно, как обычная переменная, берётся из внешнего лексического окружения.

Стрелочные функции не имеют arguments.
У стрелочных функций также нет переменной arguments.
Это отлично подходит для декораторов, когда нам нужно пробросить вызов с текущими this и arguments.
Например, defer(f, ms) принимает функцию и возвращает обёртку над ней, которая откладывает вызов на ms миллисекунд:
	function defer(f, ms) {
		return function() {
			setTimeout(() => f.apply(this, arguments), ms)
		};
	}
	function sayHi(who) {alert('Hello, ' + who)}
	let sayHiDeferred = defer(sayHi, 2000);
	sayHiDeferred("John"); // выводит "Hello, John" через 2 секунды
То же самое без стрелочной функции выглядело бы так:
	function defer(f, ms) {
		return function(...args) {
			let ctx = this;
			setTimeout(function() {
				return f.apply(ctx, args);
			}, ms);
		};
	}
Здесь мы были вынуждены создать дополнительные переменные args и ctx, чтобы функция внутри setTimeout могла получить их.

Итого - Стрелочные функции:
	- Не имеют this.
	- Не имеют arguments.
	- Не могут быть вызваны с new.
	- У них также нет super, но мы про это не говорили. Про это будет в главе Наследование классов.
Всё это потому, что они предназначены для небольшого кода, который не имеет своего контекста, выполняясь в текущем. И они отлично справляются с этой задачей.

#1.7. Свойства объекта, их конфигурация
#1.7.1. Флаги и дескрипторы свойств
4.4.25 - https://learn.javascript.ru/property-descriptors
Флаги и дескрипторы свойств
Как мы знаем, объекты могут содержать свойства.
До этого момента мы рассматривали свойство только как пару "ключ-значение". Но на самом деле свойство объекта гораздо мощнее и гибче.
В этой главе мы изучим дополнительные флаги конфигурации для свойств, а в следующей – увидим, как можно незаметно превратить их в специальные функции – геттеры и сеттеры.

Флаги свойств.
Помимо значения value, свойства объекта имеют три специальных атрибута (так называемые "флаги").
	writable – если true, свойство можно изменить, иначе оно только для чтения.
	enumerable – если true, свойство перечисляется в циклах, в противном случае циклы его игнорируют.
	configurable – если true, свойство можно удалить, а эти атрибуты можно изменять, иначе этого делать нельзя.
Мы ещё не встречали эти атрибуты, потому что обычно они скрыты. Когда мы создаём свойство обычным способом, все они имеют значение true. Но мы можем изменить их в любое время.
Сначала посмотрим, как получить их текущие значения.
Метод Object.getOwnPropertyDescriptor позволяет получить полную информацию о свойстве.
Его синтаксис:
	let descriptor = Object.getOwnPropertyDescriptor(obj, propertyName); // получить полную информацию о свойстве
		obj // объект, из которого мы получаем информацию.
		propertyname // имя свойства.
Возвращаемое значение – это объект, дескриптор свойства: он содержит значение свойства и все его флаги.
Например:
	let user = {name: "John"};
	let descriptor = Object.getOwnPropertyDescriptor(user, 'name');
	alert( JSON.stringify(descriptor, null, 2 ) );
	/* дескриптор свойства:
	{
	  "value": "John",
	  "writable": true,
	  "enumerable": true,
	  "configurable": true
	}
	*/
Чтобы изменить флаги, мы можем использовать метод Object.defineProperty.
Его синтаксис:
	Object.defineProperty(obj, propertyName, descriptor); // определить свойство
		obj, propertyName // объект и его свойство, для которого нужно применить дескриптор.
		descriptor // применяемый дескриптор.
Если свойство существует, defineProperty обновит его флаги. В противном случае метод создаёт новое свойство с указанным значением и флагами; если какой-либо флаг не указан явно, ему присваивается значение false.
Например, здесь создаётся свойство name, все флаги которого имеют значение false:
	let user = {};
	Object.defineProperty(user, "name", {
		value: "John"
	});
	let descriptor = Object.getOwnPropertyDescriptor(user, 'name');
	alert( JSON.stringify(descriptor, null, 2 ) );
	/*
	{
	  "value": "John",
	  "writable": false,
	  "enumerable": false,
	  "configurable": false
	}
	 */
Сравните это с предыдущим примером, в котором мы создали свойство user.name «обычным способом»: в этот раз все флаги имеют значение false. Если это не то, что нам нужно, надо присвоить им значения true в параметре descriptor.
Теперь давайте рассмотрим на примерах, что нам даёт использование флагов.

Только для чтения.
Сделаем свойство user.name доступным только для чтения. Для этого изменим флаг writable:
	let user = {name: "John"};
	Object.defineProperty(user, "name", {
		writable: false
	});
	user.name = "Pete"; // Ошибка: Невозможно изменить доступное только для чтения свойство 'name'
Теперь никто не сможет изменить имя пользователя, если только не обновит соответствующий флаг новым вызовом defineProperty.

Ошибки появляются только в строгом режиме.
В нестрогом режиме, без use strict, мы не увидим никаких ошибок при записи в свойства «только для чтения» и т.п. Но эти операции всё равно не будут выполнены успешно. Действия, нарушающие ограничения флагов, в нестрогом режиме просто молча игнорируются.

Вот тот же пример, но свойство создано "с нуля":
	let user = { };
	Object.defineProperty(user, "name", {
		value: "John",
		// для нового свойства необходимо явно указывать все флаги, для которых значение true
		enumerable: true,
		configurable: true
	});
	alert(user.name); // John
	user.name = "Pete"; // Ошибка

Неперечислимое свойство.
Теперь добавим собственный метод toString к объекту user.
Встроенный метод toString в объектах – неперечислимый, его не видно в цикле for..in. Но если мы напишем свой собственный метод toString, цикл for..in будет выводить его по умолчанию:
	let user = {
		name: "John",
		toString() {return this.name}
	};
	// По умолчанию оба свойства выведутся:
	for (let key in user) alert(key); // name, toString
Если мы этого не хотим, можно установить для свойства enumerable:false. Тогда оно перестанет появляться в цикле for..in аналогично встроенному toString:
	let user = {
		name: "John",
		toString() {return this.name}
	};
	Object.defineProperty(user, "toString", {
		enumerable: false
	});
	// Теперь наше свойство toString пропало из цикла:
	for (let key in user) alert(key); // name
Неперечислимые свойства также не возвращаются Object.keys:
	alert(Object.keys(user)); // name

Неконфигурируемое свойство.
Флаг неконфигурируемого свойства (configurable:false) иногда предустановлен для некоторых встроенных объектов и свойств.
Неконфигурируемое свойство не может быть удалено, его атрибуты не могут быть изменены.
Например, свойство Math.PI – только для чтения, неперечислимое и неконфигурируемое:
	let descriptor = Object.getOwnPropertyDescriptor(Math, 'PI');
	alert( JSON.stringify(descriptor, null, 2 ) );
	/*
	{
	  "value": 3.141592653589793,
	  "writable": false,
	  "enumerable": false,
	  "configurable": false
	}
	*/
То есть программист не сможет изменить значение Math.PI или перезаписать его.
	Math.PI = 3; // Ошибка, потому что writable: false
	// delete Math.PI тоже не сработает
Мы также не можем изменить writable:
	// Ошибка, из-за configurable: false
	Object.defineProperty(Math, "PI", { writable: true });
Мы абсолютно ничего не можем сделать с Math.PI.
Определение свойства как неконфигурируемого – это дорога в один конец. Мы не можем изменить его обратно с помощью defineProperty.
Обратите внимание: configurable: false не даст изменить флаги свойства, а также не даст его удалить. При этом можно изменить значение свойства.
В коде ниже свойство user.name является неконфигурируемым, но мы все ещё можем изменить его значение (т.к. writable: true).
	let user = {name: "John"};
	Object.defineProperty(user, "name", {
		configurable: false
	});
	user.name = "Pete"; // работает
	delete user.name; // Ошибка
А здесь мы делаем user.name "навечно запечатанной" константой, как и встроенный Math.PI:
	let user = {name: "John"};
	Object.defineProperty(user, "name", {
		writable: false,
		configurable: false
	});
	// теперь невозможно изменить user.name или его флаги
	// всё это не будет работать:
	user.name = "Pete";
	delete user.name;
	Object.defineProperty(user, "name", { value: "Pete" });
Ошибки отображаются только в строгом режиме.
В нестрогом режиме мы не увидим никаких ошибок при записи в свойства «только для чтения» и т.п. Эти операции всё равно не будут выполнены успешно. Действия, нарушающие ограничения флагов, в нестрогом режиме просто молча игнорируются.

Метод Object.defineProperties().
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperties']
Существует метод Object.defineProperties(obj, descriptors), который позволяет определять множество свойств сразу.
Его синтаксис:
	Object.defineProperties(obj, {
		prop1: descriptor1,
		prop2: descriptor2
		// ...
	});
Например:
	Object.defineProperties(user, {
		name: { value: "John", writable: false },
		surname: { value: "Smith", writable: false },
		// ...
	});
Таким образом, мы можем определить множество свойств одной операцией.

Object.getOwnPropertyDescriptors().
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/getOwnPropertyDescriptors']
Чтобы получить все дескрипторы свойств сразу, можно воспользоваться методом Object.getOwnPropertyDescriptors(obj).
Вместе с Object.defineProperties этот метод можно использовать для клонирования объекта вместе с его флагами:
	let clone = Object.defineProperties({}, Object.getOwnPropertyDescriptors(obj));
Обычно при клонировании объекта мы используем присваивание, чтобы скопировать его свойства:
	for (let key in user) {
		clone[key] = user[key]
	}
…Но это не копирует флаги. Так что если нам нужен клон получше, предпочтительнее использовать Object.defineProperties.
Другое отличие в том, что for..in игнорирует символьные и неперечислимые свойства, а Object.getOwnPropertyDescriptors возвращает дескрипторы всех свойств.

Глобальное запечатывание объекта.
Дескрипторы свойств работают на уровне конкретных свойств.
Но ещё есть методы, которые ограничивают доступ ко всему объекту:
Object.preventExtensions(obj) // Запрещает добавлять новые свойства в объект.
Object.seal(obj) // Запрещает добавлять/удалять свойства. Устанавливает configurable: false для всех существующих свойств.
Object.freeze(obj) // Запрещает добавлять/удалять/изменять свойства. Устанавливает configurable: false, writable: false для всех существующих свойств.
А также есть методы для их проверки:
Object.isExtensible(obj) // Возвращает false, если добавление свойств запрещено, иначе true.
Object.isSealed(obj) // Возвращает true, если добавление/удаление свойств запрещено и для всех существующих свойств установлено configurable: false.
Object.isFrozen(obj) // Возвращает true, если добавление/удаление/изменение свойств запрещено, и для всех текущих свойств установлено configurable: false, writable: false.
На практике эти методы используются редко.
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/preventExtensions']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/seal']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/isExtensible']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/isSealed']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/isFrozen']

#1.7.2. Свойства-аксессоры - геттеры и сеттеры
6.4.25 - https://learn.javascript.ru/property-accessors
Свойства - геттеры и сеттеры.

Есть два типа свойств объекта.
Первый тип это свойства-данные (data properties). Мы уже знаем, как работать с ними. Все свойства, которые мы использовали до текущего момента, были свойствами-данными.
Второй тип свойств мы ещё не рассматривали. Это свойства-аксессоры (accessor properties). По своей сути это функции, которые используются для присвоения и получения значения, но во внешнем коде они выглядят как обычные свойства объекта.

Геттеры и сеттеры.
Свойства-аксессоры представлены методами: геттер – для чтения и сеттер – для записи. При литеральном объявлении объекта они обозначаются get и set:
	let obj = {
		get propName() {...}, // геттер, срабатывает при чтении obj.propName
		set propName(value) {...} // сеттер, срабатывает при записи obj.propName = value
	};
Геттер срабатывает, когда obj.propName читается, сеттер – когда значение присваивается.
Например, у нас есть объект user со свойствами name и surname:
	let user = {name: "John", surname: "Smith"};
А теперь добавим свойство объекта fullName для полного имени, которое в нашем случае "John Smith". Само собой, мы не хотим дублировать уже имеющуюся информацию, так что реализуем его при помощи аксессора:
	let user = {
		name: "John",
		surname: "Smith",
		get fullName() {return `${this.name} ${this.surname}`}
	};
	alert(user.fullName); // John Smith
Снаружи свойство-аксессор выглядит как обычное свойство. В этом и заключается смысл свойств-аксессоров. Мы не вызываем user.fullName как функцию, а читаем как обычное свойство: геттер выполнит всю работу за кулисами.
На данный момент у fullName есть только геттер. Если мы попытаемся назначить user.fullName=, произойдёт ошибка:
	let user = {
		get fullName() {return `...`}
	};
	user.fullName = "Тест"; // Ошибка (у свойства есть только геттер)
Давайте исправим это, добавив сеттер для user.fullName:
	let user = {
		name: "John",
		surname: "Smith",
		get fullName() {return `${this.name} ${this.surname}`},
		set fullName(value) {
			[this.name, this.surname] = value.split(" ");
		}
	};
	// set fullName запустится с данным значением
	user.fullName = "Alice Cooper";
	alert(user.name); // Alice
	alert(user.surname); // Cooper
В итоге мы получили виртуальное свойство fullName. Его можно прочитать и изменить.

Дескрипторы свойств доступа.
Дескрипторы свойств-аксессоров отличаются от обычных свойств-данных.
Свойства-аксессоры не имеют value и writable, но взамен предлагают функции get и set.
То есть, дескриптор аксессора может иметь:
	get – функция без аргументов, которая сработает при чтении свойства,
	set – функция, принимающая один аргумент, вызываемая при присвоении свойства,
	enumerable – то же самое, что и для свойств-данных,
	configurable – то же самое, что и для свойств-данных.
Например, для создания аксессора fullName при помощи defineProperty мы можем передать дескриптор с использованием get и set:
	let user = {name: "John", surname: "Smith"};
	Object.defineProperty(user, 'fullName', {
		get() {return `${this.name} ${this.surname}`;},
		set(value) {[this.name, this.surname] = value.split(" ");}
	});
	alert(user.fullName); // John Smith
	for(let key in user) alert(key); // name, surname
Ещё раз заметим, что свойство объекта может быть либо свойством-аксессором (с методами get/set), либо свойством-данным (со значением value).
При попытке указать и get, и value в одном дескрипторе будет ошибка:
	// Error: Invalid property descriptor.
	Object.defineProperty({}, 'prop', {
		get() {return 1},
		value: 2
	});

Умные геттеры/сеттеры.
Геттеры/сеттеры можно использовать как обёртки над реальными значениями свойств, чтобы получить больше контроля над операциями с ними.
Например, если мы хотим запретить устанавливать короткое имя для user, мы можем использовать сеттер name для проверки, а само значение хранить в отдельном свойстве _name:
	let user = {
		get name() {return this._name},
		set name(value) {
			if (value.length < 4) {
				alert("Имя слишком короткое, должно быть более 4 символов");
				return;
			}
			this._name = value;
		}
	};
	user.name = "Pete";
	alert(user.name); // Pete
	user.name = ""; // Имя слишком короткое...
Таким образом, само имя хранится в _name, доступ к которому производится через геттер и сеттер.
Технически, внешний код всё ещё может получить доступ к имени напрямую с помощью user._name, но существует широко известное соглашение о том, что свойства, которые начинаются с символа "_", являются внутренними, и к ним не следует обращаться из-за пределов объекта.

Использование для совместимости.
У аксессоров есть интересная область применения – они позволяют в любой момент взять обычное свойство и изменить его поведение, поменяв на геттер и сеттер.
Например, представим, что мы начали реализовывать объект user, используя свойства-данные имя name и возраст age:
	function User(name, age) {
		this.name = name;
		this.age = age;
	}
	let john = new User("John", 25);
	alert( john.age ); // 25
…Но рано или поздно всё может измениться. Взамен возраста age мы можем решить хранить дату рождения birthday, потому что так более точно и удобно:
	function User(name, birthday) {
		this.name = name;
		this.birthday = birthday;
	}
	let john = new User("John", new Date(1992, 6, 1));
Что нам делать со старым кодом, который использует свойство age?
Мы можем попытаться найти все такие места и изменить их, но это отнимает время и может быть невыполнимо, если код используется другими людьми. И кроме того, age – это отличное свойство для user, верно?
Давайте его сохраним.
Добавление геттера для age решит проблему:
	function User(name, birthday) {
		this.name = name;
		this.birthday = birthday;
		Object.defineProperty(this, "age", {
			get() {
				let todayYear = new Date().getFullYear();
				return todayYear - this.birthday.getFullYear();
			}
		}); // возраст рассчитывается из текущей даты и дня рождения
	}
	let john = new User("John", new Date(1992, 6, 1));
	alert( john.birthday ); // доступен как день рождения
	alert( john.age );      // ...так и возраст
Теперь старый код тоже работает, и у нас есть отличное дополнительное свойство!

Николай Минаев (20 дней назад): https://disqus.com/by/disqus_PkYPR5zTJe/
Задачи на данную тему для решения от ИИ:
Задачи: 1+ 2+ 3+ 4+
Задача 1: Геттер и сеттер для объекта.
Создайте объект user с двумя свойствами: firstName и lastName. Добавьте геттер fullName, который возвращает полное имя пользователя в формате "Имя Фамилия", и сеттер fullName, который принимает строку в формате "Имя Фамилия" и разделяет её на firstName и lastName.
	const user = {
		firstName: "Иван",
		lastName: "Иванов",
		// Ваш код здесь (добавьте геттер и сеттер для fullName)
	};
	// Пример использования:
	console.log(user.fullName); // Должно вывести "Иван Иванов"
	user.fullName = "Петр Петров";
	console.log(user.firstName); // Должно вывести "Петр"
	console.log(user.lastName); // Должно вывести "Петров"
решение:
	user = {
		firstName: "Иван",
		lastName: "Иванов",
		get fullName() {return `${this.firstName} ${this.lastName}`},
		set fullName(value) {
			[this.firstName, this.lastName] = value.split(" ");
		}
	};
	console.log(user.fullName); // Иван Иванов
	user.fullName = "Петр Петров";
	console.log(user.firstName); // Петр
	console.log(user.lastName); // Петров

Задача 2: Валидация данных через сеттер.
Создайте объект account с свойством balance (баланс). Добавьте сеттер для balance, который проверяет, что новое значение баланса является числом и не может быть отрицательным. Если значение невалидно, выводите ошибку в консоль.
	const account = {
		_balance: 0, // Внутреннее свойство для хранения баланса
		// Ваш код здесь (добавьте геттер и сеттер для balance)
	};
	// Пример использования:
	account.balance = 100;
	console.log(account.balance); // Должно вывести 100
	account.balance = -50; // Должно вывести ошибку в консоль
	console.log(account.balance); // Должно остаться 100
	account.balance = "не число"; // Должно вывести ошибку в консоль
	console.log(account.balance); // Должно остаться 100
решение:
	const account = {
		_balance: 0, // Внутреннее свойство для хранения баланса
		get balance(){return this._balance},
		set balance(value){
			if (value < 0 || typeof value != "number") return console.log('error');
			this._balance += value;
		}
	};
	account.balance = 100;
	console.log(account.balance); // 100
	account.balance = -50; // error
	console.log(account.balance); // 100
	account.balance = "не число"; // error
	console.log(account.balance); // 100

Задача 3: Вычисляемое свойство
Создайте объект rectangle с свойствами width и height. Добавьте геттер area, который возвращает площадь прямоугольника (ширина * высота), и сеттер area, который принимает площадь и изменяет ширину и высоту так, чтобы площадь соответствовала переданному значению, сохраняя пропорции.
	const rectangle = {
		width: 10,
		height: 5,
		// Ваш код здесь (добавьте геттер и сеттер для area)
	};
	// Пример использования:
	console.log(rectangle.area); // Должно вывести 50 (10 * 5)
	rectangle.area = 100;
	console.log(rectangle.width); // Должно вывести 20
	console.log(rectangle.height); // Должно вывести 5 (пропорции сохранены)
решение:
	const rectangle = {
		width: 10,
		height: 5,
		_area : this.width * this.height,
		get area(){return this.width * this.height},
		set area(value){
			this._area = value;
			this.width = this._area / this.height;
			this.height = this._area / this.width;
		}
	};
	console.log(rectangle.area); // 50
	rectangle.area = 100;
	console.log(rectangle.width); // 20
	console.log(rectangle.height); // 5

Задача 4: Защита данных через замыкание
Создайте объект config, который хранит настройки. Используйте замыкание, чтобы сделать свойство apiKey доступным только через геттер и сеттер. Сеттер должен проверять, что новый ключ является строкой и имеет длину не менее 10 символов.
решение:
	const config = (() => {
		let _apiKey = "defaultKey123";
		return {
			get apiKey() {return _apiKey},
			set apiKey(value) {
				if (typeof value === "string" && value.length >= 10) {
					_apiKey = value;
				} else {
					console.error("Ошибка: API-ключ должен быть строкой длиной не менее 10 символов.");
				}
			},
		};
	})();
	// Пример использования:
	console.log(config.apiKey); // Должно вывести "defaultKey123"
	config.apiKey = "newKey12345";
	console.log(config.apiKey); // Должно вывести "newKey12345"
	config.apiKey = "short"; // Должно вывести ошибку в консоль
	console.log(config.apiKey); // Должно остаться "newKey12345"

#1.8. Прототипы, наследование

#1.8.1. Прототипное наследование
7.4.25 - https://learn.javascript.ru/prototype-inheritance
Прототипное наследование.
В программировании мы часто хотим взять что-то и расширить.
Например, у нас есть объект user со своими свойствами и методами, и мы хотим создать объекты admin и guest как его слегка изменённые варианты. Мы хотели бы повторно использовать то, что есть у объекта user, не копировать/переопределять его методы, а просто создать новый объект на его основе.
Прототипное наследование — это возможность языка, которая помогает в этом.

[[Prototype]]
В JS объекты имеют специальное скрытое свойство [[Prototype]] (так оно названо в спецификации), которое либо равно null, либо ссылается на другой объект. Этот объект называется прототип.
Прототип даёт нам немного "магии". Когда мы хотим прочитать свойство из object, а оно отсутствует, JS автоматически берёт его из прототипа. В программировании такой механизм называется "прототипным наследованием". Многие интересные возможности языка и техники программирования основываются на нём.
Свойство [[Prototype]] является внутренним и скрытым, но есть много способов задать его.
Одним из них является использование __proto__, например так:
	let animal = {eats: true};
	let rabbit = {jumps: true};
	rabbit.__proto__ = animal;
Если мы ищем свойство в rabbit, а оно отсутствует, JS автоматически берёт его из animal.
Например:
	let animal = {eats: true};
	let rabbit = {jumps: true};
	rabbit.__proto__ = animal; // (*)
	// теперь мы можем найти оба свойства в rabbit:
	alert( rabbit.eats ); // true (**)
	alert( rabbit.jumps ); // true
Здесь строка (*) устанавливает animal как прототип для rabbit.
Затем, когда alert пытается прочитать свойство rabbit.eats (**), его нет в rabbit, поэтому JS следует по ссылке [[Prototype]] и находит его в animal:
							[[Prototype]]
	rabbit {jumps: true} ------------------> animal {eats: true}

Здесь мы можем сказать, что "animal является прототипом rabbit" или "rabbit прототипно наследует от animal".
Так что если у animal много полезных свойств и методов, то они автоматически становятся доступными у rabbit. Такие свойства называются унаследованными.
Если у нас есть метод в animal, он может быть вызван на rabbit:
	let animal = {
		eats: true,
		walk() {alert("Animal walk")}
	};
	let rabbit = {
		jumps: true,
		__proto__: animal
	};
	// walk взят из прототипа
	rabbit.walk(); // Animal walk
Метод автоматически берётся из прототипа.
Цепочка прототипов может быть длиннее:
	let animal = {
		eats: true,
		walk() {alert("Animal walk")}
	};
	let rabbit = {
		jumps: true,
		__proto__: animal
	};
	let longEar = {
		earLength: 10,
		__proto__: rabbit
	};
	// walk взят из цепочки прототипов
	longEar.walk(); // Animal walk
	alert(longEar.jumps); // true (из rabbit)
Теперь, если мы прочтём что-нибудь из longEar, и оно будет отсутствовать, JS будет искать его в rabbit, а затем в animal.
Есть только два ограничения:
	1. Ссылки не могут идти по кругу. JS выдаст ошибку, если мы попытаемся назначить __proto__ по кругу.
	2. Значение __proto__ может быть объектом или null. Другие типы игнорируются.
Это вполне очевидно, но всё же: может быть только один [[Prototype]]. Объект не может наследоваться от двух других объектов.

Свойство __proto__ — исторически обусловленный геттер/сеттер для [[Prototype]].
Это распространённая ошибка начинающих разработчиков – не знать разницы между этими двумя понятиями.
Обратите внимание, что __proto__ — не то же самое, что внутреннее свойство [[Prototype]]. Это геттер/сеттер для [[Prototype]]. Позже мы увидим ситуации, когда это имеет значение, а пока давайте просто будем иметь это в виду, поскольку мы строим наше понимание языка JavaScript.
Свойство __proto__ немного устарело, оно существует по историческим причинам. Современный JS предполагает, что мы должны использовать функции Object.getPrototypeOf/Object.setPrototypeOf вместо того, чтобы получать/устанавливать прототип. Мы также рассмотрим эти функции позже.
По спецификации __proto__ должен поддерживаться только браузерами, но по факту все среды, включая серверную, поддерживают его. Так что мы вполне безопасно его используем.
Далее мы будем в примерах использовать __proto__, так как это самый короткий и интуитивно понятный способ установки и чтения прототипа.

Операция записи не использует прототип.
Прототип используется только для чтения свойств.
Операции записи/удаления работают напрямую с объектом.
В приведённом ниже примере мы присваиваем rabbit собственный метод walk:
	let animal = {
		eats: true,
		walk() {/* этот метод не будет использоваться в rabbit */}
	};
	let rabbit = {__proto__: animal};
	rabbit.walk = function() {alert("Rabbit! Bounce-bounce!")};
	rabbit.walk(); // Rabbit! Bounce-bounce!
Теперь вызов rabbit.walk() находит метод непосредственно в объекте и выполняет его, не используя прототип.
Свойства-аксессоры – исключение, так как запись в него обрабатывается функцией-сеттером. То есть это фактически вызов функции.
По этой причине admin.fullName работает корректно в приведённом ниже коде:
	let user = {
		name: "John",
		surname: "Smith",
		set fullName(value) {
			[this.name, this.surname] = value.split(" ");
		},
		get fullName() {
			return `${this.name} ${this.surname}`;
		}
	};
	let admin = {
		__proto__: user,
		isAdmin: true
	};
	alert(admin.fullName); // John Smith (*) // срабатывает геттер
	admin.fullName = "Alice Cooper"; // (**) срабатывает сеттер
	alert(admin.name); // Alice
	alert(admin.surname); // Cooper
Здесь в строке (*) свойство admin.fullName имеет геттер в прототипе user, поэтому вызывается он. В строке (**) свойство также имеет сеттер в прототипе, который и будет вызван.

Значение this.
В приведённом выше примере может возникнуть интересный вопрос: каково значение this внутри set fullName(value)? Куда записаны свойства this.name и this.surname: в user или в admin?
Ответ прост: прототипы никак не влияют на this.
Неважно, где находится метод: в объекте или его прототипе. При вызове метода this — всегда объект перед точкой.
Таким образом, вызов сеттера admin.fullName= в качестве this использует admin, а не user.
Это на самом деле очень важная деталь, потому что у нас может быть большой объект со множеством методов, от которого можно наследовать. Затем наследующие объекты могут вызывать его методы, но они будут изменять своё состояние, а не состояние объекта-родителя.
Например, здесь animal представляет собой "хранилище методов", и rabbit использует его.
Вызов rabbit.sleep() устанавливает this.isSleeping для объекта rabbit:
	// методы animal
	let animal = {
		walk() {
			if (!this.isSleeping) {alert(`I walk`)}
		},
		sleep() {this.isSleeping = true}
	};
	let rabbit = {
		name: "White Rabbit",
		__proto__: animal
	};
	// модифицирует rabbit.isSleeping
	rabbit.sleep();
	alert(rabbit.isSleeping); // true
	alert(animal.isSleeping); // undefined (нет такого свойства в прототипе)
Если бы у нас были другие объекты, такие как bird, snake и т.д., унаследованные от animal, они также получили бы доступ к методам animal. Но this при вызове каждого метода будет соответствовать объекту (перед точкой), на котором происходит вызов, а не animal. Т.о. у объекта rabbit есть свойство isSleeping: true, а у объекта animal - нет.
Поэтому, когда мы записываем данные в this, они сохраняются в этих объектах.
В результате методы являются общими, а состояние объекта — нет.

Цикл for..in.
Цикл for..in проходит не только по собственным, но и по унаследованным свойствам объекта.
Например:
	let animal = {eats: true};
	let rabbit = {
		jumps: true,
		__proto__: animal
	};
	// Object.keys возвращает только собственные ключи
	alert(Object.keys(rabbit)); // jumps
	// for..in проходит и по своим, и по унаследованным ключам
	for (let prop in rabbit) alert(prop); // jumps, затем eats
Если унаследованные свойства нам не нужны, то мы можем отфильтровать их при помощи встроенного метода obj.hasOwnProperty(key): он возвращает true, если у obj есть собственное, не унаследованное, свойство с именем key.
Пример такой фильтрации:
	let animal = {eats: true};
	let rabbit = {
		jumps: true,
		__proto__: animal
	};
	for (let prop in rabbit) {
		let isOwn = rabbit.hasOwnProperty(prop);
		if (isOwn) {
			alert(`Our: ${prop}`); // Our: jumps
		} else {
			alert(`Inherited: ${prop}`); // Inherited: eats
		}
	};
В этом примере цепочка наследования выглядит так: rabbit наследует от animal, который наследует от Object.prototype (так как animal – литеральный объект {...}, то это по умолчанию), а затем null на самом верху.
Заметим ещё одну деталь. Откуда взялся метод rabbit.hasOwnProperty? Мы его явно не определяли. Если посмотреть на цепочку прототипов, то видно, что он берётся из Object.prototype.hasOwnProperty. То есть он унаследован.
…Но почему hasOwnProperty не появляется в цикле for..in в отличие от eats и jumps? Он ведь перечисляет все унаследованные свойства.
Ответ простой: оно не перечислимо. То есть у него внутренний флаг enumerable стоит false, как и у других свойств Object.prototype. Поэтому оно и не появляется в цикле.

Почти все остальные методы получения ключей/значений игнорируют унаследованные свойства.
Почти все остальные методы, получающие ключи/значения, такие как Object.keys, Object.values и другие – игнорируют унаследованные свойства. Они учитывают только свойства самого объекта, не его прототипа.

Итого:
- В JS все объекты имеют скрытое свойство [[Prototype]], которое является либо другим объектом, либо null.
- Мы можем использовать obj.__proto__ для доступа к нему (исторически обусловленный геттер/сеттер, есть другие способы, которые скоро будут рассмотрены).
- Объект, на который ссылается [[Prototype]], называется "прототипом".
- Если мы хотим прочитать свойство obj или вызвать метод, которого не существует у obj, тогда JS попытается найти его в прототипе.
- Операции записи/удаления работают непосредственно с объектом, они не используют прототип (если это обычное свойство, а не сеттер).
- Если мы вызываем obj.method(), а метод при этом взят из прототипа, то this всё равно ссылается на obj. Таким образом, методы всегда работают с текущим объектом, даже если они наследуются.
- Цикл for..in перебирает как свои, так и унаследованные свойства. Остальные методы получения ключей/значений работают только с собственными свойствами объекта.

Задачи: 1+ 2+- 3+ 4-

1. Работа с прототипами (важность: 5)
В приведённом ниже коде создаются и изменяются два объекта.
Какие значения показываются в процессе выполнения кода?
	let animal = {jumps: null};
	let rabbit = {
		__proto__: animal,
		jumps: true
	};
	alert( rabbit.jumps ); // ? (1) true
	delete rabbit.jumps;
	alert( rabbit.jumps ); // ? (2) null
	delete animal.jumps;
	alert( rabbit.jumps ); // ? (3) undefined
Должно быть 3 ответа.
решение:
	1. true, берётся из rabbit.
	2. null, берётся из animal.
	3. undefined, такого свойства больше нет.

2. Алгоритм поиска (важность: 5)
Задача состоит из двух частей.
У нас есть объекты:
	let head = {glasses: 1};
	let table = {pen: 3};
	let bed = {sheet: 1, pillow: 2};
	let pockets = {money: 2000};
2.1. С помощью свойства __proto__ задайте прототипы так, чтобы поиск любого свойства выполнялся по следующему пути: pockets → bed → table → head. Например, pockets.pen должно возвращать значение 3 (найденное в table), а bed.glasses – значение 1 (найденное в head).
2.2. Ответьте на вопрос: как быстрее получить значение glasses – через pockets.glasses или через head.glasses? При необходимости составьте цепочки поиска и сравните их. // head.glasses
решение:
	pockets.__proto__ = bed;
	bed.__proto__ = table;
	table.__proto__ = head;
	// проверка:
	console.log(pockets.pen); // 3 (найденное в table)
	console.log(bed.glasses); // 1 (найденное в head)
// учебник:
	2.1. Добавим свойство __proto__:
		let head = {glasses: 1};
		let table = {pen: 3, __proto__: head};
		let bed = {sheet: 1, pillow: 2, __proto__: table};
		let pockets = {money: 2000, __proto__: bed};
		alert( pockets.pen ); // 3
		alert( bed.glasses ); // 1
		alert( table.money ); // undefined
	2.2. С точки зрения производительности, для современных движков неважно, откуда берётся свойство – из объекта или из прототипа. Они запоминают, где было найдено свойство, и повторно используют его в следующем запросе. Например, при обращении к pockets.glasses они запомнят, что нашли glasses в head, и в следующий раз будут искать там же. Они достаточно умны, чтобы при изменениях обновлять внутренний кеш, поэтому такая оптимизация безопасна.

3. Куда будет произведена запись? (важность: 5)
Объект rabbit наследует от объекта animal.
Какой объект получит свойство full при вызове rabbit.eat(): animal или rabbit?
	let animal = {eat() {this.full = true}};
	let rabbit = {__proto__: animal};
	rabbit.eat();
решение:
	console.log(rabbit.full); // ? true
	console.log(animal.full); // ? undefined
Ответ: rabbit.
Поскольку this – это объект, который стоит перед точкой, rabbit.eat() изменяет объект rabbit.
Поиск свойства и исполнение кода – два разных процесса. Сначала осуществляется поиск метода rabbit.eat в прототипе, а затем этот метод выполняется с this=rabbit.

4. Почему наедаются оба хомяка? (важность: 5)
У нас есть два хомяка: шустрый (speedy) и ленивый (lazy); оба наследуют от общего объекта hamster.
Когда мы кормим одного хомяка, второй тоже наедается. Почему? Как это исправить?
	let hamster = {
		stomach: [],
		eat(food) {this.stomach.push(food)}
	};
	let speedy = {__proto__: hamster};
	let lazy = {__proto__: hamster};
	// Этот хомяк нашёл еду
	speedy.eat("apple");
	alert( speedy.stomach ); // apple
	// У этого хомяка тоже есть еда. Почему? Исправьте
	alert( lazy.stomach ); // apple
решение:
	Давайте внимательно посмотрим, что происходит при вызове speedy.eat("apple").
	1. Сначала в прототипе (=hamster) находится метод speedy.eat, а затем он выполняется с this=speedy (объект перед точкой).
	2. Затем в this.stomach.push() нужно найти свойство stomach и вызвать для него push. Движок ищет stomach в this (=speedy), но ничего не находит.
	3. Он идёт по цепочке прототипов и находит stomach в hamster.
	4. И вызывает для него push, добавляя еду в живот прототипа.
	Получается, что у хомяков один живот на двоих!
	И при lazy.stomach.push(...) и при speedy.stomach.push(), свойство stomach берётся из прототипа (так как его нет в самом объекте), затем в него добавляются данные.
	Обратите внимание, что этого не происходит при простом присваивании this.stomach=:
		let hamster = {
			stomach: [],
			eat(food) {
				this.stomach = [food]; // присвоение значения this.stomach вместо вызова this.stomach.push
			}
		};
		let speedy = {__proto__: hamster};
		let lazy = {__proto__: hamster};
		// Шустрый хомяк нашёл еду
		speedy.eat("apple");
		alert( speedy.stomach ); // apple
		// Живот ленивого хомяка пуст
		alert( lazy.stomach ); // <ничего>
	Теперь всё работает правильно, потому что this.stomach= не ищет свойство stomach. Значение записывается непосредственно в объект this.
	Также мы можем полностью избежать проблемы, если у каждого хомяка будет собственный живот:
		let hamster = {
			stomach: [],
			eat(food) {this.stomach.push(food)}
		};
		let speedy = {__proto__: hamster, stomach: []};
		let lazy = {__proto__: hamster, stomach: []};
		// Шустрый хомяк нашёл еду
		speedy.eat("apple");
		alert( speedy.stomach ); // apple
		// Живот ленивого хомяка пуст
		alert( lazy.stomach ); // <ничего>
	(!) Все свойства, описывающие состояние объекта (как свойство stomach в примере выше), рекомендуется записывать в сам этот объект. Это позволяет избежать подобных проблем.

#1.8.2. F.prototype
8.4.25 - https://learn.javascript.ru/function-prototype
F.prototype.
Как мы помним, новые объекты могут быть созданы с помощью функции-конструктора new F().
Если в F.prototype содержится объект, оператор new устанавливает его в качестве [[Prototype]] для нового объекта.

На заметку:
JS использовал прототипное наследование с момента своего появления. Это одна из основных особенностей языка.
Но раньше, в старые времена, прямого доступа к прототипу объекта не было. Надёжно работало только свойство "prototype" функции-конструктора, описанное в этой главе. Поэтому оно [до сих пор] используется во многих скриптах.

Обратите внимание, что F.prototype означает обычное свойство с именем "prototype" для F. Это ещё не прототип объекта, а обычное свойство F с таким именем.
Приведём пример:
	let animal = {eats: true};
	function Rabbit(name){this.name = name};
	Rabbit.prototype = animal;
	let rabbit = new Rabbit("White Rabbit"); //  rabbit.__proto__ == animal
	alert(rabbit.eats); // true
Установка Rabbit.prototype = animal буквально говорит интерпретатору следующее: "При создании объекта через new Rabbit() запиши ему animal в [[Prototype]]".

F.prototype используется только в момент вызова new F.
F.prototype используется только при вызове new F и присваивается в качестве свойства [[Prototype]] нового объекта.
Если после создания свойство F.prototype изменится (F.prototype = <другой объект>), то новые объекты, созданные с помощью new F, будут иметь в качестве [[Prototype]] другой объект, а уже существующие объекты сохранят старый.

F.prototype по умолчанию, свойство constructor.
У каждой функции (за исключением стрелочных) по умолчанию уже есть свойство "prototype".
По умолчанию "prototype" – объект с единственным свойством constructor, которое ссылается на функцию-конструктор.
Вот такой:
	function Rabbit() {}
	/* прототип по умолчанию: Rabbit.prototype = { constructor: Rabbit }; */
Проверим это:
	function Rabbit() {}
	// по умолчанию: Rabbit.prototype = { constructor: Rabbit }
	alert( Rabbit.prototype.constructor == Rabbit ); // true
Соответственно, если мы ничего не меняем, то свойство constructor будет доступно всем кроликам через [[Prototype]]:
	function Rabbit() {}
	// по умолчанию: Rabbit.prototype = { constructor: Rabbit }
	let rabbit = new Rabbit(); // наследует от {constructor: Rabbit}
	alert(rabbit.constructor == Rabbit); // true (свойство получено из прототипа)

Мы можем использовать свойство constructor существующего объекта для создания нового.
Пример:
	function Rabbit(name) {
		this.name = name;
		alert(name);
	}
	let rabbit = new Rabbit("White Rabbit");
	let rabbit2 = new rabbit.constructor("Black Rabbit");
Это удобно, когда у нас есть объект, но мы не знаем, какой конструктор использовался для его создания (например, он мог быть взят из сторонней библиотеки), а нам необходимо создать ещё один такой объект.
Но, пожалуй, самое важное о свойстве "constructor" это то, что…
…JS сам по себе не гарантирует правильное значение свойства "constructor".
Да, оно является свойством по умолчанию в "prototype" у функций, но что случится с ним позже – зависит только от нас.
В частности, если мы заменим прототип по умолчанию на другой объект, то свойства "constructor" в нём не будет.
Например:
	function Rabbit() {}
	Rabbit.prototype = {jumps: true};
	let rabbit = new Rabbit();
	alert(rabbit.constructor === Rabbit); // false
Таким образом, чтобы сохранить верное свойство "constructor", мы должны добавлять/удалять/изменять свойства у прототипа по умолчанию вместо того, чтобы перезаписывать его целиком:
	function Rabbit() {} // Не перезаписываем Rabbit.prototype полностью, а добавляем к нему свойство
	Rabbit.prototype.jumps = true // Прототип по умолчанию сохраняется, и мы всё ещё имеем доступ к Rabbit.prototype.constructor
Или мы можем заново создать свойство constructor:
	Rabbit.prototype = {
		jumps: true,
		constructor: Rabbit
	}; // теперь свойство constructor снова корректное, так как мы добавили его

Итого:
В этой главе мы кратко описали способ задания [[Prototype]] для объектов, создаваемых с помощью функции-конструктора. Позже мы рассмотрим, как можно использовать эту возможность.
Всё достаточно просто. Выделим основные моменты:
- Свойство F.prototype (не путать с [[Prototype]]) устанавливает [[Prototype]] для новых объектов при вызове new F().
- Значение F.prototype должно быть либо объектом, либо null. Другие значения не будут работать.
- Свойство "prototype" является особым, только когда оно назначено функции-конструктору, которая вызывается оператором new.
В обычных объектах prototype не является чем-то особенным:
	let user = {
		name: "John",
		prototype: "Bla-bla" // никакой магии нет - обычное свойство
	};
По умолчанию все функции имеют F.prototype = { constructor: F }, поэтому мы можем получить конструктор объекта через свойство "constructor".

Задачи: 1+- 2-
1. Изменяем "prototype" (важность: 5)
В коде ниже мы создаём нового кролика new Rabbit, а потом пытаемся изменить его прототип.
Сначала у нас есть такой код:
	function Rabbit() {}
	Rabbit.prototype = {eats: true};
	let rabbit = new Rabbit();
	alert( rabbit.eats ); // true
(1) Добавим одну строчку (выделенную * в коде ниже). Что вызов alert покажет нам сейчас?
	function Rabbit() {}
	Rabbit.prototype = {eats: true};
	let rabbit = new Rabbit();
	Rabbit.prototype = {}; // *	
	alert(rabbit.eats); // ? undefined
(2) …А если код такой (заменили одну строчку *)?
	function Rabbit() {}
	Rabbit.prototype = {eats: true};
	let rabbit = new Rabbit();
	Rabbit.prototype.eats = false; // *
	alert( rabbit.eats ); // ? false
(3) Или такой (заменили одну строчку)?
	function Rabbit() {}
	Rabbit.prototype = {eats: true};
	let rabbit = new Rabbit();
	delete rabbit.eats; // *
	alert( rabbit.eats ); // ? undefined
(4) Или, наконец, такой:
	function Rabbit() {}
	Rabbit.prototype = {eats: true};
	let rabbit = new Rabbit();
	delete Rabbit.prototype.eats; // *
	alert( rabbit.eats ); // ? undefined
решение:
Ответы:
	(1) true.
	Присвоение нового значения свойству Rabbit.prototype влияет на [[Prototype]] вновь создаваемых объектов, но не на прототип уже существующих.
	(2) false.
	Объекты присваиваются по ссылке. Не создаётся копия Rabbit.prototype, это всегда один объект, на который ссылается и Rabbit.prototype, и [[Prototype]] объекта rabbit.
	Таким образом, когда мы изменяем этот объект по одной ссылке, изменения видны и по другой.
	(3) true.
	Операция delete применяется к свойствам конкретного объекта, на котором она вызвана. Здесь delete rabbit.eats пытается удалить свойство eats из объекта rabbit, но его там нет. Таким образом, просто ничего не произойдёт.
	(4) undefined.
	Свойство eats удалено из прототипа, оно больше не существует.

2. Создайте новый объект с помощью уже существующего (важность: 5)
Представьте, что у нас имеется некий объект obj, созданный функцией-конструктором – мы не знаем какой именно, но хотелось бы создать ещё один объект такого же типа.
Можем ли мы сделать так?
	let obj2 = new obj.constructor();
Приведите пример функции-конструктора для объекта obj, с которой такой вызов корректно сработает. И пример функции-конструктора, с которой такой код поведёт себя неправильно.
решение:
	Мы можем использовать такой способ, если мы уверены в том, что свойство "constructor" существующего объекта имеет корректное значение.
	Например, если мы не меняли "prototype", используемый по умолчанию, то код ниже, без сомнений, сработает:
		function User(name) {this.name = name};
		let user = new User('John');
		let user2 = new user.constructor('Pete');
		alert( user2.name ); // Pete (сработало!)
	Всё получилось, потому что User.prototype.constructor == User.
	…Но если кто-то перезапишет User.prototype и забудет заново назначить свойство "constructor", чтобы оно указывало на User, то ничего не выйдет.
	Например:
		function User(name) {this.name = name};
		User.prototype = {}; // (*)
		let user = new User('John');
		let user2 = new user.constructor('Pete');
		alert( user2.name ); // undefined
	Почему user2.name приняло значение undefined?
	Рассмотрим, как отработал вызов new user.constructor('Pete'):
		1. Сначала ищется свойство constructor в объекте user. Не нашлось.
		2. Потом задействуется поиск по цепочке прототипов. Прототип объекта user – это User.prototype, и там тоже нет искомого свойства.
		3. Идя дальше по цепочке, значение User.prototype – это пустой объект {}, чей прототип – встроенный Object.prototype.
		4. Наконец, для встроенного Object.prototype предусмотрен встроенный Object.prototype.constructor == Object. Таким образом, свойство constructor всё-таки найдено.
	В итоге срабатывает let user2 = new Object('Pete').
	Вероятно, это не то, что нам нужно. Мы хотели создать new User, а не new Object. Это и есть результат отсутствия конструктора. (На всякий случай, если вам интересно, вызов new Object(...) преобразует свой аргумент в объект. Это теоретическая вещь, на практике никто не вызывает new Object со значением, тем более, в основном мы вообще не используем new Object для создания объектов).

#1.8.3. Встроенные прототипы
9.4.25 - https://learn.javascript.ru/native-prototypes
Свойство "prototype" широко используется внутри самого языка JS. Все встроенные функции-конструкторы используют его.
Сначала мы рассмотрим детали, а затем используем "prototype" для добавления встроенным объектам новой функциональности.

Object.prototype
Давайте выведем пустой объект:
	let obj = {};
	alert( obj ); // "[object Object]" ?
Где код, который генерирует строку "[object Object]"? Это встроенный метод toString, но где он? obj ведь пуст!
…Но краткая нотация obj = {} – это то же самое, что и obj = new Object(), где Object – встроенная функция-конструктор для объектов с собственным свойством prototype, которое ссылается на огромный объект с методом toString и другими.
Когда вызывается new Object() (или создаётся объект с помощью литерала {...}), свойство [[Prototype]] этого объекта устанавливается на Object.prototype по правилам, которые мы обсуждали в предыдущей главе.
Таким образом, когда вызывается obj.toString(), метод берётся из Object.prototype.
Мы можем проверить это так:
	let obj = {};
	alert(obj.__proto__ === Object.prototype); // true
	// obj.toString === obj.__proto__.toString === Object.prototype.toString
Обратите внимание, что по цепочке прототипов выше Object.prototype больше нет свойства [[Prototype]]:
	alert(Object.prototype.__proto__); // null

Другие встроенные прототипы.
Другие встроенные объекты, такие как Array, Date, Function и другие, также хранят свои методы в прототипах.
Например, при создании массива [1, 2, 3] внутренне используется конструктор массива Array. Поэтому прототипом массива становится Array.prototype, предоставляя ему свои методы. Это позволяет эффективно использовать память.
Согласно спецификации, наверху иерархии встроенных прототипов находится Object.prototype. Поэтому иногда говорят, что "всё наследует от объектов".
Давайте проверим прототипы:
	let arr = [1, 2, 3];
	// наследует ли от Array.prototype?
	alert( arr.__proto__ === Array.prototype ); // true
	// затем наследует ли от Object.prototype?
	alert( arr.__proto__.__proto__ === Object.prototype ); // true
	// и null на вершине иерархии
	alert( arr.__proto__.__proto__.__proto__ ); // null
Некоторые методы в прототипах могут пересекаться, например, у Array.prototype есть свой метод toString, который выводит элементы массива через запятую:
	let arr = [1, 2, 3]
	alert(arr); // 1,2,3 <-- результат Array.prototype.toString
Как мы видели ранее, у Object.prototype есть свой метод toString, но так как Array.prototype ближе в цепочке прототипов, то берётся именно вариант для массивов. В браузерных инструментах, таких как консоль разработчика, можно посмотреть цепочку наследования (возможно, потребуется использовать console.dir для встроенных объектов).
Другие встроенные объекты устроены аналогично. Даже функции – они объекты встроенного конструктора Function, и все их методы (call/apply и другие) берутся из Function.prototype. Также у функций есть свой метод toString.
	function f() {}
	alert(f.__proto__ == Function.prototype); // true
	alert(f.__proto__.__proto__ == Object.prototype); // true, наследует от Object

Примитивы.
Самое сложное происходит со строками, числами и булевыми значениями.
Как мы помним, они не объекты. Но если мы попытаемся получить доступ к их свойствам, то тогда будет создан временный объект-обёртка с использованием встроенных конструкторов String, Number и Boolean, который предоставит методы и после этого исчезнет.
Эти объекты создаются невидимо для нас, и большая часть движков оптимизирует этот процесс, но спецификация описывает это именно таким образом. Методы этих объектов также находятся в прототипах, доступных как String.prototype, Number.prototype и Boolean.prototype.

Значения null и undefined не имеют объектов-обёрток.
Специальные значения null и undefined стоят особняком. У них нет объектов-обёрток, так что методы и свойства им недоступны. Также у них нет соответствующих прототипов.

Изменение встроенных прототипов.
Встроенные прототипы можно изменять. Например, если добавить метод к String.prototype, метод становится доступен для всех строк:
	String.prototype.show = function() {alert(this)};
	"BOOM!".show(); // BOOM!
В течение процесса разработки у нас могут возникнуть идеи о новых встроенных методах, которые нам хотелось бы иметь, и искушение добавить их во встроенные прототипы. Это плохая идея.

Важно: Прототипы глобальны, поэтому очень легко могут возникнуть конфликты. Если две библиотеки добавляют метод String.prototype.show, то одна из них перепишет метод другой. Так что, в общем, изменение встроенных прототипов считается плохой идеей.

В современном программировании есть только один случай, в котором одобряется изменение встроенных прототипов. Это создание полифилов.
Полифил – это термин, который означает эмуляцию метода, который существует в спецификации JS, но ещё не поддерживается текущим движком JS.
Тогда мы можем реализовать его сами и добавить во встроенный прототип.
Например:
	if (!String.prototype.repeat) { // Если такого метода нет, добавляем его в прототип
		String.prototype.repeat = function(n) {
			return new Array(n + 1).join(this); // повторить строку n раз
			// на самом деле код должен быть немного более сложным (полный алгоритм можно найти в спецификации)
			// но даже неполный полифил зачастую достаточно хорош для использования
		};
	}
	alert( "La".repeat(3) ); // LaLaLa

Заимствование у прототипов.
В главе Декораторы и переадресация вызова, call/apply мы говорили о заимствовании методов. Это когда мы берём метод из одного объекта и копируем его в другой. Некоторые методы встроенных прототипов часто одалживают.
Например, если мы создаём объект, похожий на массив (псевдомассив), мы можем скопировать некоторые методы из Array в этот объект.
Пример:
	let obj = {0: "Hello", 1: "world!", length: 2};
	obj.join = Array.prototype.join;
	alert( obj.join(',') ); // Hello,world!
Это работает, потому что для внутреннего алгоритма встроенного метода join важны только корректность индексов и свойство length, он не проверяет, является ли объект на самом деле массивом. И многие встроенные методы работают так же.
Альтернативная возможность – мы можем унаследовать от массива, установив obj.__proto__ как Array.prototype, таким образом все методы Array станут автоматически доступны в obj.
Но это будет невозможно, если obj уже наследует от другого объекта. Помните, мы можем наследовать только от одного объекта одновременно.
Заимствование методов – гибкий способ, позволяющий смешивать функциональность разных объектов по необходимости.

Итого:
- Все встроенные объекты следуют одному шаблону:
	- Методы хранятся в прототипах (Array.prototype, Object.prototype, Date.prototype и т.д.).
	- Сами объекты хранят только данные (элементы массивов, свойства объектов, даты).
- Примитивы также хранят свои методы в прототипах объектов-обёрток: Number.prototype, String.prototype, Boolean.prototype. Только у значений undefined и null нет объектов-обёрток.
- Встроенные прототипы могут быть изменены или дополнены новыми методами. Но не рекомендуется менять их. Единственная допустимая причина – это добавление нового метода из стандарта, который ещё не поддерживается движком JavaScript.

Задачи: 1- 2-
1. Добавить функциям метод "f.defer(ms)" (важность: 5)
Добавьте всем функциям в прототип метод defer(ms), который вызывает функции через ms миллисекунд.
После этого должен работать такой код:
	function f() {alert("Hello!")};
	f.defer(1000); // выведет "Hello!" через 1 секунду
решение:
	Function.prototype.defer = function(ms){setTimeout(this, ms)}
	function f() {console.log("Hello!")};
	f.defer(1000); // выведет "Hello!" через 1 секунду
2. Добавьте функциям декорирующий метод "defer()" (важность: 4)
Добавьте всем функциям в прототип метод defer(ms), который возвращает обёртку, откладывающую вызов функции на ms миллисекунд.
Например, должно работать так:
	function f(a, b) {alert( a + b )};
	f.defer(1000)(1, 2); // выведет 3 через 1 секунду.
Пожалуйста, заметьте, что аргументы должны корректно передаваться оригинальной функции.
решение:
	Function.prototype.defer = function(ms){
		return (...args) => {
			return setTimeout(this, ms, ...args);
		}
	}
// или
	Function.prototype.defer = function(ms){
		return (...args) => {
			setTimeout(() => {this(...args)}, ms);
		};
	};
	// проверка
	function f(a, b) {console.log(a + b)};
	f.defer(1000)(1, 2); // выведет 3 через 1 секунду.
// учебник
	Function.prototype.defer = function(ms){
		let f = this;
		return function(...args){
			setTimeout(() => f.apply(this, args), ms);
		}
	};
	// проверка
	function f(a, b) {alert( a + b )};
	f.defer(1000)(1, 2); // выведет 3 через 1 секунду.

#1.8.4. Методы прототипов, объекты без свойства __proto__
10.4.25 - https://learn.javascript.ru/prototype-methods
В первой главе этого раздела мы упоминали, что существуют современные методы работы с прототипами.
Свойство __proto__ считается устаревшим, и по стандарту оно должно поддерживаться только браузерами.
Современные же методы это:
	Object.create(proto[, descriptors]) – создаёт пустой объект со свойством [[Prototype]], указанным как proto, и необязательными дескрипторами свойств descriptors.
	Object.getPrototypeOf(obj) – возвращает свойство [[Prototype]] объекта obj.
	Object.setPrototypeOf(obj, proto) – устанавливает свойство [[Prototype]] объекта obj как proto.
Эти методы нужно использовать вместо __proto__.
Например:
	let animal = {eats: true};
	let rabbit = Object.create(animal); // создаём новый объект с прототипом animal
	alert(rabbit.eats); // true
	alert(Object.getPrototypeOf(rabbit) === animal); // получаем прототип объекта rabbit
	Object.setPrototypeOf(rabbit, {}); // заменяем прототип объекта rabbit на {}
У Object.create есть необязательный второй аргумент: дескрипторы свойств. Мы можем добавить дополнительное свойство новому объекту таким образом:
	let animal = {eats: true};
	let rabbit = Object.create(animal, {
		jumps: {value: true}
	});
	alert(rabbit.jumps); // true
Формат задания дескрипторов описан в главе Флаги и дескрипторы свойств.
Мы также можем использовать Object.create для «продвинутого» клонирования объекта, более мощного, чем копирование свойств в цикле for..in:
	// клон obj c тем же прототипом (с поверхностным копированием свойств)
	let clone = Object.create(Object.getPrototypeOf(obj), Object.getOwnPropertyDescriptors(obj));
Такой вызов создаёт точную копию объекта obj, включая все свойства: перечисляемые и неперечисляемые, геттеры/сеттеры для свойств – и всё это с правильным свойством [[Prototype]].

Краткая история.
Если пересчитать все способы управления прототипом, то их будет много! И многие из них делают одно и то же!
Почему так?
В силу исторических причин.
	- Свойство "prototype" функции-конструктора существует с совсем давних времён.
	- Позднее, в 2012 году, в стандарте появился метод Object.create. Это давало возможность создавать объекты с указанным прототипом, но не позволяло устанавливать/получать его. Тогда браузеры реализовали нестандартный аксессор __proto__, который позволил устанавливать/получать прототип в любое время.
	- Позднее, в 2015 году, в стандарт были добавлены Object.setPrototypeOf и Object.getPrototypeOf, заменяющие собой аксессор __proto__, который упоминается в Приложении Б стандарта, которое не обязательно к поддержке в небраузерных окружениях. При этом де-факто __proto__ всё ещё поддерживается везде.
В итоге сейчас у нас есть все эти способы для работы с прототипом.
Почему же __proto__ был заменён на функции getPrototypeOf/setPrototypeOf? Читайте далее, чтобы узнать ответ.

Не меняйте [[Prototype]] существующих объектов, если важна скорость.
Технически мы можем установить/получить [[Prototype]] в любое время. Но обычно мы устанавливаем прототип только раз во время создания объекта, а после не меняем: rabbit наследует от animal, и это не изменится.
И JS движки хорошо оптимизированы для этого. Изменение прототипа "на лету" с помощью Object.setPrototypeOf или obj.__proto__= – очень медленная операция, которая ломает внутренние оптимизации для операций доступа к свойствам объекта. Так что лучше избегайте этого кроме тех случаев, когда вы знаете, что делаете, или же когда скорость JS для вас не имеет никакого значения.

"Простейший" объект.
Как мы знаем, объекты можно использовать как ассоциативные массивы для хранения пар ключ/значение.
…Но если мы попробуем хранить созданные пользователями ключи (например, словари с пользовательским вводом), мы можем заметить интересный сбой: все ключи работают как ожидается, за исключением "__proto__".
Посмотрите на пример:
	let obj = {};
	let key = prompt("What's the key?", "__proto__");
	obj[key] = "some value";
	alert(obj[key]); // [object Object], не "some value"!
Если пользователь введёт __proto__, присвоение проигнорируется!
И это не должно удивлять нас. Свойство __proto__ особенное: оно должно быть либо объектом, либо null, а строка не может стать прототипом.
Но мы не намеревались реализовывать такое поведение, не так ли? Мы хотим хранить пары ключ/значение, и ключ с именем "__proto__" не был сохранён надлежащим образом. Так что это ошибка!
Конкретно в этом примере последствия не так ужасны, но если мы присваиваем объектные значения, то прототип и в самом деле может быть изменён. В результате дальнейшее выполнение пойдёт совершенно непредсказуемым образом.
Что хуже всего – разработчики не задумываются о такой возможности совсем. Это делает такие ошибки сложным для отлавливания или даже превращает их в уязвимости, особенно когда JS используется на сервере.
Неожиданные вещи могут случаться также при присвоении свойства toString, которое по умолчанию функция, и других свойств, которые тоже на самом деле являются встроенными методами.
Как же избежать проблемы?
Во-первых, мы можем переключиться на использование коллекции Map, и тогда всё будет в порядке.
Но и Object может также хорошо подойти, потому что создатели языка уже давно продумали решение проблемы.
Свойство __proto__ – не обычное, а аксессор, заданный в Object.prototype. Так что при чтении или установке obj.__proto__ вызывается соответствующий геттер/сеттер из прототипа obj, и именно он устанавливает/получает свойство [[Prototype]].
Как было сказано в начале этой секции учебника, __proto__ – это способ доступа к свойству [[Prototype]], это не само свойство [[Prototype]].
Теперь, если мы хотим использовать объект как ассоциативный массив, мы можем сделать это с помощью небольшого трюка:
	let obj = Object.create(null);
	let key = prompt("What's the key?", "__proto__");
	obj[key] = "some value";
	alert(obj[key]); // "some value"
Object.create(null) создаёт пустой объект без прототипа ([[Prototype]] будет null). Таким образом не будет унаследованного геттера/сеттера для __proto__. Теперь это свойство обрабатывается как обычное свойство, и приведённый выше пример работает правильно.
Мы можем назвать такой объект "простейшим" или "чистым словарным объектом", потому что он ещё проще, чем обычные объекты {...}.
Недостаток в том, что у таких объектов не будет встроенных методов объекта, таких как toString:
	let obj = Object.create(null);
	alert(obj); // Ошибка (no toString)
…Но обычно это нормально для ассоциативных массивов.
Обратите внимание, что большинство методов, связанных с объектами, имеют вид Object.something(...). К примеру, Object.keys(obj). Подобные методы не находятся в прототипе, так что они продолжат работать для таких объектов:
	let chineseDictionary = Object.create(null);
	chineseDictionary.hello = "你好";
	chineseDictionary.bye = "再见";
	alert(Object.keys(chineseDictionary)); // hello,bye

Итого:
Современные способы установки и прямого доступа к прототипу это:
	Object.create(proto[, descriptors]) – создаёт пустой объект со свойством [[Prototype]], указанным как proto (может быть null), и необязательными дескрипторами свойств.
	Object.getPrototypeOf(obj) – возвращает свойство [[Prototype]] объекта obj (то же самое, что и геттер __proto__).
	Object.setPrototypeOf(obj, proto) – устанавливает свойство [[Prototype]] объекта obj как proto (то же самое, что и сеттер __proto__).
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object/create']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object.getPrototypeOf']
['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Object.setPrototypeOf']
Встроенный геттер/сеттер __proto__ не безопасен, если мы хотим использовать созданные пользователями ключи в объекте. Как минимум потому, что пользователь может ввести "__proto__" как ключ, от чего может возникнуть ошибка. Если повезёт – последствия будут лёгкими, но, вообще говоря, они непредсказуемы.
Так что мы можем использовать либо Object.create(null) для создания простейшего объекта, либо использовать коллекцию Map.
Кроме этого, Object.create даёт нам лёгкий способ создать поверхностную копию объекта со всеми дескрипторами:
	let clone = Object.create(Object.getPrototypeOf(obj), Object.getOwnPropertyDescriptors(obj));
Мы также ясно увидели, что __proto__ – это геттер/сеттер для свойства [[Prototype]], и находится он в Object.prototype, как и другие методы.
Мы можем создавать объекты без прототипов с помощью Object.create(null). Такие объекты можно использовать как чистые словари, у них нет проблем с использованием строки "__proto__" в качестве ключа.
Ещё методы:
	Object.keys(obj) / Object.values(obj) / Object.entries(obj) – возвращают массив всех перечисляемых собственных строковых ключей/значений/пар ключ-значение.
	Object.getOwnPropertySymbols(obj) – возвращает массив всех собственных символьных ключей.
	Object.getOwnPropertyNames(obj) – возвращает массив всех собственных строковых ключей.
	Reflect.ownKeys(obj) – возвращает массив всех собственных ключей.
	obj.hasOwnProperty(key): возвращает true, если у obj есть собственное (не унаследованное) свойство с именем key.
Все методы, которые возвращают свойства объектов (такие как Object.keys и другие), возвращают собственные свойства. Если мы хотим получить и унаследованные, можно воспользоваться циклом for..in.

Задачи: 1- 2-
1. Добавьте toString в словарь (важность: 5)
Имеется объект dictionary, созданный с помощью Object.create(null) для хранения любых пар ключ/значение.
Добавьте ему метод dictionary.toString(), который должен возвращать список ключей, разделённых запятой. Ваш toString не должен выводиться при итерации объекта с помощью цикла for..in.
Вот так это должно работать:
	let dictionary = Object.create(null);
	// ваш код, который добавляет метод dictionary.toString
	// добавляем немного данных
	dictionary.apple = "Apple";
	dictionary.__proto__ = "test"; // здесь __proto__ -- это обычный ключ
	// только apple и __proto__ выведены в цикле
	for (let key in dictionary) {alert(key)}; // "apple", затем "__proto__"
	// ваш метод toString в действии
	alert(dictionary); // "apple,__proto__"
решение:
	В методе можно получить все перечисляемые ключи с помощью Object.keys и вывести их список.
	Чтобы сделать toString неперечисляемым, давайте определим его, используя дескриптор свойства. Синтаксис Object.create позволяет нам добавить в объект дескрипторы свойств как второй аргумент.
		let dictionary = Object.create(null, {
			toString: { // определяем свойство toString
				value() { // значение -- это функция
					return Object.keys(this).join();
				}
			}
		});
		dictionary.apple = "Apple";
		dictionary.__proto__ = "test";
		// apple и __proto__ выведены в цикле
		for(let key in dictionary) {
			alert(key); // "apple", затем "__proto__"
		}
		// список свойств, разделённых запятой, выведен с помощью toString
		alert(dictionary); // "apple,__proto__"
	Когда мы создаём свойство с помощью дескриптора, все флаги по умолчанию имеют значение false. Таким образом, в коде выше dictionary.toString – неперечисляемое свойство.
	Смотрите главу Флаги и дескрипторы свойств ['https://learn.javascript.ru/property-descriptors'] для ознакомления.

2. Разница между вызовами (важность: 5)
Давайте создадим новый объект rabbit:
	function Rabbit(name) {this.name = name}
	Rabbit.prototype.sayHi = function() {alert(this.name)};
	let rabbit = new Rabbit("Rabbit");
Все эти вызовы делают одно и тоже или нет?
	rabbit.sayHi();
	Rabbit.prototype.sayHi();
	Object.getPrototypeOf(rabbit).sayHi();
	rabbit.__proto__.sayHi();
решение:
	В первом вызове this == rabbit, во всех остальных this равен Rabbit.prototype, так как это объект перед точкой.
	Так что только первый вызов выведет Rabbit, а остальные – undefined:
		function Rabbit(name) {this.name = name};
		Rabbit.prototype.sayHi = function() {console.log(this.name)};
		let rabbit = new Rabbit("Rabbit");
		rabbit.sayHi();                        // Rabbit
		Rabbit.prototype.sayHi();              // undefined
		Object.getPrototypeOf(rabbit).sayHi(); // undefined
		rabbit.__proto__.sayHi();              // undefined

#1.9. Классы - https://learn.javascript.ru/classes
#1.9.1. Класс: базовый синтаксис
21.12.24 / 12.4.25 Класс: базовый синтаксис - https://learn.javascript.ru/class
В объектно-ориентированном программировании класс – это расширяемый шаблон кода для создания объектов, который устанавливает в них начальные значения (свойства) и реализацию поведения (методы). [wiki]

Синтаксис class.
	class ClassName {
		constructor() {...}
		method1() {...} // метод класса
		method2() {...}
		method3() {...}
		...
	}
Затем используйте вызов new ClassName() для создания нового объекта со всеми перечисленными методами. При этом автоматически вызывается метод constructor(), в нём можно инициализировать объект.
Внутри классов запятые между методами не требуются.
/**Методы в классе не разделяются запятой.
Частая ошибка начинающих разработчиков – ставить запятую между методами класса, что приводит к синтаксической ошибке.
Синтаксис классов отличается от литералов объектов, не путайте их. Внутри классов запятые не требуются.*/
	class User {
		constructor(name) {this.name = name} // конструктор класса
		method1() {console.log(this.name)} // метод класса
	}
	console.log(typeof User); // function // класс - это функция
	console.log(User === User.prototype.constructor); // true // точнее, класс - это метод constructor()
	console.log(User.prototype.method1); // method1() {console.log(this.name)} // Методы находятся в User.prototype
	console.log(Object.getOwnPropertyNames(User.prototype)); // constructor, method1 // в прототипе 2 метода
	// Использование:
	let user = new User("Иван");
	user.method1(); // Иван
Когда вызывается new User("Иван"):
	- Создаётся новый объект.
	- constructor запускается с заданным аргументом и сохраняет его в this.name.
…Затем можно вызывать на объекте методы, такие как user.method1().

Иногда говорят, что class – это просто "синтаксический сахар" в JS (синтаксис для улучшения читаемости кода, но не делающий ничего принципиально нового), потому что мы можем сделать всё то же самое без конструкции class.
Но это не совсем так, есть важные отличия:
	- Функция, созданная с помощью class, помечена специальным внутренним свойством [[IsClassConstructor]]: true. Поэтому это не то же самое, что создавать её вручную. В отличие от обычных функций, конструктор класса не может быть вызван без new.
	- Строковое представление конструктора класса в большинстве движков JS начинается с "class …":
		console.log(User); // class User { ... }
	- Методы класса являются неперечислимыми. Определение класса устанавливает флаг enumerable в false для всех методов в "prototype". И это хорошо, т.к. если мы проходимся циклом for..in по объекту, то обычно мы не хотим при этом получать методы класса.
	- Классы всегда используют use strict. Весь код внутри класса автоматически находится в строгом режиме.

Свойство класса не устанавливается в User.prototype. Вместо этого оно создаётся оператором new перед запуском конструктора, это именно свойство объекта.

Что такое класс?
Итак, что же такое class? Это не полностью новая языковая сущность, как может показаться на первый взгляд. Давайте развеем всю магию и посмотрим, что такое класс на самом деле. Это поможет в понимании многих сложных аспектов.
В JS класс – это разновидность функции.
Взгляните:
	class User {
		constructor(name) { this.name = name; }
		sayHi() { alert(this.name); }
	}
	// доказательство: User - это функция:
	alert(typeof User); // function
Вот что на самом деле делает конструкция class User {...}:
	- Создаёт функцию с именем User, которая становится результатом объявления класса. Код функции берётся из метода constructor (она будет пустой, если такого метода нет).
	- Сохраняет все методы, такие как sayHi, в User.prototype.
При вызове метода объекта new User он будет взят из прототипа, как описано в главе F.prototype. Таким образом, объекты new User имеют доступ к методам класса.
Можно проверить вышесказанное и при помощи кода:
	class User {
		constructor(name) { this.name = name; }
		sayHi() { alert(this.name); }
	}
	// класс - это функция
	alert(typeof User); // function
	// ...или, если точнее, это метод constructor
	alert(User === User.prototype.constructor); // true
	// Методы находятся в User.prototype, например:
	alert(User.prototype.sayHi); // sayHi() { alert(this.name); }
	// в прототипе ровно 2 метода
	alert(Object.getOwnPropertyNames(User.prototype)); // constructor, sayHi

Не просто синтаксический сахар.
Иногда говорят, что class – это просто "синтаксический сахар" в JS (синтаксис для улучшения читаемости кода, но не делающий ничего принципиально нового), потому что мы можем сделать всё то же самое без конструкции class:
	// перепишем класс User на чистых функциях
	// 1. Создаём функцию constructor
	function User(name){this.name = name};
	// каждый прототип функции имеет свойство constructor по умолчанию, поэтому нам нет необходимости его создавать
	// 2. Добавляем метод в прототип
	User.prototype.sayHi = function(){alert(this.name)};
	// Использование:
	let user = new User("Иван");
	user.sayHi();
Результат этого кода очень похож. Поэтому, действительно, есть причины, по которым class можно считать синтаксическим сахаром для определения конструктора вместе с методами прототипа.
Однако есть важные отличия:
(1) Во-первых, функция, созданная с помощью class, помечена специальным внутренним свойством [[IsClassConstructor]]: true. Поэтому это не совсем то же самое, что создавать её вручную.
	В отличие от обычных функций, конструктор класса не может быть вызван без new:
		class User {constructor(){}}
		alert(typeof User); // function
		User(); // Error: Class constructor User cannot be invoked without 'new'
	Кроме того, строковое представление конструктора класса в большинстве движков JS начинается с class …
		class User {constructor(){}}
		alert(User); // class User { ... }
(2) Методы класса являются неперечислимыми. Определение класса устанавливает флаг enumerable в false для всех методов в "prototype".
	И это хорошо, так как если мы проходимся циклом for..in по объекту, то обычно мы не хотим при этом получать методы класса.
(3) Классы всегда используют use strict. Весь код внутри класса автоматически находится в строгом режиме.
Также в дополнение к основной, описанной выше, функциональности, синтаксис class даёт ряд других интересных возможностей, с которыми мы познакомимся чуть позже.

Class Expression.
Как и функции, классы можно определять внутри другого выражения, передавать, возвращать, присваивать и т.д.
Пример Class Expression (по аналогии с Function Expression):
	let User = class {
		sayHi() {alert("Привет")}
	};
Аналогично Named Function Expression, Class Expression может иметь имя.
Если у Class Expression есть имя, то оно видно только внутри класса:
	// "Named Class Expression" (в спецификации нет такого термина, но происходящее похоже на Named Function Expression)
	let User = class MyClass {
		sayHi() {alert(MyClass)} // имя MyClass видно только внутри класса
	};
	new User().sayHi(); // работает, выводит определение MyClass
	alert(MyClass); // ошибка, имя MyClass не видно за пределами класса
Мы даже можем динамически создавать классы "по запросу":
	function makeClass(phrase) { // объявляем класс и возвращаем его
		return class {
			sayHi() {alert(phrase)};
		};
	}
	let User = makeClass("Привет"); // Создаём новый класс
	new User().sayHi(); // Привет

Геттеры/сеттеры, другие сокращения.
Как и в литеральных объектах, в классах можно объявлять вычисляемые свойства, геттеры/сеттеры и т.д.
Вот пример user.name, реализованного с использованием get/set:
	class User {
		constructor(name) {
			this.name = name; // вызывает сеттер
		}
		get name() {
			return this._name;
		}
		set name(value) {
			if (value.length < 4) {
				alert("Имя слишком короткое.");
				return;
			}
			this._name = value;
		}
	}
	let user = new User("Иван");
	alert(user.name); // Иван
	user = new User(""); // Имя слишком короткое.
При объявлении класса геттеры/сеттеры создаются на User.prototype, вот так:
	Object.defineProperties(User.prototype, {
		name: {
			get() {return this._name},
			set(name) {/*...*/}
		}
	});
Пример с вычисляемым свойством в скобках [...]:
	class User {
		['say' + 'Hi']() {alert("Привет")}
	}
	new User().sayHi();

Свойства классов.
/**Старым браузерам может понадобиться полифил. Свойства классов добавлены в язык недавно.*/
В приведённом выше примере у класса User были только методы. Давайте добавим свойство:
	class User {
		name = "Аноним";
		sayHi() {
			alert(`Привет, ${this.name}!`);
		}
	}
	new User().sayHi();
Свойство name не устанавливается в User.prototype. Вместо этого оно создаётся оператором new перед запуском конструктора, это именно свойство объекта.

Итого:
Базовый синтаксис для классов выглядит так:
	class MyClass {
		prop = value; // свойство
		constructor(...) { // конструктор
			/* ... */
		}
		method(...) {} // метод
		get something(...) {} // геттер
		set something(...) {} // сеттер
		[Symbol.iterator]() {} // метод с вычисляемым именем (здесь - символом)
		// ...
	}
MyClass технически является функцией (той, которую мы определяем как constructor), в то время как методы, геттеры и сеттеры записываются в MyClass.prototype.
В следующих главах мы узнаем больше о классах, включая наследование и другие возможности.

Задачи: 1+-
1. Перепишите класс (важность: 5)
Класс Clock написан в функциональном стиле. Перепишите его, используя современный синтаксис классов.
P.S. Часики тикают в консоли. Откройте её, чтобы посмотреть.
	function Clock({ template }) {
		let timer;
		function render() {
			let date = new Date();
			let hours = date.getHours();
			if (hours < 10) hours = '0' + hours;
			let mins = date.getMinutes();
			if (mins < 10) mins = '0' + mins;
			let secs = date.getSeconds();
			if (secs < 10) secs = '0' + secs;
			let output = template
				.replace('h', hours)
				.replace('m', mins)
				.replace('s', secs);
			console.log(output);
		}
		this.stop = function() {
			clearInterval(timer);
		};
		this.start = function() {
			render();
			timer = setInterval(render, 1000);
		};
	}
	let clock = new Clock({template: 'h:m:s'});
	clock.start();
решение:
class Clock1 {
    constructor({ template }) {
        this.template = template;
    }
    render() {
        let date = new Date();
        let hours = date.getHours();
        if (hours < 10) hours = '0' + hours;
        let mins = date.getMinutes();
        if (mins < 10) mins = '0' + mins;
        let secs = date.getSeconds();
        if (secs < 10) secs = '0' + secs;
        let output = this.template
            .replace('h', hours)
            .replace('m', mins)
            .replace('s', secs);
        console.log(output);
    }
    stop() {clearInterval(this.timer)}
    start() {
        this.render();
        this.timer = setInterval(() => this.render(), 1000);
    }
}
let clock1 = new Clock1({template: 'h:m:s'});
clock1.start();

#1.9.2. Наследование классов
21.12.24 / 14.4.25 Наследование классов - https://learn.javascript.ru/class-inheritance
Наследование классов – это способ расширения одного класса другим классом; т.о. мы можем добавить новый функционал к уже существующему.
	class Child extends Parent {};
Внутри класса ключевое слово extends работает по механике прототипов. Оно устанавливает Child.prototype.[[Prototype]] в Parent.prototype. 
Если метода не оказалось в Child.prototype, JS берет его из Parent.prototype.

JS использует наследование на прототипах для встроенных объектов. Например, Date.prototype.[[Prototype]] является Object.prototype, поэтому у дат есть универсальные методы объекта.

После extends разрешены любые выражения; синтаксис создания класса допускает указывать после extends не только класс, но и любое выражение.
	class User extends func("Привет") {}
Это может быть полезно для продвинутых приёмов проектирования, где мы можем использовать функции для генерации классов в зависимости от многих условий и затем наследовать их.

Если мы не хотим полностью заменить родительский метод, а скорее хотим сделать новый на его основе, изменяя или расширяя его функциональность, то для таких случаев есть ключевое слово super:
	super.method([args]) // вызывает родительский метод.
	constructor(args) {super(args)} // для вызова родительского конструктора (работает только внутри нашего конструктора).
Если наследуемый класс не имеет собственного конструктора, то автоматически создаётся пустой конструктор:
	class Child extends Parent {
		constructor(...args) {super(...args)} // он просто вызывает конструктор родительского класса
	}

Конструкторы в наследуемых классах должны обязательно вызывать super(...), и (!) делать это перед использованием this.
В JS существует различие между функцией-конструктором наследующего класса и всеми остальными. В наследующем классе соответствующая функция-конструктор помечена специальным внутренним свойством [[ConstructorKind]]:"derived". Разница в следующем: Когда выполняется обычный конструктор, он создаёт пустой объект и присваивает его this. Когда запускается конструктор унаследованного класса, он этого не делает. Вместо этого он ждёт, что это сделает конструктор родительского класса. Поэтому, если мы создаём собственный конструктор, мы должны вызвать super, в противном случае объект для this не будет создан, и мы получим ошибку.

Стрелочные функции не имеют super: при обращении к super стрелочной функции он берётся из внешней функции.
У стрелочных функций нет своего this и super, поэтому они прозрачно встраиваются во внешний контекст.

Для решения проблемы ошибок при наследовании в JS было добавлено специальное внутреннее свойство для функций: [[HomeObject]].
Когда функция объявлена как метод внутри класса или объекта, её свойство [[HomeObject]] становится равно этому объекту. Затем super использует его, чтобы получить прототип родителя и его методы.
Функции в JS свободны, т.е. не привязаны к объектам. Их можно копировать между объектами и вызывать с любым this. 
Но само существование [[HomeObject]] нарушает этот принцип, так как методы запоминают свои объекты. [[HomeObject]] нельзя изменить, эта связь – навсегда. Единственное место в языке, где используется [[HomeObject]] – это super. Поэтому если метод не использует super, то мы все ещё можем считать его свободным и копировать между объектами. А вот если super в коде есть, то возможны побочные эффекты.

Внутренние детали:
- Методы запоминают свой объект во внутреннем свойстве [[HomeObject]]. Благодаря этому работает super, он в его прототипе ищет родительские методы.
- Поэтому копировать метод, использующий super, между разными объектами небезопасно.

Допустим, у нас есть класс Animal:
	class Animal {
		constructor(name) {
			this.speed = 0;
			this.name = name;
		}
		run(speed) {
			this.speed = speed;
			alert(`${this.name} бежит со скоростью ${this.speed}.`);
		}
		stop() {
			this.speed = 0;
			alert(`${this.name} стоит неподвижно.`);
		}
	}
	let animal = new Animal("Мой питомец");
…И мы хотели бы создать ещё один class Rabbit.
Поскольку кролики – это животные, класс Rabbit должен быть основан на Animal, и иметь доступ к методам животных, так чтобы кролики могли делать то, что могут делать "общие" животные.
Синтаксис для расширения другого класса следующий: class Child extends Parent.
Давайте создадим class Rabbit, который наследуется от Animal:
	class Rabbit extends Animal {
		hide() {alert(`${this.name} прячется!`)}
	}
	let rabbit = new Rabbit("Белый кролик");
	rabbit.run(5); // Белый кролик бежит со скоростью 5.
	rabbit.hide(); // Белый кролик прячется!
Объект класса Rabbit имеет доступ как к методам Rabbit, таким как rabbit.hide(), так и к методам Animal, таким как rabbit.run().
Внутри ключевое слово extends работает по старой доброй механике прототипов. Оно устанавливает Rabbit.prototype.[[Prototype]] в Animal.prototype. Таким образом, если метода не оказалось в Rabbit.prototype, JS берет его из Animal.prototype.
Например, чтобы найти метод rabbit.run, движок проверяет:
- 1. Объект rabbit (не имеет run).
- 2. Его прототип, то есть Rabbit.prototype (имеет hide, но не имеет run).
- 3. Его прототип, то есть (вследствие extends) Animal.prototype, в котором, наконец, есть метод run.
Как мы помним из главы Встроенные прототипы, сам JS использует наследование на прототипах для встроенных объектов. Например, Date.prototype.[[Prototype]] является Object.prototype, поэтому у дат есть универсальные методы объекта.

После extends разрешены любые выражения.
Синтаксис создания класса допускает указывать после extends не только класс, но и любое выражение.
Пример вызова функции, которая генерирует родительский класс:
	function f(phrase) {
		return class {
			sayHi() {alert(phrase)}
		};
	}
	class User extends f("Привет") {}
	new User().sayHi(); // Привет
Здесь class User наследует от результата вызова f("Привет").
Это может быть полезно для продвинутых приёмов проектирования, где мы можем использовать функции для генерации классов в зависимости от многих условий и затем наследовать их.

Переопределение методов.
Теперь давайте продвинемся дальше и переопределим метод. По умолчанию все методы, не указанные в классе Rabbit, берутся непосредственно "как есть" из класса Animal.
Но если мы укажем в Rabbit собственный метод, например stop(), то он будет использован вместо него:
	class Rabbit extends Animal {
		stop() {
			// ...теперь это будет использоваться для rabbit.stop() вместо stop() из класса Animal
		}
	}
Впрочем, обычно мы не хотим полностью заменить родительский метод, а скорее хотим сделать новый на его основе, изменяя или расширяя его функциональность. Мы делаем что-то в нашем методе и вызываем родительский метод до/после или в процессе.
У классов есть ключевое слово "super" для таких случаев.
	super.method(...) // вызывает родительский метод.
	super(...) // для вызова родительского конструктора (работает только внутри нашего конструктора).
Пусть наш кролик автоматически прячется при остановке:
	class Animal {
		constructor(name) {
			this.speed = 0;
			this.name = name;
		}
		run(speed) {
			this.speed = speed;
			alert(`${this.name} бежит со скоростью ${this.speed}.`);
		}
		stop() {
			this.speed = 0;
			alert(`${this.name} стоит.`);
		}
	}
	class Rabbit extends Animal {
		hide() {
			alert(`${this.name} прячется!`);
		}
		stop() {
			super.stop(); // вызываем родительский метод stop
			this.hide(); // и затем hide
		}
	}
	let rabbit = new Rabbit("Белый кролик");
	rabbit.run(5); // Белый кролик бежит со скоростью 5.
	rabbit.stop(); // Белый кролик стоит. Белый кролик прячется!
Теперь у класса Rabbit есть метод stop, который вызывает родительский super.stop() в процессе выполнения.

У стрелочных функций нет super.
Как упоминалось в главе Повторяем стрелочные функции, стрелочные функции не имеют super.
При обращении к super стрелочной функции он берётся из внешней функции:
	class Rabbit extends Animal {
		stop() {
			setTimeout(() => super.stop(), 1000); // вызывает родительский stop после 1 секунды
		}
	}
В примере super в стрелочной функции тот же самый, что и в stop(), поэтому метод отрабатывает как и ожидается. Если бы мы указали здесь обычную функцию, была бы ошибка:
	// Unexpected super
	setTimeout(function() { super.stop() }, 1000);

Переопределение конструктора.
С конструкторами немного сложнее. До сих пор у Rabbit не было своего конструктора. Согласно спецификации, если класс расширяет другой класс и не имеет конструктора, то автоматически создаётся такой "пустой" конструктор:
	class Rabbit extends Animal {
		// генерируется для классов-потомков, у которых нет своего конструктора
		constructor(...args) {
			super(...args);
		}
	}
Как мы видим, он просто вызывает конструктор родительского класса. Так будет происходить, пока мы не создадим собственный конструктор.
Давайте добавим конструктор для Rabbit. Он будет устанавливать earLength в дополнение к name:
	class Animal {
		constructor(name) {
			this.speed = 0;
			this.name = name;
		}
		// ...
	}
	class Rabbit extends Animal {
		constructor(name, earLength) {
			this.speed = 0;
			this.name = name;
			this.earLength = earLength;
		}
		// ...
	}
	// Не работает!
	let rabbit = new Rabbit("Белый кролик", 10); // Error: this is not defined.
Упс! При создании кролика – ошибка! Что не так?
Если коротко, то:
	Конструкторы в наследуемых классах должны обязательно вызывать super(...), и (!) делать это перед использованием this.
…Но почему? Что происходит? Это требование кажется довольно странным.
Конечно, всему есть своё объяснение. Давайте углубимся в детали, чтобы вы действительно поняли, что происходит.
В JS существует различие между «функцией-конструктором наследующего класса» и всеми остальными. В наследующем классе соответствующая функция-конструктор помечена специальным внутренним свойством [[ConstructorKind]]:"derived".
Разница в следующем:
Когда выполняется обычный конструктор, он создаёт пустой объект и присваивает его this.
Когда запускается конструктор унаследованного класса, он этого не делает. Вместо этого он ждёт, что это сделает конструктор родительского класса.
Поэтому, если мы создаём собственный конструктор, мы должны вызвать super, в противном случае объект для this не будет создан, и мы получим ошибку.
Чтобы конструктор Rabbit работал, он должен вызвать super() до того, как использовать this, чтобы не было ошибки:
	class Animal {
		constructor(name) {
			this.speed = 0;
			this.name = name;
		}
		// ...
	}
	class Rabbit extends Animal {
		constructor(name, earLength) {
			super(name);
			this.earLength = earLength;
		}
		// ...
	}
	// теперь работает
	let rabbit = new Rabbit("Белый кролик", 10);
	alert(rabbit.name); // Белый кролик
	alert(rabbit.earLength); // 10

16.4.25
Переопределение полей класса: тонкое замечание
/**В этом подразделе предполагается, что у вас уже есть определённый опыт работы с классами, возможно, в других языках программирования.
Это даёт лучшее представление о языке, а также объясняет поведение, которое может быть источником ошибок (но не очень часто).
Если вы считаете этот материал слишком трудным для понимания, просто продолжайте читать дальше, а затем вернитесь к нему через некоторое время.*/
Мы можем переопределять не только методы, но и поля класса.
Однако, когда мы получаем доступ к переопределенному полю в родительском конструкторе, это поведение отличается от большинства других языков программирования.
Рассмотрим этот пример:
	class Animal {
		name = 'animal';
		constructor() {
			alert(this.name); // (*)
		}
	}
	class Rabbit extends Animal {
		name = 'rabbit';
	}
	new Animal(); // animal
	new Rabbit(); // animal
Здесь, класс Rabbit расширяет Animal и переопределяет поле name своим собственным значением.
В Rabbit нет собственного конструктора, поэтому вызывается конструктор Animal.
Что интересно, в обоих случаях: new Animal() и new Rabbit(), alert в строке (*) показывает animal.
Другими словами, родительский конструктор всегда использует своё собственное значение поля, а не переопределённое. Что же в этом странного? Если это ещё не ясно, сравните с методами. Вот тот же код, но вместо поля this.name, мы вызываем метод this.showName():
	class Animal {
		showName() {  // вместо this.name = 'animal'
			alert('animal');
		}
		constructor() {
			this.showName(); // вместо alert(this.name);
		}
	}
	class Rabbit extends Animal {
		showName() {alert('rabbit')}
	}
	new Animal(); // animal
	new Rabbit(); // rabbit
Обратите внимание: теперь результат другой.
И это то, чего мы, естественно, ожидаем. Когда родительский конструктор вызывается в производном классе, он использует переопределённый метод.
…Но для полей класса это не так. Как уже было сказано, родительский конструктор всегда использует родительское поле.
Почему же наблюдается разница?
Что ж, причина заключается в порядке инициализации полей. Поле класса инициализируется:
	- Перед конструктором для базового класса (который ничего не расширяет),
	- Сразу после super() для производного класса.
В нашем случае Rabbit – это производный класс. В нем нет конструктора constructor(). Как было сказано ранее, это то же самое, как если бы был пустой конструктор, содержащий только super(...args).
Итак, new Rabbit() вызывает super(), таким образом, выполняя родительский конструктор, и (согласно правилу для производных классов) только после этого инициализируются поля его класса. На момент выполнения родительского конструктора ещё нет полей класса Rabbit, поэтому используются поля Animal.
Это тонкое различие между полями и методами характерно для JavaScript.
К счастью, такое поведение проявляется только в том случае, когда переопределенное поле используется в родительском конструкторе. Тогда может быть трудно понять, что происходит, поэтому мы объясняем это здесь.
Если это становится проблемой, её можно решить, используя методы или геттеры/сеттеры вместо полей.

Устройство super, [[HomeObject]].
/**Продвинутая информация. Если вы читаете учебник первый раз – эту секцию можно пропустить.
Она рассказывает о внутреннем устройстве наследования и вызовe super.*/
Давайте заглянем «под капот» super. Здесь есть некоторые интересные моменты.
Вообще, исходя из наших знаний до этого момента, super вообще не может работать!
Ну правда, давайте спросим себя – как он должен работать, чисто технически? Когда метод объекта выполняется, он получает текущий объект как this. Если мы вызываем super.method(), то движку необходимо получить method из прототипа текущего объекта. И как ему это сделать?
Задача может показаться простой, но это не так. Движок знает текущий this и мог бы попытаться получить родительский метод как this.__proto__.method. Однако, увы, такой «наивный» путь не работает.
Продемонстрируем проблему. Без классов, используя простые объекты для наглядности.
Вы можете пропустить эту часть и перейти ниже к подсекции [[HomeObject]], если не хотите знать детали. Вреда не будет. Или читайте далее, если хотите разобраться.
В примере ниже rabbit.__proto__ = animal. Попробуем в rabbit.eat() вызвать animal.eat(), используя this.__proto__:
	let animal = {
		name: "Animal",
		eat() {alert(`${this.name} ест.`)}
	};
	let rabbit = {
		__proto__: animal,
		name: "Кролик",
		eat() {
			// вот как предположительно может работать super.eat()
			this.__proto__.eat.call(this); // (*)
		}
	};
	rabbit.eat(); // Кролик ест.
В строке (*) мы берём eat из прототипа (animal) и вызываем его в контексте текущего объекта. Обратите внимание, что .call(this) здесь неспроста: простой вызов this.__proto__.eat() будет выполнять родительский eat в контексте прототипа, а не текущего объекта.
Приведённый выше код работает так, как задумано: выполняется нужный alert.
Теперь давайте добавим ещё один объект в цепочку наследования и увидим, как все сломается:
	let animal = {
		name: "Животное",
		eat() {alert(`${this.name} ест.`)}
	};
	let rabbit = {
		__proto__: animal,
		eat() { // ...делаем что-то специфичное для кролика и вызываем родительский (animal) метод
			this.__proto__.eat.call(this); // (*)
		}
	};
	let longEar = {
		__proto__: rabbit,
		eat() {	// ...делаем что-то, связанное с длинными ушами, и вызываем родительский (rabbit) метод
			this.__proto__.eat.call(this); // (**)
		}
	};
	longEar.eat(); // Error: Maximum call stack size exceeded
Теперь код не работает! Ошибка возникает при попытке вызова longEar.eat().
На первый взгляд все не так очевидно, но если мы проследим вызов longEar.eat(), то сможем понять причину ошибки. В обеих строках (*) и (**) значение this – это текущий объект (longEar). Это важно: для всех методов объекта this указывает на текущий объект, а не на прототип или что-то ещё.
Итак, в обеих линиях (*) и (**) значение this.__proto__ одно и то же: rabbit. В обоих случаях метод rabbit.eat вызывается в бесконечном цикле не поднимаясь по цепочке вызовов.
1. Внутри longEar.eat() строка (**) вызывает rabbit.eat со значением this=longEar.
	// внутри longEar.eat() у нас this = longEar
	this.__proto__.eat.call(this) // (**)
	// становится
	longEar.__proto__.eat.call(this)
	// то же что и
	rabbit.eat.call(this);
2. В строке (*) в rabbit.eat мы хотим передать вызов выше по цепочке, но this=longEar, поэтому this.__proto__.eat снова равен rabbit.eat!
	// внутри rabbit.eat() у нас также this = longEar
	this.__proto__.eat.call(this) // (*)
	// становится
	longEar.__proto__.eat.call(this)
	// или (снова)
	rabbit.eat.call(this);
3. …rabbit.eat вызывает себя в бесконечном цикле, потому что не может подняться дальше по цепочке.
Проблема не может быть решена с помощью одного только this.

[[HomeObject]].
Для решения этой проблемы в JS было добавлено специальное внутреннее свойство для функций: [[HomeObject]].
Когда функция объявлена как метод внутри класса или объекта, её свойство [[HomeObject]] становится равно этому объекту.
Затем super использует его, чтобы получить прототип родителя и его методы.
Давайте посмотрим, как это работает – опять же, используя простые объекты:
	let animal = {
		name: "Животное",
		eat() {         // animal.eat.[[HomeObject]] == animal
			alert(`${this.name} ест.`);
		}
	};
	let rabbit = {
		__proto__: animal,
		name: "Кролик",
		eat() {         // rabbit.eat.[[HomeObject]] == rabbit
			super.eat();
		}
	};
	let longEar = {
		__proto__: rabbit,
		name: "Длинноух",
		eat() {         // longEar.eat.[[HomeObject]] == longEar
			super.eat();
		}
	};
	// работает верно
	longEar.eat();  // Длинноух ест.
Это работает как задумано благодаря [[HomeObject]]. Метод, такой как longEar.eat, знает свой [[HomeObject]] и получает метод родителя из его прототипа. Вообще без использования this.

Методы не свободны.
До этого мы неоднократно видели, что функции в JS свободны, не привязаны к объектам. Их можно копировать между объектами и вызывать с любым this. Но само существование [[HomeObject]] нарушает этот принцип, так как методы запоминают свои объекты. [[HomeObject]] нельзя изменить, эта связь – навсегда.
Единственное место в языке, где используется [[HomeObject]] – это super. Поэтому если метод не использует super, то мы все ещё можем считать его свободным и копировать между объектами. А вот если super в коде есть, то возможны побочные эффекты.
Вот пример неверного результата super после копирования:
	let animal = {
		sayHi() {alert("Я животное")}
	};
	// rabbit наследует от animal
	let rabbit = {
		__proto__: animal,
		sayHi() {super.sayHi()}
	};
	let plant = {
		sayHi() {alert("Я растение")}
	};
	// tree наследует от plant
	let tree = {
		__proto__: plant,
		sayHi: rabbit.sayHi // (*)
	};
	tree.sayHi();  // Я животное (?!?)
Вызов tree.sayHi() показывает «Я животное». Определённо неверно.
Причина проста:
- В строке (*), метод tree.sayHi скопирован из rabbit. Возможно, мы хотели избежать дублирования кода?
- Его [[HomeObject]] – это rabbit, ведь он был создан в rabbit. Свойство [[HomeObject]] никогда не меняется.
- В коде tree.sayHi() есть вызов super.sayHi(). Он идёт вверх от rabbit и берёт метод из animal.

Методы, а не свойства-функции.
Свойство [[HomeObject]] определено для методов как классов, так и обычных объектов. Но для объектов методы должны быть объявлены именно как method(), а не "method: function()". Для нас различий нет, но они есть для JS.
В приведённом ниже примере используется синтаксис не метода, свойства-функции. Поэтому у него нет [[HomeObject]], и наследование не работает:
	let animal = {
		eat: function() { /* намеренно пишем так, а не eat() { ...*/ }
	};
	let rabbit = {
		__proto__: animal,
		eat: function() {super.eat()}
	};
	rabbit.eat(); // Ошибка вызова super (потому что нет [[HomeObject]])

Итого:
1. Чтобы унаследовать от класса: class Child extends Parent:
	- При этом Child.prototype.__proto__ будет равен Parent.prototype, так что методы будут унаследованы.
2. При переопределении конструктора:
	- Обязателен вызов конструктора родителя super() в конструкторе Child до обращения к this.
3. При переопределении другого метода:
	- Мы можем вызвать super.method() в методе Child для обращения к методу родителя Parent.
4. Внутренние детали:
	- Методы запоминают свой объект во внутреннем свойстве [[HomeObject]]. Благодаря этому работает super, он в его прототипе ищет родительские методы.
	- Поэтому копировать метод, использующий super, между разными объектами небезопасно.
Также:
	- У стрелочных функций нет своего this и super, поэтому они прозрачно встраиваются во внешний контекст.

Задачи: 1+ 2-

1. Ошибка создания экземпляра класса (важность: 5)
В коде ниже класс Rabbit наследует Animal.
К сожалению, объект класса Rabbit не создаётся. Что не так? Исправьте ошибку.
	class Animal {
		constructor(name) {this.name = name}
	}
	class Rabbit extends Animal {
		constructor(name) {
			this.name = name;
			this.created = Date.now();
		}
	}
	let rabbit = new Rabbit("Белый кролик"); // Error: this is not defined
	alert(rabbit.name);
решение:
	class Animal {
		constructor(name) {this.name = name}
	}
	class Rabbit extends Animal {
		constructor(name) {
			super(name);
			// this.name = name;
			this.created = Date.now();
		}
	}
	rabbit = new Rabbit("Белый кролик");
	console.log(rabbit.name); // Белый кролик

2. Улучшенные часы (важность: 5)
У нас есть класс Clock. Сейчас он выводит время каждую секунду
class Clock {
	constructor({ template }) {
		this.template = template;
	}
	render() {
		let date = new Date();
		let hours = date.getHours();
		if (hours < 10) hours = '0' + hours;
		let mins = date.getMinutes();
		if (mins < 10) mins = '0' + mins;
		let secs = date.getSeconds();
		if (secs < 10) secs = '0' + secs;
		let output = this.template
		  .replace('h', hours)
		  .replace('m', mins)
		  .replace('s', secs);
		console.log(output);
	}
	stop() {
		clearInterval(this.timer);
	}
	start() {
		this.render();
		this.timer = setInterval(() => this.render(), 1000);
	}
}
Создайте новый класс ExtendedClock, который будет наследоваться от Clock и добавьте параметр precision – количество миллисекунд между «тиками». Установите значение в 1000 (1 секунда) по умолчанию.
Сохраните ваш код в файл extended-clock.js
Не изменяйте класс clock.js. Расширьте его.
решение:
class ExtendedClock extends Clock {
    constructor(options) {
        super(options);
        let { precision = 1000 } = options;
        this.precision = precision;
    }
    start() {
        this.render();
        this.timer = setInterval(() => this.render(), this.precision);
    }
};

app\js\clock.js:
let timerPage = document.querySelector('#timer');
class Clock {
    constructor({ template }) {
        this.template = template;
    }
    render() {
        let date = new Date();
        let hours = date.getHours();
        // if (hours < 10) hours = '0' + hours;
        let mins = date.getMinutes();
        if (mins < 10) mins = '0' + mins;
        let secs = date.getSeconds();
        if (secs < 10) secs = '0' + secs;
        let output = this.template
            .replace('h', hours)
            .replace('m', mins)
            .replace('s', secs);
        return output;
    }
    start() {
        timerPage.innerText = this.render();
        this.timer = setInterval(() => {
            this.render();
            timerPage.innerText = this.render();
        }, 1000);
    }
    stop() {
        clearInterval(this.timer);
    };
}
let clock = new Clock({template: 'h:m:s'});
timerPage.innerText = clock.render();
const btnStart = document.querySelector('#btnStart');
const btnStop = document.querySelector('#btnStop');
btnStart.onclick = function(){clock.start()};
btnStop.onclick = function(){clock.stop()};

#1.9.3. Статические свойства и методы
25.12.24 - https://learn.javascript.ru/static-properties-methods
Статическими методы - это методы присвоенные самому классу. В объявление класса они добавляются с помощью ключевого слова static.
	static staticMethod() {...}; // статический метод, объявленный внутри класса
	Class.staticMethod = function() {...}; // статический метод, объявленный вне класса
Значением this при вызове Class.staticMethod() является сам конструктор класса Class (правило "объект до точки").
Статические методы используются для реализации функций, которые будут принадлежать классу в целом, но не какому-либо его конкретному объекту.
Статические методы также используются в классах, относящихся к базам данных, для поиска/сохранения/удаления вхождений в базу данных.
Статические методы недоступны для отдельных объектов, они могут вызываться только для классов.
Статические методы используются для функциональности, принадлежат классу в целом, а не относятся к конкретному объекту класса.

Статические свойства были недавно добавлены в JS, они выглядят как свойства класса, но с static в начале:
	static prop = value; // статическое свойство, объявленное внутри класса
	Class.prop = value; // статическое свойство, объявленное вне класса
Статические свойства используются в тех случаях, когда мы хотели бы сохранить данные на уровне класса, а не какого-то одного объекта.
Технически, статическое объявление – это то же самое, что и присвоение классу.
Статические свойства и методы наследуются.

class Rabbit {
    constructor(name) {this.name = name;}
}
class Rabbit1 extends Object {
    constructor(name) {
        super();
        this.name = name;
    }
}
let rabbit = new Rabbit("Rabbit");
let rabbit1 = new Rabbit1("Кроль");
console.log(rabbit.hasOwnProperty('name')); // true
console.log(rabbit1.hasOwnProperty('name')); // true
// без super() - ошибка - Uncaught ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
console.log(rabbit); // Rabbit {name: 'Rabbit'}
console.log(rabbit1); // Rabbit1 {name: 'Кроль'}
console.log(Rabbit.__proto__ === Object); // false
console.log(Rabbit.__proto__ === Function.prototype); // true
console.log(Rabbit.__proto__); // ƒ () { [native code] }
console.log(Rabbit1.__proto__ === Object); // true
console.log(Rabbit1.__proto__ === Function.prototype); // false
console.log(Rabbit1.__proto__); // ƒ Object() { [native code] }

=> У обычного класса прототип конструктора это прототип функции, а у класса, наследуемого от объекта, прототип конструктора это прототип объекта.

22.4.25 - https://learn.javascript.ru/static-properties-methods
Мы можем присвоить метод самому классу. Такие методы называются статическими.
В объявление класса они добавляются с помощью ключевого слова static, например:
	class User {
		static staticMethod() {
			alert(this === User);
		}
	}
	User.staticMethod(); // true
Это фактически то же самое, что присвоить метод напрямую как свойство функции:
	class User { }
	User.staticMethod = function() {
		alert(this === User);
	};
Значением this при вызове User.staticMethod() является сам конструктор класса User (правило «объект до точки»).
Обычно статические методы используются для реализации функций, которые будут принадлежать классу в целом, но не какому-либо его конкретному объекту.
Например, есть объекты статей Article, и нужна функция для их сравнения.
Естественное решение – сделать для этого статический метод Article.compare:
	class Article {
		constructor(title, date) {
			this.title = title;
			this.date = date;
		}
		static compare(articleA, articleB) {
			return articleA.date - articleB.date;
		}
	}
	// использование
	let articles = [
		new Article("HTML", new Date(2019, 1, 1)),
		new Article("CSS", new Date(2019, 0, 1)),
		new Article("JavaScript", new Date(2019, 11, 1))
	];
	articles.sort(Article.compare);
	alert( articles[0].title ); // CSS
Здесь метод Article.compare стоит над статьями, как средство для их сравнения. Это метод не отдельной статьи, а всего класса.
Другим примером может быть так называемый фабричный метод.
Скажем, нам нужно несколько способов создания статьи:
	1. Создание через заданные параметры (title, date и т.д.).
	2. Создание пустой статьи с сегодняшней датой.
	3. …или как-то ещё.
Первый способ может быть реализован через конструктор. А для второго можно использовать статический метод класса.
Такой как Article.createTodays() в следующем примере:
	class Article {
		constructor(title, date) {
			this.title = title;
			this.date = date;
		}
		static createTodays() { // помним, что this = Article
			return new this("Сегодняшний дайджест", new Date());
		}
	}
	let article = Article.createTodays();
	alert( article.title ); // Сегодняшний дайджест
Теперь каждый раз, когда нам нужно создать сегодняшний дайджест, нужно вызывать Article.createTodays(). Ещё раз, это не метод одной статьи, а метод всего класса.
Статические методы также используются в классах, относящихся к базам данных, для поиска/сохранения/удаления вхождений в базу данных, например:
	// предположим, что Article - это специальный класс для управления статьями
	// статический метод для удаления статьи по id:
	Article.remove({id: 12345});

Статические методы недоступны для отдельных объектов.
Статические методы могут вызываться для классов, но не для отдельных объектов.
Например. такой код не будет работать:
	// ...
	article.createTodays(); // Error: article.createTodays is not a function

Статические свойства.
// Эта новая возможность была добавлена в язык недавно. Примеры работают в последнем Chrome.
Статические свойства также возможны, они выглядят как свойства класса, но с static в начале:
	class Article {
		static publisher = "Илья Кантор";
	}
	alert( Article.publisher ); // Илья Кантор
Это то же самое, что и прямое присваивание Article:
	Article.publisher = "Илья Кантор";

Наследование статических свойств и методов.
Статические свойства и методы наследуются.
Например, метод Animal.compare в коде ниже наследуется и доступен как Rabbit.compare:
	class Animal {
		constructor(name, speed) {
			this.speed = speed;
			this.name = name;
		}
		run(speed = 0) {
			this.speed += speed;
			alert(`${this.name} бежит со скоростью ${this.speed}.`);
		}
		static compare(animalA, animalB) {
			return animalA.speed - animalB.speed;
		}
	}
	class Rabbit extends Animal {// Наследует от Animal
		hide() {
			alert(`${this.name} прячется!`);
		}
	}
	let rabbits = [
		new Rabbit("Белый кролик", 10),
		new Rabbit("Чёрный кролик", 5)
	];
	rabbits.sort(Rabbit.compare);
	rabbits[0].run(); // Чёрный кролик бежит со скоростью 5.
Мы можем вызвать Rabbit.compare, при этом будет вызван унаследованный Animal.compare.
Как это работает? Снова с использованием прототипов. Как вы уже могли предположить, extends даёт Rabbit ссылку [[Prototype]] на Animal.
Так что Rabbit extends Animal создаёт две ссылки на прототип. Функция Rabbit прототипно наследует от функции Animal. Rabbit.prototype прототипно наследует от Animal.prototype.
В результате наследование работает как для обычных, так и для статических методов.
Давайте это проверим кодом:
	class Animal {}
	class Rabbit extends Animal {}
	// для статики
	alert(Rabbit.__proto__ === Animal); // true
	// для обычных методов
	alert(Rabbit.prototype.__proto__ === Animal.prototype); // true

Итого:
Статические методы используются для функциональности, принадлежат классу в целом, а не относятся к конкретному объекту класса.
Например, метод для сравнения двух статей Article.compare(article1, article2) или фабричный метод Article.createTodays().
В объявлении класса они помечаются ключевым словом static.
Статические свойства используются в тех случаях, когда мы хотели бы сохранить данные на уровне класса, а не какого-то одного объекта.
Синтаксис:
	class MyClass {
		static property = ...;
		static method() {/* ... */}
	}
Технически, статическое объявление – это то же самое, что и присвоение классу:
	MyClass.property = ...
	MyClass.method = ...
Статические свойства и методы наследуются.
Для class B extends A прототип класса B указывает на A: B.[[Prototype]] = A. Таким образом, если поле не найдено в B, поиск продолжается в A.

Задачи: 1-
1. Класс расширяет объект? (важность: 3)
Как мы уже знаем, все объекты наследуют от Object.prototype и имеют доступ к общим методам объекта, например hasOwnProperty.
Пример:
	class Rabbit {
		constructor(name) {this.name = name}
	}
	let rabbit = new Rabbit("Rab");
	// метод hasOwnProperty от Object.prototype
	alert( rabbit.hasOwnProperty('name') ); // true
Но что если мы явно напишем "class Rabbit extends Object" – тогда результат будет отличаться от обычного "class Rabbit"?
В чем разница?
Ниже пример кода с таким наследованием (почему он не работает? исправьте его):
	class Rabbit extends Object {
		constructor(name) {this.name = name}
	}
	let rabbit = new Rabbit("Кроль");
	alert( rabbit.hasOwnProperty('name') ); // Uncaught ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
решение:
Сперва давайте разберёмся, почему код не работает.
Причина становится очевидна, если мы попытаемся запустить его. Унаследованный конструктор класса должен вызывать super(). В противном случае "this" будет не определён. Решение:
	class Rabbit extends Object {
		constructor(name) {
			super(); // надо вызвать конструктор родителя, когда наследуемся
			this.name = name;
		}
	}
	let rabbit = new Rabbit("Кроль");
	alert( rabbit.hasOwnProperty('name') ); // true
Но это ещё не все.
Даже после исправления есть важное различие между "class Rabbit extends Object" и class Rabbit.
Как мы знаем, синтаксис «extends» устанавливает 2 прототипа:
	1. Между "prototype" функций-конструкторов (для методов)
	2. Между самими функциями-конструкторами (для статических методов).
В случае с class Rabbit extends Object это значит:
	class Rabbit extends Object {}
	alert( Rabbit.prototype.__proto__ === Object.prototype ); // (1) true
	alert( Rabbit.__proto__ === Object ); // (2) true
Таким образом, Rabbit предоставляет доступ к статическим методам Object через Rabbit, например:
	class Rabbit extends Object {}
	// обычно мы вызываем Object.getOwnPropertyNames
	alert( Rabbit.getOwnPropertyNames({a: 1, b: 2}) ); // a,b
Но если явно не наследуем от объекта, то для Rabbit.__proto__ не установлено значение Object.
Пример:
	class Rabbit {}
	alert( Rabbit.prototype.__proto__ === Object.prototype ); // (1) true
	alert( Rabbit.__proto__ === Object ); // (2) false (!)
	alert( Rabbit.__proto__ === Function.prototype ); // как у каждой функции по умолчанию
	// ошибка - нет такой функции у Rabbit
	alert( Rabbit.getOwnPropertyNames({a: 1, b: 2}) ); // Ошибка
Таким образом, в этом случае у Rabbit нет доступа к статическим методам Object.
Кстати, у Function.prototype также есть «общие» методы, такие как call, bind и т. д. Они в конечном итоге доступны в обоих случаях, потому что для встроенного конструктора Object Object.__proto__ === Function.prototype.
Короче говоря, есть два отличия:
	class Rabbit								class Rabbit extends Object
	–											необходимо вызвать super() в конструкторе
	Rabbit.__proto__ === Function.prototype		Rabbit.__proto__ === Object

#1.9.4. Приватные и защищённые методы и свойства
25.12.24 - https://learn.javascript.ru/private-protected-properties-methods
В ООП свойства и методы разделены на 2 группы:
1) Внутренний интерфейс – методы и свойства, доступные из других методов класса, но не снаружи класса.
2) Внешний интерфейс – методы и свойства, доступные снаружи класса.
В терминах ООП отделение внутреннего интерфейса от внешнего называется инкапсуляция.
В JS есть два типа полей (свойств и методов) объекта:
- Публичные: доступны отовсюду. Они составляют внешний интерфейс. До этого момента мы использовали только публичные свойства и методы.
- Приватные: доступны только внутри класса. Они для внутреннего интерфейса.
/** Во многих других языках также существуют защищённые поля, доступные только внутри класса или для дочерних классов (то есть, как приватные, но разрешён доступ для наследующих классов), которые также полезны для внутреннего интерфейса. В некотором смысле они более распространены, чем приватные, потому что мы обычно хотим, чтобы наследующие классы получали доступ к внутренним полям. Защищённые поля не реализованы в JS на уровне языка, но на практике они очень удобны, поэтому их эмулируют.*/

Защищённые свойства обычно начинаются с префикса _. Это не синтаксис языка: есть хорошо известное соглашение между программистами, что такие свойства и методы не должны быть доступны извне. Большинство программистов следуют этому соглашению.
Защищённые поля наследуются, в отличие от приватных полей. Если мы унаследуем class Class extends ClassParent, ничто не мешает нам обращаться к this._prop из методов нового класса.

Приватные свойства и методы должны начинаться с #. Они доступны только внутри класса, мы не можем получить к ним доступ извне или из наследуемых классов. Приватные поля не конфликтуют с публичными. Может быть два поля одновременно – приватное #prop и публичное prop.
В отличие от защищённых, функциональность приватных полей обеспечивается самим языком. 
В наследуемых классах доступ к приватным полям осуществляется только через геттеры и сеттеры.
У приватных свойств this['#prop'] не работает. Это ограничение синтаксиса сделано для обеспечения приватности.

Преимущества инкапсуляции:
- Защита от дурака. Если пользователь класса изменит вещи, не предназначенные для изменения извне – последствия непредсказуемы.
- Поддерживаемость. Если мы чётко отделим внутренний интерфейс, то разработчик класса сможет свободно менять его внутренние свойства и методы, даже не информируя пользователей.
- Сокрытие сложности. Всегда удобно, когда детали реализации скрыты, и доступен простой, хорошо документированный внешний интерфейс.

Для сокрытия внутреннего интерфейса используются защищённые или приватные свойства:
- Защищённые поля имеют префикс _. Это хорошо известное соглашение, не поддерживаемое на уровне языка. Программисты должны обращаться к полю, начинающемуся с _, только из его класса и классов, унаследованных от него.
- Приватные поля имеют префикс #. JS гарантирует, что мы можем получить доступ к таким полям только внутри класса. В настоящее время приватные поля не очень хорошо поддерживаются в браузерах, но можно использовать полифил.

24.4.25 - https://learn.javascript.ru/private-protected-properties-methods
Один из важнейших принципов объектно-ориентированного программирования – разделение внутреннего и внешнего интерфейсов.
Это обязательная практика в разработке чего-либо сложнее, чем "hello world".
Чтобы понять этот принцип, давайте на секунду забудем о программировании и обратим взгляд на реальный мир.
Устройства, которыми мы пользуемся, обычно довольно сложно устроены. Но разделение внутреннего и внешнего интерфейсов позволяет нам пользоваться ими без каких-либо проблем.
/**Пример из реальной жизни.
Например, кофеварка. Простая снаружи: кнопка, экран, несколько отверстий… И, конечно, результат – прекрасный кофе! :)
Но внутри… (картинка из инструкции по ремонту) Множество деталей. Но мы можем пользоваться ею, ничего об этом не зная.
Кофеварки довольно надёжны, не так ли? Мы можем пользоваться ими годами, и если что-то пойдёт не так – отнесём в ремонт. Секрет надёжности и простоты кофеварки – все детали хорошо отлажены и спрятаны внутри. Если мы снимем защитный кожух с кофеварки, то пользоваться ею будет гораздо сложнее (куда нажимать?) и опаснее (может привести к поражению электрическим током).
Как мы увидим, в программировании объекты похожи на кофеварки.
Но, чтобы скрыть внутренние детали, мы будем использовать не защитный кожух, а специальный синтаксис языка и соглашения.*/

Внутренний и внешний интерфейсы.
В ООП свойства и методы разделены на 2 группы:
	Внутренний интерфейс – методы и свойства, доступные из других методов класса, но не снаружи класса.
	Внешний интерфейс – методы и свойства, доступные снаружи класса.
Если мы продолжаем аналогию с кофеваркой – то, что скрыто внутри: трубка кипятильника, нагревательный элемент и т.д. – это внутренний интерфейс.
Внутренний интерфейс используется для работы объекта, его детали используют друг друга. Например, трубка кипятильника прикреплена к нагревательному элементу. Но снаружи кофеварка закрыта защитным кожухом, так что никто не может добраться до сложных частей. Детали скрыты и недоступны. Мы можем использовать их функции через внешний интерфейс. Итак, всё, что нам нужно для использования объекта, это знать его внешний интерфейс. Мы можем совершенно не знать, как это работает внутри, и это здорово.
Это было общее введение.
В JS есть два типа полей (свойств и методов) объекта:
	Публичные: доступны отовсюду. Они составляют внешний интерфейс. До этого момента мы использовали только публичные свойства и методы.
	Приватные: доступны только внутри класса. Они для внутреннего интерфейса.
Во многих других языках также существуют защищённые поля, доступные только внутри класса или для дочерних классов (то есть, как приватные, но разрешён доступ для наследующих классов) и также полезны для внутреннего интерфейса. В некотором смысле они более распространены, чем приватные, потому что мы обычно хотим, чтобы наследующие классы получали доступ к внутренним полям.
Защищённые поля не реализованы в JS на уровне языка, но на практике они очень удобны, поэтому их эмулируют.
А теперь давайте сделаем кофеварку на JS со всеми этими типами свойств. Кофеварка имеет множество деталей, мы не будем их моделировать для простоты примера (хотя могли бы).

Защищённое свойство waterAmount.
Давайте для начала создадим простой класс для описания кофеварки:
	class CoffeeMachine {
		waterAmount = 0; // количество воды внутри
		constructor(power) {
			this.power = power;
			alert( `Создана кофеварка, мощность: ${power}` );
		}
	}
	let coffeeMachine = new CoffeeMachine(100); // создаём кофеварку
	coffeeMachine.waterAmount = 200; // добавляем воды
Прямо сейчас свойства waterAmount и power публичные. Мы можем легко получать и устанавливать им любое значение извне.
Давайте изменим свойство waterAmount на защищённое, чтобы иметь больше контроля над ним. Например, мы не хотим, чтобы кто-либо устанавливал его ниже 0. 
Защищённые свойства обычно начинаются с префикса _. Это не синтаксис языка: есть хорошо известное соглашение между программистами, что такие свойства и методы не должны быть доступны извне. Большинство программистов следуют этому соглашению.
Так что наше свойство будет называться _waterAmount:
	class CoffeeMachine {
		_waterAmount = 0;
		set waterAmount(value) {
			if (value < 0) throw new Error("Отрицательное количество воды");
			this._waterAmount = value;
		}
		get waterAmount() {
			return this._waterAmount;
		}
		constructor(power) {
			this._power = power;
		}
	}
	let coffeeMachine = new CoffeeMachine(100); // создаём новую кофеварку
	// устанавливаем количество воды
	coffeeMachine.waterAmount = -10; // Error: Отрицательное количество воды
Теперь доступ под контролем, поэтому указать воду ниже нуля не удалось.

Свойство только для чтения power.
Давайте сделаем свойство power доступным только для чтения. Иногда нужно, чтобы свойство устанавливалось только при создании объекта и после этого никогда не изменялось.
Это как раз требуется для кофеварки: мощность никогда не меняется.
Для этого нам нужно создать только геттер, но не сеттер:
	class CoffeeMachine {
		// ...
		constructor(power) {this._power = power}
		get power() {return this._power}
	}
	let coffeeMachine = new CoffeeMachine(100); // создаём кофеварку
	alert(`Мощность: ${coffeeMachine.power}W`); // Мощность: 100W
	coffeeMachine.power = 25; // Error (no setter)
Здесь мы использовали синтаксис геттеров/сеттеров.
Но в большинстве случаев использование функций get.../set... предпочтительнее:
	class CoffeeMachine {
		_waterAmount = 0;
		setWaterAmount(value) {
			if (value < 0) throw new Error("Отрицательное количество воды");
			this._waterAmount = value;
		}
		getWaterAmount() {return this._waterAmount}
	}
	new CoffeeMachine().setWaterAmount(100);
Это выглядит немного длиннее, но функции более гибкие. Они могут принимать несколько аргументов (даже если они нам сейчас не нужны). Итак, на будущее, если нам надо что-то отрефакторить, функции – более безопасный выбор.
С другой стороны, синтаксис get/set короче, решать вам.
Защищённые поля наследуются. Если мы унаследуем class MegaMachine extends CoffeeMachine, ничто не помешает нам обращаться к this._waterAmount или this._power из методов нового класса. Таким образом, защищённые поля, конечно же, наследуются. В отличие от приватных полей, в чём мы убедимся ниже.

Приватное свойство #waterLimit.
// Новая возможность. Эта возможность была добавлена в язык недавно. В движках JS пока не поддерживается или поддерживается частично, нужен полифил.
Есть новшество в языке JS, которое почти добавлено в стандарт: оно добавляет поддержку приватных свойств и методов.
Приватные свойства и методы должны начинаться с #. Они доступны только внутри класса.
Например, в классе ниже есть приватное свойство #waterLimit и приватный метод #checkWater для проверки количества воды:
	class CoffeeMachine {
		#waterLimit = 200;
		#checkWater(value) {
			if (value < 0) throw new Error("Отрицательный уровень воды");
			if (value > this.#waterLimit) throw new Error("Слишком много воды");
		}
	}
	let coffeeMachine = new CoffeeMachine();
	// снаружи нет доступа к приватным методам класса
	coffeeMachine.#checkWater(); // Error
	coffeeMachine.#waterLimit = 1000; // Error
На уровне языка # является специальным символом, который означает, что поле приватное. Мы не можем получить к нему доступ извне или из наследуемых классов.
Приватные поля не конфликтуют с публичными. У нас может быть два поля одновременно – приватное #waterAmount и публичное waterAmount.
Например, давайте сделаем аксессор waterAmount для #waterAmount:
	class CoffeeMachine {
		#waterAmount = 0;
		get waterAmount() {return this.#waterAmount}
		set waterAmount(value) {
			if (value < 0) throw new Error("Отрицательный уровень воды");
			this.#waterAmount = value;
		}
	}
	let machine = new CoffeeMachine();
	machine.waterAmount = 100;
	alert(machine.#waterAmount); // Error
В отличие от защищённых, функциональность приватных полей обеспечивается самим языком. Это хорошо.
Но если мы унаследуем от CoffeeMachine, то мы не получим прямого доступа к #waterAmount. Мы будем вынуждены полагаться на геттер/сеттер waterAmount:
	class MegaCoffeeMachine extends CoffeeMachine {
		method() {
			alert( this.#waterAmount ); // Error: can only access from CoffeeMachine
		}
	}
Во многих случаях такое ограничение слишком жёсткое. Раз уж мы расширяем CoffeeMachine, у нас может быть вполне законная причина для доступа к внутренним методам и свойствам. Поэтому защищённые свойства используются чаще, хоть они и не поддерживаются синтаксисом языка.

Важно: Приватные поля особенные.
Как мы помним, обычно мы можем получить доступ к полям объекта с помощью this[name]:
	class User {
		...
		sayHi() {
			let fieldName = "name";
			alert(`Hello, ${this[fieldName]}`);
		}
	}
С приватными свойствами такое невозможно: this['#name'] не работает. Это ограничение синтаксиса сделано для обеспечения приватности.

Итого:
В терминах ООП отделение внутреннего интерфейса от внешнего называется инкапсуляция.
Это даёт следующие выгоды:
(1) Защита для пользователей, чтобы они не выстрелили себе в ногу.
Представьте себе, что есть команда разработчиков, использующая кофеварку. Она была изготовлена компанией «Лучшие Кофеварки» и работает нормально, но защитный кожух был снят. Внутренний интерфейс стал доступен извне.
Все разработчики культурны – они используют кофеварку по назначению. Но один из них, Джон, решил, что он самый умный, и сделал некоторые изменения во внутренностях кофеварки. После чего кофеварка вышла из строя через два дня.
Это, конечно, не вина Джона, а скорее человека, который снял защитный кожух и позволил Джону делать свои манипуляции.
То же самое в программировании. Если пользователь класса изменит вещи, не предназначенные для изменения извне – последствия непредсказуемы.
(2) Поддерживаемость.
Ситуация в программировании сложнее, чем с реальной кофеваркой, потому что мы не просто покупаем её один раз. Код постоянно подвергается разработке и улучшению. Если мы чётко отделим внутренний интерфейс, то разработчик класса сможет свободно менять его внутренние свойства и методы, даже не информируя пользователей… Если вы разработчик такого класса, то приятно знать, что приватные методы можно безопасно переименовывать, их параметры можно изменять и даже удалять, потому что от них не зависит никакой внешний код.
В новой версии вы можете полностью всё переписать, но пользователю будет легко обновиться, если внешний интерфейс остался такой же.
(3) Сокрытие сложности.
Люди обожают использовать простые вещи. По крайней мере, снаружи. Что внутри – это другое дело. Программисты не являются исключением.
Всегда удобно, когда детали реализации скрыты, и доступен простой, хорошо документированный внешний интерфейс.
Для сокрытия внутреннего интерфейса мы используем защищённые или приватные свойства:
	- Защищённые поля имеют префикс _. Это хорошо известное соглашение, не поддерживаемое на уровне языка. Программисты должны обращаться к полю, начинающемуся с _, только из его класса и классов, унаследованных от него.
	- Приватные поля имеют префикс #. JS гарантирует, что мы можем получить доступ к таким полям только внутри класса.
В настоящее время приватные поля не очень хорошо поддерживаются в браузерах, но можно использовать полифил.

19.12.24 Геттеры и сеттеры - https://learn.javascript.ru/getters-setters
Для управляемого доступа к состоянию объекта используют специальные функции, так называемые геттеры и сеттеры.
Геттер (getter method) - специальный метод для того, чтобы дать возможность внешнему коду узнать его значение. Обычно, геттеры служат для получения свойств объекта. Типичное название для геттера - getProp().
	getProp(){return this.prop};	get method(){return this.prop};
Сеттер (setter method) - специальный метод, через который осуществляется запись приватного свойства. Обычно сеттеры служат для изменения свойств объекта. Типичное название для сеттера – setProp(). 
	setProp(prop){this.prop = prop}; 	set method(prop){this.prop = prop};

Итого:
	- Для большего контроля над присвоением и чтением значения вместо свойства делают функцию-геттер и функцию-сеттер, геттер возвращает значение, сеттер – устанавливает.
	- Если свойство предназначено только для чтения, то может быть только геттер, только для записи – только сеттер.
	- В качестве альтернативы к паре геттер/сеттер применяют единую функцию, которая без аргументов ведёт себя как геттер, а с аргументом – как сеттер.
Также можно организовать геттеры/сеттеры для свойства, не меняя структуры кода, через дескрипторы свойств.

// кофеварка v1.0 (12-2024)
class CoffeeMachine {
    constructor(power, capacity) {// capacity - ёмкость кофеварки
        let waterAmount = 0;
        let timerId;
        this.isRunning = function() {return !!timerId};
        const WATER_HEAT_CAPACITY = 4200;
        function getTimeToBoil() {
            return waterAmount * WATER_HEAT_CAPACITY * 80 / power;
        };
        this.setWaterAmount = function(amount) {
            if (amount < 0) { throw new Error('Значение должно быть положительным'); };
            if (amount > capacity) { throw new Error('Нельзя залить воды больше, чем ' + capacity); };
            waterAmount = amount;
        }; // сеттер количества воды
        this.getWaterAmount = function() {return waterAmount}; // геттер количества воды
        this.waterAmount = function(amount) {
            if (!arguments.length) {return waterAmount}; // вызов без параметра, => геттер, возвращаем свойство
            // иначе режим сеттера
            if (amount < 0) { throw new Error('Значение должно быть положительным'); };
            if (amount > capacity) { throw new Error('Нельзя залить воды больше, чем ' + capacity); };
            waterAmount = amount;
        }; // единый геттер-сеттер количества воды
        this.getPower = function() {return power}; // геттер мощности
        this.addWater = function(amount) {
            this.setWaterAmount(waterAmount + amount);
        }; // добавление воды
        function onReady() {console.log('Кофе готов: ' + waterAmount + ' мл')}; // вывод результата
        this.setOnReady = function(newOnReady) {onReady = newOnReady}; // сеттер чтобы код снаружи мог назначить свой onReady
        this.run = function() {
            timerId = setTimeout(function () {
                timerId = null;
                onReady();
            }, getTimeToBoil());
        }; // запуск
    }
} 
// Чтобы setOnReady можно было вызывать в любое время, в setTimeout передаётся не onReady, а анонимная функция function() { onReady() }, которая возьмёт текущий (установленный последним) onReady из замыкания.

var coffeeMachine = new CoffeeMachine(1000, 500);
// coffeeMachine.setWaterAmount(600); // Uncaught Error: Нельзя залить воды больше, чем 500
coffeeMachine.setWaterAmount(450);
console.log(coffeeMachine.getWaterAmount()); // 450
coffeeMachine.waterAmount(50);
console.log(coffeeMachine.waterAmount()); // 50
coffeeMachine.setOnReady(function() {
    let amount = coffeeMachine.getWaterAmount();
    console.log('Готов кофе: ' + amount + ' мл');
});
coffeeMachine.run(); // => ~ через 1 мин в консоли: Готов кофе: 50 мл

console.log('До: ' + coffeeMachine.isRunning()); // До: false
coffeeMachine.run();
console.log('В процессе: ' + coffeeMachine.isRunning()); // В процессе: true
coffeeMachine.setOnReady(function() {
    let amount = coffeeMachine.getWaterAmount();
    console.log('Кофе готов: ' + amount + ' мл'); // Кофе готов: 50 мл
    console.log('После: ' + coffeeMachine.isRunning()); // После: false
});

// кофеварка v1.1 (4-2025)


#1.9.5. Расширение встроенных классов
30.4.25 - https://learn.javascript.ru/extend-natives
От встроенных классов, таких как Array, Map и других, тоже можно наследовать.
Например, в этом примере PowerArray наследуется от встроенного Array:
	// добавим один метод (можно более одного)
	class PowerArray extends Array {
		isEmpty() {
			return this.length === 0;
		}
	}
	let arr = new PowerArray(1, 2, 5, 10, 50);
	alert(arr.isEmpty()); // false
	let filteredArr = arr.filter(item => item >= 10);
	alert(filteredArr); // 10, 50
	alert(filteredArr.isEmpty()); // false
Обратите внимание на интересный момент: встроенные методы, такие как filter, map и другие возвращают новые объекты унаследованного класса PowerArray. Их внутренняя реализация такова, что для этого они используют свойство объекта constructor.
В примере выше,
	arr.constructor === PowerArray
Поэтому при вызове метода arr.filter() он внутри создаёт массив результатов, именно используя arr.constructor, а не обычный массив. Это замечательно, поскольку можно продолжать использовать методы PowerArray далее на результатах.
Более того, мы можем настроить это поведение.
При помощи специального статического геттера Symbol.species можно вернуть конструктор, который JavaScript будет использовать в filter, map и других методах для создания новых объектов.
Если бы мы хотели, чтобы методы map, filter и т. д. возвращали обычные массивы, мы могли бы вернуть Array в Symbol.species, вот так:
	class PowerArray extends Array {
		isEmpty() {
			return this.length === 0;
		}
		// встроенные методы массива будут использовать этот метод как конструктор
		static get [Symbol.species]() {
			return Array;
		}
	}
	let arr = new PowerArray(1, 2, 5, 10, 50);
	alert(arr.isEmpty()); // false
	// filter создаст новый массив, используя arr.constructor[Symbol.species] как конструктор
	let filteredArr = arr.filter(item => item >= 10);
	// filteredArr не является PowerArray, это Array
	alert(filteredArr.isEmpty()); // Error: filteredArr.isEmpty is not a function
Как вы видите, теперь .filter возвращает Array. Расширенная функциональность не будет передаваться далее.

Аналогично работают другие коллекции.
Другие коллекции, такие как Map, Set, работают аналогично. Они также используют Symbol.species.

Отсутствие статического наследования встроенных классов.
У встроенных объектов есть собственные статические методы, например Object.keys, Array.isArray и т. д.
Как мы уже знаем, встроенные классы расширяют друг друга.
Обычно, когда один класс наследует другой, то наследуются и статические методы. Это было подробно разъяснено в главе Статические свойства и методы.
Но встроенные классы – исключение. Они не наследуют статические методы друг друга.
Например, и Array, и Date наследуют от Object, так что в их экземплярах доступны методы из Object.prototype. Но Array.[[Prototype]] не ссылается на Object, поэтому нет методов Array.keys() или Date.keys().
Как видите, нет связи между Date и Object. Они независимы, только Date.prototype наследует от Object.prototype.
В этом важное отличие наследования встроенных объектов от того, что мы получаем с использованием extends.

#1.9.6. Проверка класса: "instanceof"
30.4.25 - https://learn.javascript.ru/instanceof
Оператор instanceof позволяет проверить, принадлежит ли объект указанному классу, с учётом наследования.
Такая проверка может потребоваться во многих случаях. Здесь мы используем её для создания полиморфной функции, которая интерпретирует аргументы по-разному в зависимости от их типа.

Оператор instanceof.
Синтаксис:
	obj instanceof Class // Оператор вернёт true, если obj принадлежит классу Class или наследующему от него.
Например:
	class Rabbit {}
	let rabbit = new Rabbit();
	// это объект класса Rabbit?
	alert( rabbit instanceof Rabbit ); // true
Также это работает с функциями-конструкторами:
	// вместо класса
	function Rabbit() {}
	alert( new Rabbit() instanceof Rabbit ); // true
…И для встроенных классов, таких как Array:
	let arr = [1, 2, 3];
	alert( arr instanceof Array ); // true
	alert( arr instanceof Object ); // true
Пожалуйста, обратите внимание, что arr также принадлежит классу Object, потому что Array наследует от Object.
Обычно оператор instanceof просматривает для проверки цепочку прототипов. Но это поведение может быть изменено при помощи статического метода Symbol.hasInstance.
Алгоритм работы obj instanceof Class работает примерно так:
	1. Если имеется статический метод Symbol.hasInstance, тогда вызвать его: Class[Symbol.hasInstance](obj). Он должен вернуть либо true, либо false, и это конец. Это как раз и есть возможность ручной настройки instanceof.
	Пример:
		// проверка instanceof будет полагать,
		// что всё со свойством canEat - животное Animal
		class Animal {
			static [Symbol.hasInstance](obj) {
				if (obj.canEat) return true;
			}
		}
		let obj = { canEat: true };
		alert(obj instanceof Animal); // true: вызван Animal[Symbol.hasInstance](obj)
	2. Большая часть классов не имеет метода Symbol.hasInstance. В этом случае используется стандартная логика: проверяется, равен ли Class.prototype одному из прототипов в прототипной цепочке obj.
	Другими словами, сравнивается:
		obj.__proto__ === Class.prototype?
		obj.__proto__.__proto__ === Class.prototype?
		obj.__proto__.__proto__.__proto__ === Class.prototype?
		...
		// если какой-то из ответов true - возвратить true
		// если дошли до конца цепочки - false
	В примере выше rabbit.__proto__ === Rabbit.prototype, так что результат будет получен немедленно.
	В случае с наследованием, совпадение будет на втором шаге:
		class Animal {}
		class Rabbit extends Animal {}
		let rabbit = new Rabbit();
		alert(rabbit instanceof Animal); // true
		// rabbit.__proto__ === Animal.prototype (нет совпадения)
		// rabbit.__proto__.__proto__ === Animal.prototype (совпадение!)
Кстати, есть метод objA.isPrototypeOf(objB), который возвращает true, если объект objA есть где-то в прототипной цепочке объекта objB. Так что obj instanceof Class можно перефразировать как Class.prototype.isPrototypeOf(obj).
Забавно, но сам конструктор Class не участвует в процессе проверки! Важна только цепочка прототипов Class.prototype.
Это может приводить к интересным последствиям при изменении свойства prototype после создания объекта.
Как, например, тут:
	function Rabbit() {}
	let rabbit = new Rabbit();
	// заменяем прототип
	Rabbit.prototype = {};
	// ...больше не rabbit!
	alert( rabbit instanceof Rabbit ); // false

Бонус: Object.prototype.toString возвращает тип.
Мы уже знаем, что обычные объекты преобразуются к строке как [object Object]:
	let obj = {};
	alert(obj); // [object Object]
	alert(obj.toString()); // то же самое
Так работает реализация метода toString. Но у toString имеются скрытые возможности, которые делают метод гораздо более мощным. Мы можем использовать его как расширенную версию typeof и как альтернативу instanceof.
Звучит странно? Так и есть. Давайте развеем мистику.
Согласно спецификации встроенный метод toString может быть позаимствован у объекта и вызван в контексте любого другого значения. И результат зависит от типа этого значения.
	- Для числа это будет [object Number]
	- Для булева типа это будет [object Boolean]
	- Для null: [object Null]
	- Для undefined: [object Undefined]
	- Для массивов: [object Array]
	- …и т.д. (поведение настраивается).
Давайте продемонстрируем:
	// скопируем метод toString в переменную для удобства
	let objectToString = Object.prototype.toString;
	// какой это тип?
	let arr = [];
	alert( objectToString.call(arr) ); // [object Array]
В примере мы использовали call, как описано в главе Декораторы и переадресация вызова, call/apply, чтобы выполнить функцию objectToString в контексте this=arr.
Внутри, алгоритм метода toString анализирует контекст вызова this и возвращает соответствующий результат. Больше примеров:
	let s = Object.prototype.toString;
	alert( s.call(123) ); // [object Number]
	alert( s.call(null) ); // [object Null]
	alert( s.call(alert) ); // [object Function]

Symbol.toStringTag.
Поведение метода объектов toString можно настраивать, используя специальное свойство объекта Symbol.toStringTag.
Например:
	let user = {
		[Symbol.toStringTag]: "User"
	};
	alert( {}.toString.call(user) ); // [object User]
Такое свойство есть у большей части объектов, специфичных для определённых окружений. Вот несколько примеров для браузера:
	// toStringTag для браузерного объекта и класса
	alert( window[Symbol.toStringTag]); // window
	alert( XMLHttpRequest.prototype[Symbol.toStringTag] ); // XMLHttpRequest
	alert( {}.toString.call(window) ); // [object Window]
	alert( {}.toString.call(new XMLHttpRequest()) ); // [object XMLHttpRequest]
Как вы можете видеть, результат – это значение Symbol.toStringTag (если он имеется) обёрнутое в [object ...].
В итоге мы получили «typeof на стероидах», который не только работает с примитивными типами данных, но также и со встроенными объектами, и даже может быть настроен.
Можно использовать {}.toString.call вместо instanceof для встроенных объектов, когда мы хотим получить тип в виде строки, а не просто сделать проверку.

Итого:
Давайте обобщим, какие методы для проверки типа мы знаем:
			работает для													возвращает
typeof		примитивов														строка
{}.toString	примитивов, встроенных объектов, объектов с Symbol.toStringTag	строка
instanceof	объектов														true/false

Как мы можем видеть, технически {}.toString более продвинут, чем typeof.
А оператор instanceof – отличный выбор, когда мы работаем с иерархией классов и хотим делать проверки с учётом наследования.

Задачи: 1+-
1. Странный instanceof (важность: 5)
Почему instanceof в примере ниже возвращает true? Мы же видим, что a не создан с помощью B().
	function A() {}
	function B() {}
	A.prototype = B.prototype = {};
	let a = new A();
	alert( a instanceof B ); // true
решение:
// потому что прототипы одинаковы.
Да, действительно, выглядит странно.
Но instanceof не учитывает саму функцию при проверке, а только prototype, который проверяется на совпадения в прототипной цепочке.
И в данном примере a.__proto__ == B.prototype, так что instanceof возвращает true.
Таким образом, по логике instanceof, именно prototype в действительности определяет тип, а не функция-конструктор.

#1.9.7. Примеси
1.5.25 - https://learn.javascript.ru/mixins
В JS можно наследовать только от одного объекта. Объект имеет единственный [[Prototype]]. И класс может расширить только один другой класс.
Иногда это может ограничивать нас. Например, у нас есть класс StreetSweeper и класс Bicycle, а мы хотим создать их смесь: StreetSweepingBicycle.
Или у нас есть класс User, который реализует пользователей, и класс EventEmitter, реализующий события. Мы хотели бы добавить функциональность класса EventEmitter к User, чтобы пользователи могли легко генерировать события.
Для таких случаев существуют примеси. По определению из Википедии ['https://ru.wikipedia.org/wiki/Примесь_(программирование)'], примесь – это класс, методы которого предназначены для использования в других классах, причём без наследования от примеси.
Другими словами, примесь определяет методы, которые реализуют определённое поведение. Мы не используем примесь саму по себе, а используем её, чтобы добавить функциональность другим классам.

Пример примеси.
Простейший способ реализовать примесь в JS – это создать объект с полезными методами, которые затем могут быть легко добавлены в прототип любого класса.
В примере ниже примесь sayHiMixin имеет методы, которые придают объектам класса User возможность вести разговор:
	let sayHiMixin = { // примесь
		sayHi() {
			alert(`Привет, ${this.name}`);
		},
		sayBye() {
			alert(`Пока, ${this.name}`);
		}
	};
	// использование:
	class User { 
		constructor(name) {this.name = name}
	}
	// копируем методы
	Object.assign(User.prototype, sayHiMixin);
	// теперь User может сказать Привет
	new User("Вася").sayHi(); // Привет, Вася!
Это не наследование, а просто копирование методов. Таким образом, класс User может наследовать от другого класса, но при этом также включать в себя примеси, подмешивающие другие методы, например:
	class User extends Person {	/* ... */ }
	Object.assign(User.prototype, sayHiMixin);
Примеси могут наследовать друг друга.
В примере ниже sayHiMixin наследует от sayMixin:
	let sayMixin = {
		say(phrase) {alert(phrase)}
	};
	let sayHiMixin = {
		__proto__: sayMixin, // (или мы можем использовать Object.setPrototypeOf для задания прототипа)
		sayHi() { // вызываем метод родителя
			super.say(`Привет, ${this.name}`); // (*)
		},
		sayBye() {
			super.say(`Пока, ${this.name}`); // (*)
		}
	};
	class User {
		constructor(name) {this.name = name}
	}
	Object.assign(User.prototype, sayHiMixin); // копируем методы
	// теперь User может сказать Привет
	new User("Вася").sayHi(); // Привет, Вася!
Обратим внимание, что при вызове родительского метода super.say() из sayHiMixin (строки, помеченные (*)) этот метод ищется в прототипе самой примеси, а не класса. Это связано с тем, что методы sayHi и sayBye были изначально созданы в объекте sayHiMixin. Несмотря на то, что они скопированы, их внутреннее свойство [[HomeObject]] ссылается на sayHiMixin, как показано на картинке выше.
Так как super ищет родительские методы в [[HomeObject]].[[Prototype]], это означает, что он ищет sayHiMixin.[[Prototype]].

EventMixin.
Многие объекты в браузерной разработке (и не только) обладают важной способностью – они могут генерировать события. События – отличный способ передачи информации всем, кто в ней заинтересован. Давайте создадим примесь, которая позволит легко добавлять функциональность по работе с событиями любым классам/объектам.
Примесь добавит метод .trigger(name, [...data]) для генерации события. Аргумент name – это имя события, за которым могут следовать дополнительные аргументы с данными для события.
Также будет добавлен метод .on(name, handler), который назначает обработчик для события с заданным именем. Обработчик будет вызван, когда произойдёт событие с указанным именем name, и получит данные из .trigger.
…и метод .off(name, handler), который удаляет обработчик указанного события.
После того, как все методы примеси будут добавлены, объект user сможет сгенерировать событие "login" после входа пользователя в личный кабинет. А другой объект, к примеру, calendar сможет использовать это событие, чтобы показывать зашедшему пользователю актуальный для него календарь.
Или menu может генерировать событие "select", когда элемент меню выбран, а другие объекты могут назначать обработчики, чтобы реагировать на это событие, и т.п.
Вот код примеси:
	let eventMixin = {
		/** Подписаться на событие, использование: menu.on('select', function(item) { ... } */
		on(eventName, handler) {
			if (!this._eventHandlers) this._eventHandlers = {};
			if (!this._eventHandlers[eventName]) {
				this._eventHandlers[eventName] = [];
			}
			this._eventHandlers[eventName].push(handler);
		},
		/** Отменить подписку, использование: menu.off('select', handler) */
		off(eventName, handler) {
			let handlers = this._eventHandlers?.[eventName];
			if (!handlers) return;
			for (let i = 0; i < handlers.length; i++) {
				if (handlers[i] === handler) {
					handlers.splice(i--, 1);
				}
			}
		},
		/** Сгенерировать событие с указанным именем и данными this.trigger('select', data1, data2); */
		trigger(eventName, ...args) {
			if (!this._eventHandlers?.[eventName]) {
				return; // обработчиков для этого события нет
			}
			// вызовем обработчики
			this._eventHandlers[eventName].forEach(handler => handler.apply(this, args));
		}
	};
Итак, у нас есть 3 метода:
	1. .on(eventName, handler) – назначает функцию handler, чтобы обработать событие с заданным именем.
		Технически существует свойство _eventHandlers, в котором хранится массив обработчиков для каждого имени события, и оно просто добавляет это событие в список.
	2. .off(eventName, handler) – убирает функцию из списка обработчиков.
	3. .trigger(eventName, ...args) – генерирует событие: все назначенные обработчики из _eventHandlers[eventName] вызываются, и ...args передаются им в качестве аргументов.
Использование:
	// Создадим класс
	class Menu {
		choose(value) {
			this.trigger("select", value);
		}
	}
	Object.assign(Menu.prototype, eventMixin); // Добавим примесь с методами для событий
	let menu = new Menu();
	menu.on("select", value => alert(`Выбранное значение: ${value}`)); // Добавим обработчик, который будет вызван при событии "select":
	// Генерирует событие => обработчик выше запускается и выводит:
	menu.choose("123"); // Выбранное значение: 123
Теперь если у нас есть код, заинтересованный в событии "select", то он может слушать его с помощью menu.on(...).
А eventMixin позволяет легко добавить такое поведение в любой класс без вмешательства в цепочку наследования.

Итого:
Примесь – общий термин в объектно-ориентированном программировании: класс, который содержит в себе методы для других классов.
Некоторые другие языки допускают множественное наследование. JS не поддерживает множественное наследование, но с помощью примесей мы можем реализовать нечто похожее, скопировав методы в прототип.
Мы можем использовать примеси для расширения функциональности классов, например, для обработки событий, как мы сделали это выше.
С примесями могут возникнуть конфликты, если они перезаписывают существующие методы класса. Стоит помнить об этом и быть внимательнее при выборе имён для методов примеси, чтобы их избежать.


#1.10. Обработка ошибок
#1.10.1. Обработка ошибок, "try..catch"
5-6.5.25 - https://learn.javascript.ru/try-catch
Неважно, насколько мы хороши в программировании, иногда наши скрипты содержат ошибки. Они могут возникать из-за наших промахов, неожиданного ввода пользователя, неправильного ответа сервера и по тысяче других причин.
Обычно скрипт в случае ошибки "падает" (сразу же останавливается), с выводом ошибки в консоль.
Но есть синтаксическая конструкция try..catch, которая позволяет «ловить» ошибки и вместо падения делать что-то более осмысленное.

Синтаксис try..catch
Конструкция try..catch состоит из двух основных блоков: try, и затем catch:
	try {
		// код...
	} catch (err) {
		// обработка ошибки
	}
Работает она так:
	1. Сначала выполняется код внутри блока try {...}.
	2. Если в нём нет ошибок, то блок catch(err) игнорируется: выполнение доходит до конца try и потом далее, полностью пропуская catch.
	3. Если же в нём возникает ошибка, то выполнение try прерывается, и поток управления переходит в начало catch(err). Переменная err (можно использовать любое имя) содержит объект ошибки с подробной информацией о произошедшем.
Таким образом, при ошибке в блоке try {…} скрипт не падает, и мы получаем возможность обработать ошибку внутри catch.
Давайте рассмотрим примеры.
- Пример без ошибок: выведет alert (1) и (2):
	try {
		alert('Начало блока try');  // (1) <--
		// ...код без ошибок
		alert('Конец блока try');   // (2) <--
	} catch(err) {
		alert('Catch игнорируется, так как нет ошибок'); // (3)
	}
- Пример с ошибками: выведет (1) и (3):
	try {
		alert('Начало блока try');  // (1) <--
		lalala; // ошибка, переменная не определена!
		alert('Конец блока try (никогда не выполнится)');  // (2)
	} catch(err) {
		alert(`Возникла ошибка!`); // (3) <--
	}

try..catch работает только для ошибок, возникающих во время выполнения кода.
Чтобы try..catch работал, код должен быть выполнимым. Другими словами, это должен быть корректный JS-код.
Он не сработает, если код синтаксически неверен, например, содержит несовпадающее количество фигурных скобок:
	/*try {
	  {{{{{{{{{{{{
	} catch(e) {
	  alert("Движок не может понять этот код, он некорректен");
	}*/
JS-движок сначала читает код, а затем исполняет его. Ошибки, которые возникают во время фазы чтения, называются ошибками парсинга. Их нельзя обработать (изнутри этого кода), потому что движок не понимает код.
Таким образом, try..catch может обрабатывать только ошибки, которые возникают в корректном коде. Такие ошибки называют "ошибками во время выполнения", а иногда "исключениями".

try..catch работает синхронно.
Исключение, которое произойдёт в коде, запланированном "на будущее", например в setTimeout, try..catch не поймает:
	try {
		setTimeout(function() {
			noSuchVariable; // скрипт упадёт тут
		}, 1000);
	} catch (e) {
		alert( "не сработает" );
	}
Это потому, что функция выполняется позже, когда движок уже покинул конструкцию try..catch.
Чтобы поймать исключение внутри запланированной функции, try..catch должен находиться внутри самой этой функции:
	setTimeout(function() {
		try {
			noSuchVariable; // try..catch обрабатывает ошибку!
		} catch {
			alert( "ошибка поймана!" );
		}
	}, 1000);

Объект ошибки.
Когда возникает ошибка, JS генерирует объект, содержащий её детали. Затем этот объект передаётся как аргумент в блок catch:
	try {
		// ...
	} catch(err) { // <-- объект ошибки, можно использовать другое название вместо err
		// ...
	}
Для всех встроенных ошибок этот объект имеет два основных свойства:
	name - Имя ошибки. Например, для неопределённой переменной это "ReferenceError".
	message - Текстовое сообщение о деталях ошибки.
В большинстве окружений доступны и другие, нестандартные свойства. Одно из самых широко используемых и поддерживаемых – это:
	stack - Текущий стек вызова: строка, содержащая информацию о последовательности вложенных вызовов, которые привели к ошибке. Используется в целях отладки.
Например:
	try {
		lalala; // ошибка, переменная не определена
	} catch(err) {
		alert(err.name); // ReferenceError
		alert(err.message); // lalala is not defined
		alert(err.stack); // ReferenceError: lalala is not defined at (...стек вызовов)
		// Можем также просто вывести ошибку целиком
		// Ошибка приводится к строке вида "name: message"
		alert(err); // ReferenceError: lalala is not defined
	}

Блок catch без переменной.
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Если нам не нужны детали ошибки, в catch можно её пропустить:
	try {
		// ...
	} catch { //  <-- без (err)
		// ...
	}

Использование try..catch.
Давайте рассмотрим реальные случаи использования try..catch.
Как мы уже знаем, JS поддерживает метод JSON.parse(str) для чтения JSON ['https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/JSON/parse'].
Обычно он используется для декодирования данных, полученных по сети, от сервера или из другого источника.
Мы получаем их и вызываем JSON.parse вот так:
	let json = '{"name":"John", "age": 30}'; // данные с сервера
	let user = JSON.parse(json); // преобразовали текстовое представление в JS-объект
	// теперь user - объект со свойствами из строки
	alert( user.name ); // John
	alert( user.age );  // 30
Вы можете найти более детальную информацию о JSON в главе Формат JSON, метод toJSON ['https://learn.javascript.ru/json'].
Если json некорректен, JSON.parse генерирует ошибку, то есть скрипт падает.
Устроит ли нас такое поведение? Конечно нет!
Получается, что если вдруг что-то не так с данными, то посетитель никогда (если, конечно, не откроет консоль) об этом не узнает. А люди очень не любят, когда что-то "просто падает" без всякого сообщения об ошибке.
Давайте используем try..catch для обработки ошибки:
	let json = "{ некорректный JSON }";
	try {
		let user = JSON.parse(json); // <-- тут возникает ошибка...
		alert( user.name ); // не сработает
	} catch (e) {
		// ...выполнение прыгает сюда
		alert( "Извините, в данных ошибка, мы попробуем получить их ещё раз." );
		alert( e.name );
		alert( e.message );
	}
Здесь мы используем блок catch только для вывода сообщения, но мы также можем сделать гораздо больше: отправить новый сетевой запрос, предложить посетителю альтернативный способ, отослать информацию об ошибке на сервер для логирования, … Всё лучше, чем просто "падение".

Генерация собственных ошибок.
Что если json синтаксически корректен, но не содержит необходимого свойства name?
Например, так:
	let json = '{ "age": 30 }'; // данные неполны
	try {
		let user = JSON.parse(json); // <-- выполнится без ошибок
		alert( user.name ); // нет свойства name!
	} catch (e) {
		alert( "не выполнится" );
	}
Здесь JSON.parse выполнится без ошибок, но на самом деле отсутствие свойства name для нас ошибка.
Для того, чтобы унифицировать обработку ошибок, мы воспользуемся оператором throw.

Оператор throw генерирует ошибку.
Синтаксис:
	throw <объект ошибки>
Технически в качестве объекта ошибки можно передать что угодно. Это может быть даже примитив, число или строка, но всё же лучше, чтобы это был объект, желательно со свойствами name и message (для совместимости со встроенными ошибками).
В JS есть множество встроенных конструкторов для стандартных ошибок: Error, SyntaxError, ReferenceError, TypeError и другие. Можно использовать и их для создания объектов ошибки.
Их синтаксис:
	let error = new Error(message);
	// или
	let error = new SyntaxError(message);
	let error = new ReferenceError(message);
	// ...
Для встроенных ошибок (не для любых объектов, только для ошибок), свойство name – это в точности имя конструктора. А свойство message берётся из аргумента.
Например:
	let error = new Error("Ого, ошибка! o_O");
	alert(error.name); // Error
	alert(error.message); // Ого, ошибка! o_O
Давайте посмотрим, какую ошибку генерирует JSON.parse:
	try {
		JSON.parse("{ некорректный json o_O }");
	} catch(e) {
		alert(e.name); // SyntaxError
		alert(e.message); // Expected property name or '}' in JSON at position 2 (line 1 column 3)
	}
Как мы видим, это SyntaxError.
В нашем случае отсутствие свойства name – это ошибка, ведь пользователи должны иметь имена.
Сгенерируем её:
	let json = '{ "age": 30 }'; // данные неполны
	try {
		let user = JSON.parse(json); // <-- выполнится без ошибок
		if (!user.name) throw new SyntaxError("Данные неполны: нет имени"); // (*)
		alert( user.name );
	} catch(e) {
		alert( "JSON Error: " + e.message ); // JSON Error: Данные неполны: нет имени
	}
В строке (*) оператор throw генерирует ошибку SyntaxError с сообщением message. Точно такого же вида, как генерирует сам JS. Выполнение блока try немедленно останавливается, и поток управления прыгает в catch.
Теперь блок catch становится единственным местом для обработки всех ошибок: и для JSON.parse и для других случаев.

Проброс исключения.
В примере выше мы использовали try..catch для обработки некорректных данных. А что, если в блоке try {...} возникнет другая неожиданная ошибка? Например, программная (неопределённая переменная) или какая-то ещё, а не ошибка, связанная с некорректными данными.
Пример:
	let json = '{ "age": 30 }'; // данные неполны
	try {
		user = JSON.parse(json); // <-- забыл добавить "let" перед user
		// ...
	} catch(err) {
		alert("JSON Error: " + err); // JSON Error: ReferenceError: user is not defined (не JSON ошибка на самом деле)
	}
Конечно, возможно все! Программисты совершают ошибки. Даже в утилитах с открытым исходным кодом, используемых миллионами людей на протяжении десятилетий – вдруг может быть обнаружена ошибка, которая приводит к ужасным взломам.
В нашем случае try..catch предназначен для выявления ошибок, связанных с некорректными данными. Но по своей природе catch получает все свои ошибки из try. Здесь он получает неожиданную ошибку, но всё также показывает то же самое сообщение "JSON Error". Это неправильно и затрудняет отладку кода.
К счастью, мы можем выяснить, какую ошибку мы получили, например, по её свойству name:
	try {
		user = { /*...*/ };
	} catch(e) {
		alert(e.name); // "ReferenceError" из-за неопределённой переменной
	}
Есть простое правило:
Блок catch должен обрабатывать только те ошибки, которые ему известны, и "пробрасывать" все остальные.
Техника "проброс исключения" выглядит так:
	1. Блок catch получает все ошибки.
	2. В блоке catch(err) {...} мы анализируем объект ошибки err.
	3. Если мы не знаем как её обработать, тогда делаем throw err.
В коде ниже мы используем проброс исключения, catch обрабатывает только SyntaxError:
	let json = '{ "age": 30 }'; // данные неполны
	try {
		let user = JSON.parse(json);
		if (!user.name) throw new SyntaxError("Данные неполны: нет имени");
		blabla(); // неожиданная ошибка
		alert( user.name );
	} catch(e) {
		if (e.name == "SyntaxError") {
			alert( "JSON Error: " + e.message );
		} else {
			throw e; // проброс (*)
		}
	}
Ошибка в строке (*) из блока catch выпадает наружу и может быть поймана другой внешней конструкцией try..catch (если есть), или убьёт скрипт.
Таким образом, блок catch фактически обрабатывает только те ошибки, с которыми он знает, как справляться, и пропускает остальные.
Пример ниже демонстрирует, как такие ошибки могут быть пойманы с помощью ещё одного уровня try..catch:
	function readData() {
		let json = '{ "age": 30 }';
		try {
			// ...
			blabla(); // ошибка!
		} catch (e) {
			// ...
			if (e.name != 'SyntaxError') throw e; // проброс исключения (не знаю как это обработать)
		}
	}
	try {
		readData();
	} catch (e) {
		alert( "Внешний catch поймал: " + e ); // поймал!
	}
Здесь readData знает только, как обработать SyntaxError, тогда как внешний блок try..catch знает, как обработать всё.

try..catch..finally.
Конструкция try..catch может содержать ещё одну секцию: finally.
Если секция есть, то она выполняется в любом случае:
	после try, если не было ошибок,
	после catch, если ошибки были.
Расширенный синтаксис выглядит следующим образом:
	try {
		/*... пробуем выполнить код...*/
	} catch(e) {
		/*... обрабатываем ошибки ...*/
	} finally {
		/*... выполняем всегда ...*/
	}
Попробуйте запустить такой код:
	try {
		alert( 'try' );
		if (confirm('Сгенерировать ошибку?')) BAD_CODE();
	} catch (e) {
		alert( 'catch' );
	} finally {
		alert( 'finally' );
	}
У кода есть два пути выполнения:
Если вы ответите на вопрос «Сгенерировать ошибку?» утвердительно, то try -> catch -> finally.
Если ответите отрицательно, то try -> finally.
Секцию finally часто используют, когда мы начали что-то делать и хотим завершить это вне зависимости от того, будет ошибка или нет.
Например, мы хотим измерить время, которое занимает функция чисел Фибоначчи fib(n). Естественно, мы можем начать измерения до того, как функция начнёт выполняться и закончить после. Но что делать, если при вызове функции возникла ошибка? В частности, реализация fib(n) в коде ниже возвращает ошибку для отрицательных и для нецелых чисел.
Секция finally отлично подходит для завершения измерений несмотря ни на что.
Здесь finally гарантирует, что время будет измерено корректно в обеих ситуациях – и в случае успешного завершения fib и в случае ошибки:
	let num = +prompt("Введите положительное целое число?", 35)
	let diff, result;
	function fib(n) {
		if (n < 0 || Math.trunc(n) != n) {
			throw new Error("Должно быть целое неотрицательное число");
		}
		return n <= 1 ? n : fib(n - 1) + fib(n - 2);
	}
	let start = Date.now();
	try {
		result = fib(num);
	} catch (e) {
		result = 0;
	} finally {
		diff = Date.now() - start;
	}
	alert(result || "возникла ошибка");
	alert( `Выполнение заняло ${diff}ms` );
Вы можете это проверить, запустив этот код и введя 35 в prompt – код завершится нормально, finally выполнится после try. А затем введите -1 – незамедлительно произойдёт ошибка, выполнение займёт 0ms. Оба измерения выполняются корректно.
Другими словами, неважно как завершилась функция: через return или throw. Секция finally срабатывает в обоих случаях.

Переменные внутри try..catch..finally локальны.
Обратите внимание, что переменные result и diff в коде выше объявлены до try..catch.
Если переменную объявить в блоке, например, в try, то она не будет доступна после него.

finally и return.
Блок finally срабатывает при любом выходе из try..catch, в том числе и return.
В примере ниже из try происходит return, но finally получает управление до того, как контроль возвращается во внешний код.
	function func() {
		try {
			return 1;
		} catch (e) {
			/* ... */
		} finally {
			alert( 'finally' );
		}
	}
	alert( func() ); // сначала срабатывает alert из finally, а затем этот код

try..finally.
Конструкция try..finally без секции catch также полезна. Мы применяем её, когда не хотим здесь обрабатывать ошибки (пусть выпадут), но хотим быть уверены, что начатые процессы завершились.
	function func() {
		// начать делать что-то, что требует завершения (например, измерения)
		try {
			// ...
		} finally {
			// завершить это, даже если все упадёт
		}
	}
В приведённом выше коде ошибка всегда выпадает наружу, потому что тут нет блока catch. Но finally отрабатывает до того, как поток управления выйдет из функции.

Глобальный catch.
// Зависит от окружения. Информация из данной секции не является частью языка JavaScript.
Давайте представим, что произошла фатальная ошибка (программная или что-то ещё ужасное) снаружи try..catch, и скрипт упал.
Существует ли способ отреагировать на такие ситуации? Мы можем захотеть залогировать ошибку, показать что-то пользователю (обычно они не видят сообщение об ошибке) и т.д.
Такого способа нет в спецификации, но обычно окружения предоставляют его, потому что это весьма полезно. Например, в Node.js для этого есть process.on("uncaughtException") ['https://nodejs.org/api/process.html#process_event_uncaughtexception']. А в браузере мы можем присвоить функцию специальному свойству window.onerror ['https://developer.mozilla.org/ru/docs/Web/API/GlobalEventHandlers/onerror'], которая будет вызвана в случае необработанной ошибки.
Синтаксис:
	window.onerror = function(message, url, line, col, error) {
		// ...
	};
где: message // Сообщение об ошибке.
	url // URL скрипта, в котором произошла ошибка.
	line, col // Номера строки и столбца, в которых произошла ошибка.
	error // Объект ошибки.
Пример:
<script>
	window.onerror = function(message, url, line, col, error) {
		alert(`${message}\n В ${line}:${col} на ${url}`);
	};
	function readData() {
		badFunc(); // Ой, что-то пошло не так!
	}
	readData();
</script>
Роль глобального обработчика window.onerror обычно заключается не в восстановлении выполнения скрипта – это скорее всего невозможно в случае программной ошибки, а в отправке сообщения об ошибке разработчикам.
Существуют также веб-сервисы, которые предоставляют логирование ошибок для таких случаев, такие как https://www.muscula.com.
Они работают так:
	1. Мы регистрируемся в сервисе и получаем небольшой JS-скрипт (или URL скрипта) от них для вставки на страницы.
	2. Этот JS-скрипт ставит свою функцию window.onerror.
	3. Когда возникает ошибка, она выполняется и отправляет сетевой запрос с информацией о ней в сервис.
	4. Мы можем войти в веб-интерфейс сервиса и увидеть ошибки.

Итого:
Конструкция try..catch позволяет обрабатывать ошибки во время исполнения кода. Она позволяет запустить код и перехватить ошибки, которые могут в нём возникнуть.
Синтаксис:
	try {
		// исполняем код
	} catch(err) {
		// если случилась ошибка, прыгаем сюда
		// err - это объект ошибки
	} finally {
		// выполняется всегда после try/catch
	}
Секций catch или finally может не быть, то есть более короткие конструкции try..catch и try..finally также корректны.
Объекты ошибок содержат следующие свойства:
	message – понятное человеку сообщение.
	name – строка с именем ошибки (имя конструктора ошибки).
	stack (нестандартное, но хорошо поддерживается) – стек на момент ошибки.
Если объект ошибки не нужен, мы можем пропустить его, используя catch вместо catch(err).
Мы можем также генерировать собственные ошибки, используя оператор throw. Аргументом throw может быть что угодно, но обычно это объект ошибки, наследуемый от встроенного класса Error. 
Проброс исключения – это очень важный приём обработки ошибок: блок catch обычно ожидает и знает, как обработать определённый тип ошибок, поэтому он должен пробрасывать дальше ошибки, о которых он не знает.
Даже если у нас нет try..catch, большинство сред позволяют настроить глобальный обработчик ошибок, чтобы ловить ошибки, которые "выпадают наружу". В браузере это window.onerror.

Задачи: 1-
1. Finally или просто код? (важность: 5)
Сравните два фрагмента кода.
1.1. Первый использует finally для выполнения кода после try..catch:
	try {
		начать работу
		работать
	} catch (e) {
		обработать ошибку
	} finally {
		очистить рабочее пространство
	}
1.2. Второй фрагмент просто ставит очистку после try..catch:
	try {
		начать работу
		работать
	} catch (e) {
		обработать ошибку
	}
	очистить рабочее пространство
Нам определённо нужна очистка после работы, неважно возникли ошибки или нет.
Есть ли здесь преимущество в использовании finally или оба фрагмента кода одинаковы? // нет
Если такое преимущество есть, то дайте пример, когда оно проявляется.
решение:
	Разница в поведении станет очевидной, если рассмотреть код внутри функции.
	Поведение будет различным, если управление каким-то образом выпрыгнет из try..catch.
	Например, когда есть return внутри try..catch. Секция finally работает в любом случае при любом выходе из try..catch, даже через return: сразу после того как try..catch выполнится, но до того, как вызывающий код получит контроль.
		function f() {
			try {
				alert('начало');
				return "result";
			} catch (e) {
				/// ...
			} finally {
				alert('очистка!');
			}
		}
		f(); // очистка!
	…Или когда есть throw, например, как здесь:
		function f() {
			try {
				alert('начало');
				throw new Error("ошибка");
			} catch (e) {
				// ...
				if("не могу обработать ошибку") throw e;
			} finally {
				alert('очистка!')
			}
		}
		f(); // очистка!
	Именно finally гарантирует очистку. Если мы просто поместим код в конце f, то он не выполнится в описанных ситуациях.

#1.10.2. Пользовательские ошибки, расширение Error
8.5.25 - https://learn.javascript.ru/custom-errors
Когда что-то разрабатываем, то нам часто необходимы собственные классы ошибок для разных вещей, которые могут пойти не так в наших задачах. Для ошибок при работе с сетью может понадобиться HttpError, для операций с базой данных DbError, для поиска – NotFoundError и т.д.
Наши ошибки должны поддерживать базовые свойства, такие как message, name и, желательно, stack. Но также они могут иметь свои собственные свойства. Например, объекты HttpError могут иметь свойство statusCode со значениями 404, 403 или 500.
JS позволяет вызывать throw с любыми аргументами, то есть технически наши классы ошибок не нуждаются в наследовании от Error. Но если использовать наследование, то появляется возможность идентификации объектов ошибок посредством obj instanceof Error. Так что лучше применять наследование.
По мере роста приложения, наши собственные ошибки образуют иерархию, например, HttpTimeoutError может наследовать от HttpError и так далее.

Расширение Error.
В качестве примера рассмотрим функцию readUser(json), которая должна читать данные пользователя в формате JSON.
Пример того, как может выглядеть корректный json:
	let json = `{ "name": "John", "age": 30 }`;
Внутри будем использовать JSON.parse. При получении некорректного json он будет генерировать ошибку SyntaxError. Но даже если json синтаксически верен, то это не значит, что это будет корректный пользователь, верно? Могут быть пропущены необходимые данные. Например, могут отсутствовать свойства name и age, которые являются необходимыми для наших пользователей.
Наша функция readUser(json) будет не только читать JSON-данные, но и проверять (валидировать) их. Если необходимые поля отсутствуют или данные в неверном формате, то это будет ошибкой. Но не синтаксической ошибкой SyntaxError, потому что данные синтаксически корректны. Это будет другая ошибка.
Назовём её ошибкой валидации ValidationError и создадим для неё класс. Ошибка этого вида должна содержать информацию о поле, которое является источником ошибки.
Наш класс ValidationError должен наследовать от встроенного класса Error.
Класс Error встроенный, вот его примерный код, просто чтобы мы понимали, что расширяем:
	class Error { // Псевдокод встроенного класса Error, определённого самим JS
		constructor(message) {
			this.message = message;
			this.name = "Error"; // (разные имена для разных встроенных классов ошибок)
			this.stack = <стек вызовов>; // нестандартное свойство, но обычно поддерживается
		}
	}
Теперь давайте унаследуем от него ValidationError и попробуем новый класс в действии:
	class ValidationError extends Error {
		constructor(message) {
			super(message); // (1)
			this.name = "ValidationError"; // (2)
		}
	}
	function test() {
		throw new ValidationError("Упс!");
	}
	try {
		test();
	} catch(err) {
		alert(err.message); // Упс!
		alert(err.name); // ValidationError
		alert(err.stack); // список вложенных вызовов с номерами строк для каждого
	}
Обратите внимание: в строке (1) вызываем родительский конструктор. JS требует от нас вызова super в дочернем конструкторе, так что это обязательно. Родительский конструктор устанавливает свойство message. Родительский конструктор также устанавливает свойство name для "Error", поэтому в строке (2) мы сбрасываем его на правильное значение.
Попробуем использовать его в readUser(json):
	class ValidationError extends Error {
		constructor(message) {
			super(message);
			this.name = "ValidationError";
		}
	}
	// Использование
	function readUser(json) {
		let user = JSON.parse(json);
		if (!user.age) throw new ValidationError("Нет поля: age");
		if (!user.name) throw new ValidationError("Нет поля: name");
		return user;
	}
	// Рабочий пример с try..catch
	try {
		let user = readUser('{ "age": 25 }');
	} catch (err) {
		if (err instanceof ValidationError) {
			alert("Некорректные данные: " + err.message); // Некорректные данные: Нет поля: name
		} else if (err instanceof SyntaxError) { // (*)
			alert("JSON Ошибка Синтаксиса: " + err.message);
		} else {
			throw err; // неизвестная ошибка, пробросить исключение (**)
		}
	}
Блок try..catch в коде выше обрабатывает и нашу ValidationError, и встроенную SyntaxError из JSON.parse.
Обратите внимание, как мы используем instanceof для проверки конкретного типа ошибки в строке (*).
Мы можем также проверить тип, используя err.name:
	{ // ...
	// вместо (err instanceof SyntaxError)
	} else if (err.name == "SyntaxError") { // (*)
	} // ...
Версия с instanceof гораздо лучше, потому что в будущем мы собираемся расширить ValidationError, сделав его подтипы, такие как PropertyRequiredError. И проверка instanceof продолжит работать для новых наследованных классов. Так что это на будущее.
Также важно, что если catch встречает неизвестную ошибку, то он пробрасывает её в строке (**). Блок catch знает, только как обрабатывать ошибки валидации и синтаксические ошибки, а другие виды ошибок (из-за опечаток в коде и другие непонятные) он должен выпустить наружу.

Дальнейшее наследование.
Класс ValidationError является слишком общим. Много что может пойти не так. Свойство может отсутствовать или иметь неверный формат (например, строка как значение возраста age). Поэтому для отсутствующих свойств сделаем более конкретный класс PropertyRequiredError. Он будет нести дополнительную информацию о свойстве, которое отсутствует.
	class ValidationError extends Error {
		constructor(message) {
			super(message);
			this.name = "ValidationError";
		}
	}
	class PropertyRequiredError extends ValidationError {
		constructor(property) {
			super("Нет свойства: " + property);
			this.name = "PropertyRequiredError";
			this.property = property;
		}
	}
	// Применение
	function readUser(json) {
		let user = JSON.parse(json);
		if (!user.age) throw new PropertyRequiredError("age");
		if (!user.name) throw new PropertyRequiredError("name");
		return user;
	}
	// Рабочий пример с try..catch
	try {
		let user = readUser('{ "age": 25 }');
	} catch (err) {
		if (err instanceof ValidationError) {
			alert("Неверные данные: " + err.message); // Неверные данные: Нет свойства: name
			alert(err.name); // PropertyRequiredError
			alert(err.property); // name
		} else if (err instanceof SyntaxError) {
			alert("Ошибка синтаксиса JSON: " + err.message);
		} else {
			throw err; // неизвестная ошибка, повторно выбросит исключение
		}
	}
Новый класс PropertyRequiredError очень просто использовать: необходимо указать только имя свойства new PropertyRequiredError(property). Сообщение для пользователя message генерируется конструктором.
Обратите внимание, что свойство this.name в конструкторе PropertyRequiredError снова присвоено вручную. Правда, немного утомительно – присваивать this.name = <class name> в каждом классе пользовательской ошибки. Можно этого избежать, если сделать наш собственный базовый класс ошибки, который будет ставить this.name = this.constructor.name. И затем наследовать все ошибки уже от него.
Давайте назовём его MyError.
Вот упрощённый код с MyError и другими пользовательскими классами ошибок:
	class MyError extends Error {
		constructor(message) {
			super(message);
			this.name = this.constructor.name;
		}
	}
	class ValidationError extends MyError { }
	class PropertyRequiredError extends ValidationError {
		constructor(property) {
			super("Нет свойства: " + property);
			this.property = property;
		}
	}
	// name корректное
	alert( new PropertyRequiredError("field").name ); // PropertyRequiredError
Теперь пользовательские ошибки стали намного короче, особенно ValidationError, так как мы избавились от строки "this.name = ..." в конструкторе.

Обёртывание исключений.
Назначение функции readUser в приведённом выше коде – это чтение данных пользователя. В процессе могут возникнуть различные виды ошибок. Сейчас у нас есть SyntaxError и ValidationError, но в будущем функция readUser может расшириться и, возможно, генерировать другие виды ошибок.
Код, который вызывает readUser, должен обрабатывать эти ошибки.
Сейчас в нём используются проверки if в блоке catch, которые проверяют класс и обрабатывают известные ошибки и пробрасывают дальше неизвестные. Но если функция readUser генерирует несколько видов ошибок, то мы должны спросить себя: действительно ли мы хотим проверять все типы ошибок поодиночке во всех местах в коде, где вызывается readUser?
Часто ответ "Нет": внешний код хочет быть на один уровень выше всего этого. Он хочет иметь какую-то обобщённую ошибку чтения данных. Почему именно это произошло – часто не имеет значения (об этом говорится в сообщении об ошибке). Или даже лучше, если есть способ получить подробности об ошибке, но только если нам это нужно.
Итак, давайте создадим новый класс ReadError для представления таких ошибок. Если ошибка возникает внутри readUser, мы её перехватим и сгенерируем ReadError. Мы также сохраним ссылку на исходную ошибку в свойстве cause. Тогда внешний код должен будет только проверить наличие ReadError.
Этот код определяет ошибку ReadError и демонстрирует её использование в readUserи try..catch:
	class ReadError extends Error {
		constructor(message, cause) {
			super(message);
			this.cause = cause;
			this.name = 'ReadError';
		}
	}
	class ValidationError extends Error { /*...*/ }
	class PropertyRequiredError extends ValidationError { /* ... */ }
	function validateUser(user) {
		if (!user.age) throw new PropertyRequiredError("age");
		if (!user.name) throw new PropertyRequiredError("name");
	}
	function readUser(json) {
		let user;
		try {
			user = JSON.parse(json);
		} catch (err) {
			if (err instanceof SyntaxError) {
				throw new ReadError("Синтаксическая ошибка", err);
			} else {
				throw err;
			}
		}
		try {
			validateUser(user);
		} catch (err) {
			if (err instanceof ValidationError) {
				throw new ReadError("Ошибка валидации", err);
			} else {
				throw err;
			}
		}
	}
	try {
		readUser('{bad json}');
	} catch (e) {
		if (e instanceof ReadError) {
			alert(e);
			// Исходная ошибка: SyntaxError:Unexpected token b in JSON at position 1
			alert("Исходная ошибка: " + e.cause);
		} else {
			throw e;
		}
	}
В приведённом выше коде readUser работает так, как описано – функция распознаёт синтаксические ошибки и ошибки валидации и выдаёт вместо них ошибки ReadError (неизвестные ошибки, как обычно, пробрасываются).
Внешний код проверяет только instanceof ReadError. Не нужно перечислять все возможные типы ошибок
Этот подход называется "обёртывание исключений", потому что мы берём "исключения низкого уровня" и оборачиваем их в ReadError, который является более абстрактным и более удобным для использования в вызывающем коде. Такой подход широко используется в ООП.

Итого:
- Мы можем наследовать свои классы ошибок от Error и других встроенных классов ошибок, но нужно позаботиться о свойстве name и не забыть вызвать super.
- Мы можем использовать instanceof для проверки типа ошибок. Это также работает с наследованием. Но иногда у нас объект ошибки, возникшей в сторонней библиотеке, и нет простого способа получить класс. Тогда для проверки типа ошибки можно использовать свойство name.
- Обёртывание исключений является распространённой техникой: функция ловит низкоуровневые исключения и создаёт одно «высокоуровневое» исключение вместо разных низкоуровневых. Иногда низкоуровневые исключения становятся свойствами этого объекта, как err.cause в примерах выше, но это не обязательно.

Задачи: 1+
1. Наследование от SyntaxError (важность: 5)
Создайте класс FormatError, который наследует от встроенного класса SyntaxError.
Класс должен поддерживать свойства message, name и stack.
Пример использования:
	let err = new FormatError("ошибка форматирования");
	alert( err.message ); // ошибка форматирования
	alert( err.name ); // FormatError
	alert( err.stack ); // stack
	alert( err instanceof FormatError ); // true
	alert( err instanceof SyntaxError ); // true (потому что наследует от SyntaxError)
решение:
	class FormatError extends SyntaxError {
		constructor(message) {
			super(message);
			this.name = "FormatError";
		}
	}
	let err = new FormatError("ошибка форматирования");
	console.log( err.message ); // ошибка форматирования
	console.log( err.name ); // FormatError
	console.log( err.stack ); // FormatError: ошибка форматирования at main1-7-9.js:275:11
	console.log( err instanceof FormatError ); // true
	console.log( err instanceof SyntaxError ); // true (потому что наследует от SyntaxError)

#1.11. Промисы, async/await
#1.11.1. Введение: колбэки
9.5.25 - https://learn.javascript.ru/callbacks
Введение: колбэки.
/**В примерах мы будем использовать браузерные методы
Для демонстрации использования колбэков, промисов и других абстрактных понятий мы будем использовать некоторые браузерные методы: в частности, загрузку скриптов и выполнение простых манипуляций с документом. Если вы не знакомы с этими методами, и их использование в примерах вызывает у вас недоумение, возможно, вам стоит прочитать несколько глав из следующей части учебника. Тем не менее, мы все равно попытаемся максимально доходчиво всё разъяснить. Ничего особо сложного в плане браузера не будет.*/

Многие действия в JS асинхронные.
Например, рассмотрим функцию loadScript(src):
	function loadScript(src) {
		let script = document.createElement('script');
		script.src = src;
		document.head.append(script);
	}
Эта функция загружает на страницу новый скрипт. Когда в тело документа добавится конструкция <script src="…">, браузер загрузит скрипт и выполнит его.
Вот пример использования этой функции:
	loadScript('/my/script.js'); // загрузит и выполнит скрипт
Такие функции называют асинхронными, потому что действие (загрузка скрипта) будет завершено не сейчас, а потом.
Если после вызова loadScript(…) есть какой-то код, то он не будет ждать, пока скрипт загрузится.
	loadScript('/my/script.js');
	// код, написанный после вызова функции loadScript,
	// не будет дожидаться полной загрузки скрипта
	// ...
Мы хотели бы использовать новый скрипт, как только он будет загружен. Скажем, он объявляет новую функцию, которую мы хотим выполнить.
Но если мы просто вызовем эту функцию после loadScript(…), у нас ничего не выйдет:
	loadScript('/my/script.js'); // в скрипте есть "function newFunction() {…}"
	newFunction(); // такой функции не существует!
Действительно, ведь у браузера не было времени загрузить скрипт. Сейчас функция loadScript никак не позволяет отследить момент загрузки. Скрипт загружается, а потом выполняется. Но нам нужно точно знать, когда это произойдёт, чтобы использовать функции и переменные из этого скрипта.
Давайте передадим функцию callback вторым аргументом в loadScript, чтобы вызвать её, когда скрипт загрузится:
	function loadScript(src, callback) {
		let script = document.createElement('script');
		script.src = src;
		script.onload = () => callback(script);
		document.head.append(script);
	}
Событие onload описано в статье Загрузка ресурсов: onload и onerror ['https://learn.javascript.ru/onload-onerror#loading-a-script'], оно в основном выполняет функцию после загрузки и выполнения скрипта.
Теперь, если мы хотим вызвать функцию из скрипта, нужно делать это в колбэке:
	loadScript('/my/script.js', function() {
		// эта функция вызовется после того, как загрузится скрипт
		newFunction(); // теперь всё работает
		...
	});
Смысл такой: вторым аргументом передаётся функция (обычно анонимная), которая выполняется по завершении действия.
Возьмём для примера реальный скрипт с библиотекой функций:
	function loadScript(src, callback) {
		let script = document.createElement('script');
		script.src = src;
		script.onload = () => callback(script);
		document.head.append(script);
	}
	loadScript('https://cdnjs.cloudflare.com/ajax/libs/lodash.js/3.2.0/lodash.js', script => {
		alert(`Здорово, скрипт ${script.src} загрузился`);
		alert( _ ); // функция, объявленная в загруженном скрипте
	});
Такое написание называют асинхронным программированием с использованием колбэков. В функции, которые выполняют какие-либо асинхронные операции, передаётся аргумент callback — функция, которая будет вызвана по завершению асинхронного действия.
Мы поступили похожим образом в loadScript, но это, конечно, распространённый подход.

Колбэк в колбэке.
Как нам загрузить два скрипта один за другим: сначала первый, а за ним второй?
Первое, что приходит в голову, вызвать loadScript ещё раз уже внутри колбэка, вот так:
	loadScript('/my/script.js', function(script) {
		alert(`Здорово, скрипт ${script.src} загрузился, загрузим ещё один`);
		loadScript('/my/script2.js', function(script) {
			alert(`Здорово, второй скрипт загрузился`);
		});
	});
Когда внешняя функция loadScript выполнится, вызовется та, что внутри колбэка.
А что если нам нужно загрузить ещё один скрипт?..
	loadScript('/my/script.js', function(script) {
		loadScript('/my/script2.js', function(script) {
			loadScript('/my/script3.js', function(script) {
				// ...и так далее, пока все скрипты не будут загружены
			});
		})
	});
Каждое новое действие мы вынуждены вызывать внутри колбэка. Этот вариант подойдёт, когда у нас одно-два действия, но для большего количества уже не удобно. Альтернативные подходы мы скоро разберём.

Перехват ошибок.
В примерах выше мы не думали об ошибках. А что если загрузить скрипт не удалось? Колбэк должен уметь реагировать на возможные проблемы.
Ниже улучшенная версия loadScript, которая умеет отслеживать ошибки загрузки:
	function loadScript(src, callback) {
		let script = document.createElement('script');
		script.src = src;
		script.onload = () => callback(null, script);
		script.onerror = () => callback(new Error(`Не удалось загрузить скрипт ${src}`));
		document.head.append(script);
	}
Мы вызываем callback(null, script) в случае успешной загрузки и callback(error), если загрузить скрипт не удалось.
Живой пример:
	loadScript('/my/script.js', function(error, script) {
		if (error) {
			// обрабатываем ошибку
		} else {
			// скрипт успешно загружен
		}
	});
Опять же, подход, который мы использовали в loadScript, также распространён и называется «колбэк с первым аргументом-ошибкой» («error-first callback»).
Правила таковы:
1. Первый аргумент функции callback зарезервирован для ошибки. В этом случае вызов выглядит вот так: callback(err).
2. Второй и последующие аргументы — для результатов выполнения. В этом случае вызов выглядит вот так: callback(null, result1, result2…).
Одна и та же функция callback используется и для информирования об ошибке, и для передачи результатов.

Адская пирамида вызовов.
На первый взгляд это рабочий способ написания асинхронного кода. Так и есть. Для одного или двух вложенных вызовов всё выглядит нормально.
Но для нескольких асинхронных действий, которые нужно выполнить друг за другом, код выглядит вот так:
	loadScript('1.js', function(error, script) {
		if (error) {handleError(error)
		} else { // ...
			loadScript('2.js', function(error, script) {
				if (error) {handleError(error);
				} else { // ...
					loadScript('3.js', function(error, script) {
						if (error) {
							handleError(error);
						} else {
							// ...и так далее, пока все скрипты не будут загружены (*)
						}
					});
				}
			})
		}
	});
В примере выше:
	1. Мы загружаем 1.js. Продолжаем, если нет ошибок.
	2. Мы загружаем 2.js. Продолжаем, если нет ошибок.
	3. Мы загружаем 3.js. Продолжаем, если нет ошибок. И так далее (*).
Чем больше вложенных вызовов, тем наш код будет иметь всё большую вложенность, которую сложно поддерживать, особенно если вместо ... у нас код, содержащий другие цепочки вызовов, условия и т.д.
Иногда это называют "адом колбэков" или "адской пирамидой колбэков".
Пирамида вложенных вызовов растёт вправо с каждым асинхронным действием. В итоге вы сами будете путаться, где что есть.
Такой подход к написанию кода не приветствуется.
Мы можем попытаться решить эту проблему, изолируя каждое действие в отдельную функцию, вот так:
	loadScript('1.js', step1);
	function step1(error, script) {
		if (error) {
			handleError(error);
		} else {
			// ...
			loadScript('2.js', step2);
		}
	}
	function step2(error, script) {
		if (error) {
			handleError(error);
		} else {
			// ...
			loadScript('3.js', step3);
		}
	}
	function step3(error, script) {
		if (error) {
			handleError(error);
		} else {
			// ...и так далее, пока все скрипты не будут загружены (*)
		}
	};
Заметили? Этот код делает всё то же самое, но вложенность отсутствует, потому что все действия вынесены в отдельные функции.
Код абсолютно рабочий, но кажется разорванным на куски. Его трудно читать, вы наверняка заметили это. Приходится прыгать глазами между кусками кода, когда пытаешься его прочесть. Это неудобно, особенно, если читатель не знаком с кодом и не знает, что за чем следует.
Кроме того, все функции step* одноразовые, и созданы лишь только, чтобы избавиться от "адской пирамиды вызовов". Никто не будет их переиспользовать где-либо ещё. Таким образом, мы, кроме всего прочего, засоряем пространство имён. Нужно найти способ получше.
К счастью, такие способы существуют. Один из лучших — использовать промисы, о которых рассказано в следующей главе.

#1.11.2. Промисы
24.12.24/11.5.25 - https://learn.javascript.ru/promise-basics (https://learn.javascript.ru/promise)
Promise – это специальный объект, который содержит своё состояние (state), текущий результат (result) и колбэки. 
state (состояние):
	- вначале: pending (ожидание), 
	- затем – одно из: 
		- fulfilled (выполнено успешно), при вызове resolve, или 
		- rejected (выполнено с ошибкой), при вызове reject.
result (результат):
	- вначале: undefined, 
	- затем: 
		- value при вызове resolve(value), или 
		- error при вызове reject(error).
// свойства state и result – это внутренние свойства объекта Promise и к ним нет прямого доступа. 
На Promise можно навешивать колбэки двух типов:
	- resolve – срабатывают, когда Promise в состоянии выполнен успешно.
	- rejected – срабатывают, когда Promise в состоянии выполнен с ошибкой.
Потребление (использование) Promise:
	- Код, которому надо сделать что-то асинхронно, создаёт объект Promise и возвращает его.
	- Внешний код, получив Promise, навешивает на него обработчики.
	- По завершении процесса асинхронный код переводит Promise в состояние fulfilled (с результатом) или rejected (с ошибкой). При этом автоматически вызываются соответствующие обработчики во внешнем коде промиса.

						resolve(value)		state: "fulfilled"
new Promise(executor)	--------------> 	result: value
state: "pending"  							
result: undefined		reject(error)		state: "rejected"
						--------------> 	result: error

Синтаксис создания Promise:
	let promise = new Promise(function(resolve, reject) { // Эта функция будет вызвана автоматически
		// В ней можно делать любые асинхронные операции, а когда они завершатся — нужно вызвать одно из:
			// resolve(value - результат) при успешном выполнении
			// reject(error - ошибка) при ошибке
	});
Функция, переданная в конструкцию new Promise, называется исполнитель (executor). Когда Promise создаётся, она запускается автоматически. Она должна содержать создающий код, который когда-нибудь создаст результат. 
Её аргументы resolve(value) и reject(error) – это колбэки, которые предоставляет сам JS. 
Если в функции промиса происходит синхронный throw (или иная ошибка), то вызывается reject.
Функции resolve/reject принимают ровно один аргумент – value(результат)/error(ошибку), все дополнительные аргументы будут проигнорированы.
Когда промис переходит в состояние выполнен – с результатом (resolve) или ошибкой (reject) – это навсегда, т.е. его уже не изменить. Последующие вызовы resolve/reject будут просто проигнорированы.

Ниже пример конструктора Promise и простого исполнителя с кодом, дающим результат с задержкой (через setTimeout):
	let promise = new Promise(function(resolve, reject) { // эта функция выполнится автоматически, при вызове new Promise
		setTimeout(() => resolve("done"), 1000); // через 1 секунду сигнализировать, что задача выполнена с результатом "done"
	});
Мы можем наблюдать две вещи, запустив код выше:
1. Функция-исполнитель запускается сразу же при вызове new Promise.
2. Исполнитель получает два аргумента: resolve и reject — это функции, встроенные в JS, поэтому нам не нужно их писать. Нам нужно лишь позаботиться, чтобы исполнитель вызвал одну из них по готовности.
Спустя одну секунду "обработки" исполнитель вызовет resolve("done"), чтобы передать результат.
Это был пример успешно выполненной задачи, в результате мы получили успешно выполненный промис.

А теперь пример, в котором исполнитель сообщит, что задача выполнена с ошибкой:
	let promise = new Promise(function(resolve, reject) { // спустя одну секунду будет сообщено, что задача выполнена с ошибкой
		setTimeout(() => reject(new Error("Whoops!")), 1000);
	});
Подведём промежуточные итоги: исполнитель выполняет задачу (что-то, что обычно требует времени), затем вызывает resolve или reject, чтобы изменить состояние соответствующего Promise.
Промис – и успешный, и отклонённый будем называть завершённым, в отличие от изначального промиса "в ожидании".

Может быть что-то одно: либо результат, либо ошибка.
Исполнитель должен вызвать что-то одно: resolve или reject. Состояние промиса может быть изменено только один раз.
Все последующие вызовы resolve и reject будут проигнорированы:
	let promise = new Promise(function(resolve, reject) {
		resolve("done");
		reject(new Error("…")); // игнорируется
		setTimeout(() => resolve("…")); // игнорируется
	});
Идея в том, что задача, выполняемая исполнителем, может иметь только один итог: результат или ошибку.
Также заметим, что функция resolve/reject ожидает только один аргумент (или ни одного). Все дополнительные аргументы будут проигнорированы.

Вызывайте reject с объектом Error.
В случае, если что-то пошло не так, мы должны вызвать reject. Это можно сделать с аргументом любого типа (как и resolve), но рекомендуется использовать объект Error (или унаследованный от него). Почему так? Скоро нам станет понятно.

Вызов resolve/reject сразу.
Обычно исполнитель делает что-то асинхронное и после этого вызывает resolve/reject, то есть через какое-то время. Но это не обязательно, resolve или reject могут быть вызваны сразу:
	let promise = new Promise(function(resolve, reject) { // задача, не требующая времени
		resolve(123); // мгновенно выдаст результат: 123
	});
Это может случиться, например, когда мы начали выполнять какую-то задачу, но тут же увидели, что ранее её уже выполняли, и результат закеширован.
Такая ситуация нормальна. Мы сразу получим успешно завершённый Promise.

Свойства state и result – внутренние.
Свойства state и result – это внутренние свойства объекта Promise и мы не имеем к ним прямого доступа. Для обработки результата следует использовать методы .then/.catch/.finally, про них речь пойдёт дальше.

--------------
Потребление Promise:
Функции-потребители могут быть зарегистрированы (подписаны) с помощью методов then() и catch().

Универсальный метод для навешивания обработчиков then():
	promise.then(onFulfilled, onRejected);
	promise.then(onFulfilled).catch(onRejected);
	// onFulfilled – функция, которая будет вызвана с результатом при resolve.
	// onRejected – функция, которая будет вызвана с ошибкой при reject.
	.catch(onRejected) // обработчик ошибок, аналогично .then(null, onRejected);
	promise.then(
		function(result) { /* обработает успешное выполнение */ },
		function(error) { /* обработает ошибку */ }
	);

Цепочка then(): 
Чейнинг (chaining) - это возможность строить асинхронные цепочки из промисов. При чейнинге, то есть последовательных вызовах .then…then…then, в каждый следующий then переходит результат от предыдущего.
Если очередной then вернул промис, то далее по цепочке будет передан не сам этот промис, а его результат.

Наиболее важный и фундаментальный метод – .then().
Синтаксис:
	promise.then(
		function(result) { /* обработает успешное выполнение */ },
		function(error) { /* обработает ошибку */ }
	);
Первый аргумент метода .then – функция, которая выполняется, когда промис переходит в состояние fulfilled ("выполнен успешно"), и получает результат.
Второй аргумент .then – функция, которая выполняется, когда промис переходит в состояние rejected ("выполнен с ошибкой"), и получает ошибку.
Например, вот реакция на успешно выполненный промис:
	let promise = new Promise(function(resolve, reject) {
		setTimeout(() => resolve("done!"), 1000);
	});
	// resolve запустит первую функцию, переданную в .then
	promise.then(
		result => alert(result), // выведет "done!" через одну секунду
		error => alert(error) // не будет запущена
	);
Выполнилась первая функция.
А в случае ошибки в промисе – выполнится вторая:
	let promise = new Promise(function(resolve, reject) {
		setTimeout(() => reject(new Error("Whoops!")), 1000);
	});
	// reject запустит вторую функцию, переданную в .then
	promise.then(
		result => alert(result), // не будет запущена
		error => alert(error) // выведет "Error: Whoops!" спустя одну секунду
	);
Если мы заинтересованы только в результате успешного выполнения задачи, то в then можно передать только одну функцию:
	let promise = new Promise(resolve => {
		setTimeout(() => resolve("done!"), 1000);
	});
	promise.then(alert); // выведет "done!" спустя одну секунду

Перехват ошибок catch():
При возникновении ошибки она отправляется в ближайший обработчик onRejected: then(..., onRejected), или catch(onRejected), что аналогично then(null, onRejected).
Обработчик catch(onRejected) получает ошибку и должен обработать её:
- Если ошибка не критичная, то onRejected возвращает значение через return, и управление переходит в ближайший then(onFulfilled).
- Если продолжить выполнение с такой ошибкой нельзя, то он делает throw, и тогда ошибка переходит в следующий ближайший catch(onRejected).
Это похоже на обычный try..catch – в блоке catch ошибка либо обрабатывается, и тогда выполнение кода продолжается как обычно, либо он делает throw. Существенное отличие – в том, что промисы асинхронные, поэтому при отсутствии внешнего catch ошибка не вываливается в консоль и не убивает скрипт.

Если мы хотели бы только обработать ошибку, то можно использовать null в качестве первого аргумента: .then(null, errorHandlingFunction). Или можно воспользоваться методом .catch(errorHandlingFunction), который сделает то же самое:
	let promise = new Promise((resolve, reject) => {
		setTimeout(() => reject(new Error("Ошибка!")), 1000);
	}); // .catch(f) это то же самое, что promise.then(null, f)
	promise.catch(alert); // выведет "Error: Ошибка!" спустя одну секунду
Вызов .catch(f) – это сокращённый, укороченный вариант .then(null, f).

Очистка finally():
Метод finally() настраивает обработчик для выполнения очистки/доведения после завершения предыдущих операций. Он аналогичен блоку finally из обычного try..catch, и его задача – выполнить общие завершающие процедуры.
Вызов finally(func) похож на .then(func, func), в том смысле, что func выполнится в любом случае, когда промис завершится: успешно или с ошибкой.
Отличия finally() от then():
	- finally() не получает результат предыдущего обработчика (у него нет аргументов), вместо этого этот результат передается следующему подходящему обработчику.
	- finally() также не должен ничего возвращать, если обработчик возвращает что-то, это игнорируется.
	- finally() пропускает результат или ошибку дальше, к последующим обработчикам, потому что он не предназначен для обработки результата промиса.

Вызов .finally(f) похож на .then(f, f), в том смысле, что f выполнится в любом случае, когда промис завершится: успешно или с ошибкой.
Идея finally состоит в том, чтобы настроить обработчик для выполнения очистки/доведения после завершения предыдущих операций. Например, остановка индикаторов загрузки, закрытие больше не нужных соединений и т.д.
Думайте об этом как о завершении вечеринки. Независимо от того, была ли вечеринка хорошей или плохой, сколько на ней было друзей, нам все равно нужно (или, по крайней мере, мы должны) сделать уборку после нее.
Код может выглядеть следующим образом:
	new Promise((resolve, reject) => {/* сделать что-то, что займёт время, и после вызвать resolve или может reject */})
		// выполнится, когда промис завершится, независимо от того, успешно или нет
		.finally(() => остановить индикатор загрузки)
		// таким образом, индикатор загрузки всегда останавливается, прежде чем мы продолжим
		.then(result => показать результат, err => показать ошибку)
Обратите внимание, что finally(f) – это не совсем псевдоним then(f,f), как можно было подумать.
Есть важные различия:
	1. Обработчик, вызываемый из finally, не имеет аргументов. В finally мы не знаем, как был завершён промис. И это нормально, потому что обычно наша задача – выполнить общие завершающие процедуры.
		Пожалуйста, взгляните на приведенный выше пример: как вы можете видеть, обработчик finally не имеет аргументов, а результат промиса обрабатывается в следующем обработчике.
	2. Обработчик finally пропускает результат или ошибку дальше, к последующим обработчикам.
		Например, здесь результат проходит через finally к then:
			new Promise((resolve, reject) => {
				setTimeout(() => resolve("value"), 2000);
			})
				.finally(() => alert("Промис завершён")) // срабатывает первым
				.then(result => alert(result)); // <-- .then показывает "value"
		Как вы можете видеть, значение возвращаемое первым промисом, передается через finally к следующему then.
		Это очень удобно, потому что finally не предназначен для обработки результата промиса. Как уже было сказано, это место для проведения общей очистки, независимо от того, каков был результат.
		А здесь ошибка из промиса проходит через finally к catch:
			new Promise((resolve, reject) => {
				throw new Error("error");
			})
				.finally(() => alert("Промис завершён")) // срабатывает первым
				.catch(err => alert(err));  // <-- .catch показывает ошибку
	3. Обработчик finally также не должен ничего возвращать. Если это так, то возвращаемое значение молча игнорируется.
		Единственным исключением из этого правила является случай, когда обработчик finally выдает ошибку. Затем эта ошибка передается следующему обработчику вместо любого предыдущего результата.
Подведем итог:
- Обработчик finally не получает результат предыдущего обработчика (у него нет аргументов). Вместо этого этот результат передается следующему подходящему обработчику.
- Если обработчик finally возвращает что-то, это игнорируется.
- Когда finally выдает ошибку, выполнение переходит к ближайшему обработчику ошибок.
Эти функции полезны и заставляют все работать правильно, если мы используем finally так, как предполагается: для общих процедур очистки.

На завершённых промисах обработчики запускаются сразу.
Если промис в состоянии ожидания, обработчики в .then/catch/finally будут ждать его.
Иногда может случиться так, что промис уже выполнен, когда мы добавляем к нему обработчик.
В таком случае эти обработчики просто запускаются немедленно:
	// при создании промиса он сразу переводится в состояние "успешно завершён"
	let promise = new Promise(resolve => resolve("готово!"));
	promise.then(alert); // готово! (выведется сразу)

Пример: loadScript.
Теперь рассмотрим несколько практических примеров того, как промисы могут облегчить нам написание асинхронного кода.
У нас есть функция loadScript для загрузки скрипта из предыдущей главы.
Давайте вспомним, как выглядел вариант с колбэками:
	function loadScript(src, callback) {
		let script = document.createElement('script');
		script.src = src;
		script.onload = () => callback(null, script);
		script.onerror = () => callback(new Error(`Ошибка загрузки скрипта ${src}`));
		document.head.append(script);
	}
Теперь перепишем её, используя Promise.
Новой функции loadScript более не нужен аргумент callback. Вместо этого она будет создавать и возвращать объект Promise, который перейдет в состояние fulfilled (успешно завершён), когда загрузка закончится. Внешний код может добавлять обработчики, используя .then:
	function loadScript(src) {
		return new Promise(function(resolve, reject) {
			let script = document.createElement('script');
			script.src = src;
			script.onload = () => resolve(script);
			script.onerror = () => reject(new Error(`Ошибка загрузки скрипта ${src}`));
			document.head.append(script);
		});
	}
Применение:
	let promise = loadScript("https://cdnjs.cloudflare.com/ajax/libs/lodash.js/4.17.11/lodash.js");
	promise.then(
		script => alert(`${script.src} загружен!`),
		error => alert(`Ошибка: ${error.message}`)
	);
	promise.then(script => alert('Ещё один обработчик...'));
Сразу заметно несколько преимуществ перед подходом с использованием колбэков:
	Промисы	:
		Промисы позволяют делать вещи в естественном порядке. Сперва мы запускаем loadScript(script), и затем мы пишем, что делать с результатом (.then).
		Мы можем вызывать .then у Promise столько раз, сколько захотим. Каждый раз мы добавляем нового "подписчика", новую функцию-подписчика в "список подписок". Больше об этом в следующей главе: Цепочка промисов.	
	Колбэки :
		У нас должна быть функция callback на момент вызова loadScript(script, callback). Другими словами, нам нужно знать что делать с результатом до того, как вызовется loadScript.
		Колбэк может быть только один.
Таким образом, промисы позволяют улучшить порядок кода и дают нам гибкость. Но это далеко не всё. Мы узнаем ещё много полезного в последующих главах.

Задачи: 1+ 2+- 3+-
1. Можно ли "перевыполнить" промис?
Что выведет код ниже? // 1
	let promise = new Promise(function(resolve, reject) {
		resolve(1);
		setTimeout(() => resolve(2), 1000);
	});
	promise.then(alert);
решение:
	Вывод будет: 1.
	Второй вызов resolve будет проигнорирован, поскольку учитывается только первый вызов reject/resolve. Все последующие вызовы – игнорируются.

2. Задержка на промисах
Встроенная функция setTimeout использует колбэк-функции. Создайте альтернативу, использующую промисы.
Функция delay(ms) должна возвращать промис, который перейдёт в состояние "выполнен" через ms миллисекунд, так чтобы мы могли добавить к нему .then:
	function delay(ms) {/* ваш код */}
	delay(3000).then(() => alert('выполнилось через 3 секунды'));
решение:
	// моё: 
		return new Promise(function(resolve, reject){ setTimeout(() => resolve("value"), ms) });
	// учебник: 
		function delay(ms) {
			return new Promise(resolve => setTimeout(resolve, ms));
		}
		delay(3000).then(() => alert('выполнилось через 3 секунды'));
	// Заметьте, что resolve вызывается без аргументов. Мы не возвращаем из delay ничего, просто гарантируем задержку.

3. Анимация круга с помощью промиса
Перепишите функцию showCircle, написанную в задании "Анимация круга с помощью колбэка" ['https://learn.javascript.ru/task/animate-circle-callback'] таким образом, чтобы она возвращала промис, вместо того чтобы принимать в аргументы функцию-callback.
Новое использование:
	showCircle(150, 150, 100).then(div => {
		div.classList.add('message-ball');
		div.append("Hello, world!");
	});
Возьмите решение из "Анимация круга с помощью колбэка" в качестве основы. ['https://learn.javascript.ru/task/animate-circle-callback']
решение:
index.html:
<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<style>
		.message-ball {
			font-size: 20px;
			line-height: 200px;
			text-align: center;
		}
		.circle {
			transition-property: width, height;
			transition-duration: 2s;
			position: fixed;
			transform: translateX(-50%) translateY(-50%);
			background-color: red;
			border-radius: 50%;
		}
	</style>
</head>
<body>
	<button onclick="go()">Нажми меня</button>
	<script>
		function go() {
			showCircle(150, 150, 100).then(div => {
				div.classList.add('message-ball');
				div.append("Hello, world!");
			});
		}
		function showCircle(cx, cy, radius) {
			let div = document.createElement('div');
			div.style.width = 0;
			div.style.height = 0;
			div.style.left = cx + 'px';
			div.style.top = cy + 'px';
			div.className = 'circle';
			document.body.append(div);
			return new Promise(resolve => {
				setTimeout(() => {
					div.style.width = radius * 2 + 'px';
					div.style.height = radius * 2 + 'px';
					div.addEventListener('transitionend', function handler() {
						div.removeEventListener('transitionend', handler);
						resolve(div);
					});
				}, 0);
			})
		}
	</script>
</body>
</html>

(https://learn.javascript.ru/promise) :
Промисификация – это когда берут асинхронную функциональность и делают для неё обёртку, возвращающую промис.
После промисификации использование функциональности зачастую становится гораздо удобнее.
В качестве примера сделаем такую обёртку для запросов при помощи XMLHttpRequest.
Функция httpGet(url) будет возвращать промис, который при успешной загрузке данных с url будет переходить в fulfilled с этими данными, а при ошибке – в rejected с информацией об ошибке:
function httpGet(url) {
    return new Promise(function(resolve, reject) {
        var xhr = new XMLHttpRequest();
        xhr.open('GET', url, true);
        xhr.onload = function() {
            if (this.status == 200) {resolve(this.response)} 
            else {
                var error = new Error(this.statusText);
                error.code = this.status;
                reject(error);
            }
        };
        xhr.onerror = function() {
            reject(new Error("Network Error"));
        };
        xhr.send();
    });
}
// Как видно, внутри функции объект XMLHttpRequest создаётся и отсылается как обычно, при onload/onerror вызываются, соответственно, resolve (при статусе 200) или reject.
httpGet("./data/data-locations.json") // использование
    .then(
        response => console.log(`Fulfilled: ${response}`),
        error => console.log(`Rejected: ${error}`)
    );
=> Fulfilled: ["data/data-locations.json"]
Метод fetch() - современная замена XMLHttpRequest(). 
	Все современные браузеры уже поддерживает fetch() – новый встроенный метод для AJAX-запросов, призванный заменить XMLHttpRequest. Он гораздо мощнее, чем httpGet(). И этот метод использует промисы. Полифил для него доступен на https://github.com/github/fetch.

статические методы промисов:
Promise.all(iterable) - получает массив (или другой итерируемый объект) промисов и возвращает промис, который ждёт, пока все переданные промисы завершатся, и переходит в состояние выполнено с массивом их результатов.
Promise.race(iterable) - получает итерируемый объект с промисами, которые нужно выполнить, и возвращает новый промис. В отличие от Promise.all(), результатом будет только первый успешно выполнившийся промис из списка. Остальные игнорируются.
Promise.resolve(value) - создаёт успешно выполнившийся промис с результатом value. 
	// Он аналогичен конструкции: new Promise((resolve) => resolve(value));
	// используют, когда хотят построить асинхронную цепочку, и начальный результат уже есть.
Promise.reject(error) - создаёт уже выполнившийся промис с ошибкой error.
	// используется очень редко, потому что ошибка возникает обычно не в начале цепочки, а в процессе её выполнения.

Задачи:
1. Задержка на промисах.
Создайте альтернативу setTimeout(), использующую промисы. Функция delay(ms) должна возвращать промис, который перейдёт в состояние выполнен через ms миллисекунд, так чтобы мы могли добавить к нему .then().
function delay(ms) {
    return new Promise(function(resolve, reject){
        setTimeout(() => resolve(console.log("done")), ms);
    });
}
delay(3000).then(() => alert('выполнилось через 3 секунды'));

2. Анимация круга с помощью промиса.
Перепишите функцию showCircle, написанную в задании Анимация круга с помощью колбэка таким образом, чтобы она возвращала промис, вместо того чтобы принимать в аргументы функцию-callback.

app\index.html:+
	<section class="circle-section">
		<div class="circle-w">
			<button class="btn circle-btn" onclick="go()">нарисовать круг</button>
		</div>
	</section><hr>
	<script src="./js/circle.js"></script>

app\scss\main.scss:+
	.circle-w {position: relative; height: 250px;}
	.circle-btn {padding: 3px 20px; font-size: 14px; border-radius: 14px;}
	.message-ball {font-size: 24px; line-height: 200px; text-align: center;}
	.circle {position: absolute; transition-property: width, height; transition-duration: 2s; transform: translateX(-50%) translateY(-50%); background-color: #9ac7bd; border-radius: 50%;}

app\js\circle.js:
let circleBtn = document.querySelector('.circle-btn');
function go() {
    showCircle(150, 400, 100).then(div => {
        div.classList.add('message-ball');
        div.append("Hello, world!");
    });
};
function showCircle(cx, cy, radius, callback) {
    let div = document.createElement('div');
    div.style.width = 0;
    div.style.height = 0;
    div.style.left = cx + 'px';
    div.style.top = cy + 'px';
    div.className = 'circle';
    document.body.append(div);
    return new Promise(resolve => {
        setTimeout(() => {
            div.style.width = radius * 2 + 'px';
            div.style.height = radius * 2 + 'px';
            div.addEventListener('transitionend', function handler() {
                div.removeEventListener('transitionend', handler);
                resolve(div);
                circleBtn.innerText = 'нажать опять';
            });
        }, 0);
    })
};

#1.11.3. Цепочка промисов
12.5.25 - https://learn.javascript.ru/promise-chaining
Давайте вернёмся к ситуации из главы Введение: колбэки: у нас есть последовательность асинхронных задач, которые должны быть выполнены одна за другой. Например, речь может идти о загрузке скриптов. Как же грамотно реализовать это в коде?
Промисы предоставляют несколько способов решения подобной задачи.
В этой главе мы разберём цепочку промисов.
Она выглядит вот так:
	new Promise(function(resolve, reject) {
		setTimeout(() => resolve(1), 1000); // (*)
	}).then(function(result) { // (**)
		alert(result); // 1
		return result * 2;
	}).then(function(result) { // (***)
		alert(result); // 2
		return result * 2;
	}).then(function(result) {
		alert(result); // 4
		return result * 2;
	});
Идея состоит в том, что результат первого промиса передаётся по цепочке обработчиков .then.
Поток выполнения такой:
	1. Начальный промис успешно выполняется через 1 секунду (*),
	2. Затем вызывается обработчик в .then (**).
	3. Возвращаемое им значение передаётся дальше в следующий обработчик .then (***)
	4. …и так далее.
В итоге результат передаётся по цепочке обработчиков, и мы видим несколько alert подряд, которые выводят: 1 → 2 → 4.
Всё это работает, потому что вызов promise.then тоже возвращает промис, так что мы можем вызвать на нём следующий .then.
Когда обработчик возвращает какое-то значение, то оно становится результатом выполнения соответствующего промиса и передаётся в следующий .then.
Классическая ошибка новичков: технически возможно добавить много обработчиков .then к единственному промису. Но это не цепочка.
Например:
	let promise = new Promise(function(resolve, reject) {
		setTimeout(() => resolve(1), 1000);
	});
	promise.then(function(result) {
		alert(result); // 1
		return result * 2;
	});
	promise.then(function(result) {
		alert(result); // 1
		return result * 2;
	});
	promise.then(function(result) {
		alert(result); // 1
		return result * 2;
	});
Мы добавили несколько обработчиков к одному промису. Они не передают друг другу результаты своего выполнения, а действуют независимо.
Все обработчики .then на одном и том же промисе получают одно и то же значение – результат выполнения того же самого промиса. Таким образом, в коде выше все alert показывают одно и то же: 1.
На практике весьма редко требуется назначать несколько обработчиков одному промису. А вот цепочка промисов используется куда чаще.

Возвращаем промисы.
Обработчик handler, переданный в .then(handler), может вернуть промис.
В этом случае дальнейшие обработчики ожидают, пока он выполнится, и затем получают его результат.
Например:
	new Promise(function(resolve, reject) {
		setTimeout(() => resolve(1), 1000);
	}).then(function(result) {
		alert(result); // 1
		return new Promise((resolve, reject) => { // (*)
			setTimeout(() => resolve(result * 2), 1000);
		});
	}).then(function(result) { // (**)
		alert(result); // 2
		return new Promise((resolve, reject) => {
			setTimeout(() => resolve(result * 2), 1000);
		});
	}).then(function(result) {
		alert(result); // 4
	});
Здесь первый .then показывает 1 и возвращает новый промис new Promise(…) в строке (*). Через одну секунду этот промис успешно выполняется, и его результат (аргумент в resolve, то есть result * 2) передаётся обработчику в следующем .then. Он находится в строке (**), показывает 2 и делает то же самое.
Таким образом, как и в предыдущем примере, выводятся 1 → 2 → 4, но сейчас между вызовами alert существует пауза в 1 секунду.
Возвращая промисы, мы можем строить цепочки из асинхронных действий.

Пример: loadScript.
Давайте используем эту возможность вместе с промисифицированной функцией loadScript, созданной нами в предыдущей главе, чтобы загружать скрипты по очереди, последовательно:
loadScript("/article/promise-chaining/one.js")
	.then(function(script) {
		return loadScript("/article/promise-chaining/two.js");
	})
	.then(function(script) {
		return loadScript("/article/promise-chaining/three.js");
	})
	.then(function(script) {
		// вызовем функции, объявленные в загружаемых скриптах,
		// чтобы показать, что они действительно загрузились
		one();
		two();
		three();
	});
Этот же код можно переписать немного компактнее, используя стрелочные функции:
	loadScript("/article/promise-chaining/one.js")
		.then(script => loadScript("/article/promise-chaining/two.js"))
		.then(script => loadScript("/article/promise-chaining/three.js"))
		.then(script => { // скрипты загружены, мы можем использовать объявленные в них функции
			one();
			two();
			three();
		});
Здесь каждый вызов loadScript возвращает промис, и следующий обработчик в .then срабатывает, только когда этот промис завершается. Затем инициируется загрузка следующего скрипта и так далее. Таким образом, скрипты загружаются один за другим.
Мы можем добавить и другие асинхронные действия в цепочку. Обратите внимание, что наш код всё ещё плоский, он растёт вниз, а не вправо. Нет никаких признаков "адской пирамиды вызовов".
Технически мы бы могли добавлять .then напрямую к каждому вызову loadScript, вот так:
	loadScript("/article/promise-chaining/one.js").then(script1 => {
		loadScript("/article/promise-chaining/two.js").then(script2 => {
			loadScript("/article/promise-chaining/three.js").then(script3 => {
				// эта функция имеет доступ к переменным script1, script2 и script3
				one();
				two();
				three();
			});
		});
	});
Этот код делает то же самое: последовательно загружает 3 скрипта. Но он растёт вправо, так что возникает такая же проблема, как и с колбэками.
Разработчики, которые не так давно начали использовать промисы, иногда не знают про цепочки и пишут код именно так, как показано выше. В целом, использование цепочек промисов предпочтительнее.
Иногда всё же приемлемо добавлять .then напрямую, чтобы вложенная в него функция имела доступ к внешней области видимости. В примере выше самая глубоко вложенная функция обратного вызова имеет доступ ко всем переменным script1, script2, script3. Но это скорее исключение, чем правило.

Thenable.
Если быть более точными, обработчик может возвращать не именно промис, а любой объект, содержащий метод .then, такие объекты называют thenable, и этот объект будет обработан как промис.
Смысл в том, что сторонние библиотеки могут создавать свои собственные совместимые с промисами объекты. Они могут иметь свои наборы методов и при этом быть совместимыми со встроенными промисами, так как реализуют метод .then.
Вот пример такого объекта:
	class Thenable {
		constructor(num) {
			this.num = num;
		}
		then(resolve, reject) {
			alert(resolve); // function() { native code }
			// будет успешно выполнено с аргументом this.num*2 через 1 секунду
			setTimeout(() => resolve(this.num * 2), 1000); // (**)
		}
	}
	new Promise(resolve => resolve(1))
		.then(result => {
			return new Thenable(result); // (*)
		})
		.then(alert); // показывает 2 через 1000мс
JS проверяет объект, возвращаемый из обработчика .then в строке (*): если у него имеется метод then, который можно вызвать, то этот метод вызывается, и в него передаются как аргументы встроенные функции resolve и reject, вызов одной из которых потом ожидается. В примере выше происходит вызов resolve(2) через 1 секунду (**). Затем результат передаётся дальше по цепочке.
Это позволяет добавлять в цепочки промисов пользовательские объекты, не заставляя их наследовать от Promise.

Более сложный пример: fetch.
Во фронтенд-разработке промисы часто используются, чтобы делать запросы по сети. Давайте рассмотрим один такой пример.
Мы будем использовать метод fetch, чтобы подгрузить информацию о пользователях с удалённого сервера. Этот метод имеет много опциональных параметров, разобранных в соответствующих разделах, но базовый синтаксис весьма прост:
	let promise = fetch(url);
Этот код запрашивает по сети url и возвращает промис. Промис успешно выполняется и в свою очередь возвращает объект response после того, как удалённый сервер присылает заголовки ответа, но до того, как весь ответ сервера полностью загружен.
Чтобы прочитать полный ответ, надо вызвать метод response.text(): он тоже возвращает промис, который выполняется, когда данные полностью загружены с удалённого сервера, и возвращает эти данные.
Код ниже запрашивает файл user.json и загружает его содержимое с сервера:
	fetch('/article/promise-chaining/user.json') // .then в коде ниже выполняется, когда удалённый сервер отвечает
		.then(function(response) {
			// response.text() возвращает новый промис, который выполняется и возвращает полный ответ сервера, когда он загрузится
			return response.text();
		})
		.then(function(text) { // ...и здесь содержимое полученного файла
			alert(text); // {"name": "iliakan", isAdmin: true}
		});
Есть также метод response.json(), который читает данные в формате JSON. Он больше подходит для нашего примера, так что давайте использовать его.
Мы также применим стрелочные функции для более компактной записи кода:
	// то же самое, что и раньше, только теперь response.json() читает данные в формате JSON
	fetch('/article/promise-chaining/user.json')
		.then(response => response.json())
		.then(user => alert(user.name)); // iliakan, получили имя пользователя
Теперь давайте что-нибудь сделаем с полученными данными о пользователе.
Например, мы можем послать запрос на GitHub, чтобы загрузить данные из профиля пользователя и показать его аватар:
	// Запрашиваем user.json
	fetch('/article/promise-chaining/user.json')
		// Загружаем данные в формате json
		.then(response => response.json())
		// Делаем запрос к GitHub
		.then(user => fetch(`https://api.github.com/users/${user.name}`))
		// Загружаем ответ в формате json
		.then(response => response.json())
		// Показываем аватар (githubUser.avatar_url) в течение 3 секунд (возможно, с анимацией)
		.then(githubUser => {
			let img = document.createElement('img');
			img.src = githubUser.avatar_url;
			img.className = "promise-avatar-example";
			document.body.append(img);
			setTimeout(() => img.remove(), 3000); // (*)
		});
Код работает, детали реализации отражены в комментариях. Однако в нём есть одна потенциальная проблема, с которой часто сталкиваются новички.
Посмотрите на строку (*): как мы можем предпринять какие-то действия после того, как аватар был показан и удалён? Например, мы бы хотели показывать форму редактирования пользователя или что-то ещё. Сейчас это невозможно.
Чтобы сделать наш код расширяемым, нам нужно возвращать ещё один промис, который выполняется после того, как завершается показ аватара.
Примерно так:
	fetch('/article/promise-chaining/user.json')
		.then(response => response.json())
		.then(user => fetch(`https://api.github.com/users/${user.name}`))
		.then(response => response.json())
		.then(githubUser => new Promise(function(resolve, reject) { // (*)
			let img = document.createElement('img');
			img.src = githubUser.avatar_url;
			img.className = "promise-avatar-example";
			document.body.append(img);
			setTimeout(() => {
				img.remove();
				resolve(githubUser); // (**)
			}, 3000);
		}))
		// срабатывает через 3 секунды
		.then(githubUser => alert(`Закончили показ ${githubUser.name}`));
То есть, обработчик .then в строке (*) будет возвращать new Promise, который перейдёт в состояние "выполнен" только после того, как в setTimeout (**) будет вызвана resolve(githubUser).
Соответственно, следующий по цепочке .then будет ждать этого.

Как правило, все асинхронные действия должны возвращать промис.
Это позволяет планировать после него какие-то дополнительные действия. Даже если эта возможность не нужна прямо сейчас, она может понадобиться в будущем.
И, наконец, давайте разобьём написанный код на отдельные функции, пригодные для повторного использования:
	function loadJson(url) {
		return fetch(url)
			.then(response => response.json());
	}
	function loadGithubUser(name) {
		return fetch(`https://api.github.com/users/${name}`)
			.then(response => response.json());
	}
	function showAvatar(githubUser) {
		return new Promise(function(resolve, reject) {
			let img = document.createElement('img');
			img.src = githubUser.avatar_url;
			img.className = "promise-avatar-example";
			document.body.append(img);
			setTimeout(() => {
				img.remove();
				resolve(githubUser);
			}, 3000);
		});
	}
	// Используем их:
	loadJson('/article/promise-chaining/user.json')
		.then(user => loadGithubUser(user.name))
		.then(showAvatar)
		.then(githubUser => alert(`Показ аватара ${githubUser.name} завершён`));
		// ...

https://learn.javascript.ru/article/promise-chaining/user.json :
{
  "name": "iliakan",
  "isAdmin": true
}

https://api.github.com/users/iliakan : 
{
  "login": "iliakan",
  "id": 349336,
  "node_id": "MDQ6VXNlcjM0OTMzNg==",
  "avatar_url": "https://avatars.githubusercontent.com/u/349336?v=4",
  "gravatar_id": "",
  "url": "https://api.github.com/users/iliakan",
  "html_url": "https://github.com/iliakan",
  "followers_url": "https://api.github.com/users/iliakan/followers",
  "following_url": "https://api.github.com/users/iliakan/following{/other_user}",
  "gists_url": "https://api.github.com/users/iliakan/gists{/gist_id}",
  "starred_url": "https://api.github.com/users/iliakan/starred{/owner}{/repo}",
  "subscriptions_url": "https://api.github.com/users/iliakan/subscriptions",
  "organizations_url": "https://api.github.com/users/iliakan/orgs",
  "repos_url": "https://api.github.com/users/iliakan/repos",
  "events_url": "https://api.github.com/users/iliakan/events{/privacy}",
  "received_events_url": "https://api.github.com/users/iliakan/received_events",
  "type": "User",
  "user_view_type": "public",
  "site_admin": false,
  "name": "Ilya Kantor",
  "company": null,
  "blog": "https://javascript.info",
  "location": "Amsterdam",
  "email": null,
  "hireable": null,
  "bio": null,
  "twitter_username": null,
  "public_repos": 157,
  "public_gists": 734,
  "followers": 3662,
  "following": 0,
  "created_at": "2010-07-30T14:31:35Z",
  "updated_at": "2025-04-08T06:41:30Z"
}

Итого:
Если обработчик в .then (или в catch/finally, без разницы) возвращает промис, последующие элементы цепочки ждут, пока этот промис выполнится. Когда это происходит, результат его выполнения (или ошибка) передаётся дальше.
Вот полная картина происходящего:
	1. вызов .then(handler) всегда возвращает промис:
		state: "pending", result: undefined
	2. если handler заканчивается…
		a. возвратом значения:
			state: "fulfilled", result: value
		b. ошибкой (этот промис завершается с):
			state: "rejected", result: error
		c. возвратом промиса:
			...с результатом нового промиса...

Задачи: 1-
1. Промисы: сравните then и catch
Являются ли фрагменты кода ниже эквивалентными? 
Другими словами, ведут ли они себя одинаково во всех обстоятельствах, для всех переданных им обработчиков?
	promise.then(f1).catch(f2);
Против:
	promise.then(f1, f2);
решение:
	Короткий ответ: нет, они не эквивалентны:
	Разница в том, что если ошибка произойдёт в f1, то она будет обработана в .catch в этом примере:
		promise.then(f1).catch(f2);
	…но не в этом:
		promise.then(f1, f2);
	Ошибка передаётся по цепочке, но во втором примере нет продолжения цепочки после f1.
	Другими словами, .then передаёт результат или ошибку следующему блоку .then/catch. Так как в первом примере в цепочке далее имеется блок catch, а во втором – нет, то ошибка в нём останется необработанной.
2. в каком порядке числа выведутся в консоль:
	new Promise(resolve => resolve())
		.then(() => {
			console.log(1);
			return new Promise(resolve => resolve());
		}).then(() => console.log(2));
	new Promise(resolve => resolve())
		.then(() => console.log(3))
		.then(() => console.log(4))
		.then(() => console.log(5));
// ответ: 1, 3, 4, 5, 2.

#1.11.4. Промисы: обработка ошибок
13.5.25 - https://learn.javascript.ru/promise-error-handling

Цепочки промисов отлично подходят для перехвата ошибок. Если промис завершается с ошибкой, то управление переходит в ближайший обработчик ошибок. На практике это очень удобно.
Например, в представленном ниже примере для fetch указана неправильная ссылка (сайт не существует), и .catch перехватывает ошибку:
	fetch('https://no-such-server.blabla') // ошибка
		.then(response => response.json())
		.catch(err => alert(err)) // TypeError: failed to fetch (текст может отличаться)
Как видно, .catch не обязательно должен быть сразу после ошибки, он может быть далее, после одного или даже нескольких .then.
Или, может быть, с сервером всё в порядке, но в ответе мы получим некорректный JSON. Самый лёгкий путь перехватить все ошибки – это добавить .catch в конец цепочки:
	fetch('/article/promise-chaining/user.json')
		.then(response => response.json())
		.then(user => fetch(`https://api.github.com/users/${user.name}`))
		.then(response => response.json())
		.then(githubUser => new Promise((resolve, reject) => {
			let img = document.createElement('img');
			img.src = githubUser.avatar_url;
			img.className = "promise-avatar-example";
			document.body.append(img);
			setTimeout(() => {
				img.remove();
				resolve(githubUser);
			}, 3000);
		}))
		.catch(error => alert(error.message));
Если все в порядке, то такой .catch вообще не выполнится. Но если любой из промисов будет отклонён (проблемы с сетью или некорректная json-строка, или что угодно другое), то ошибка будет перехвачена.

Неявный try..catch.
Вокруг функции промиса и обработчиков находится "невидимый" try..catch. Если происходит исключение, то оно перехватывается, и промис считается отклонённым с этой ошибкой.
Например, этот код:
	new Promise((resolve, reject) => {
		throw new Error("Ошибка!");
	}).catch(alert); // Error: Ошибка!
…Работает так же, как и этот:
	new Promise((resolve, reject) => {
		reject(new Error("Ошибка!"));
	}).catch(alert); // Error: Ошибка!
Невидимый try..catch вокруг промиса автоматически перехватывает ошибку и превращает её в отклонённый промис.
Это работает не только в функции промиса, но и в обработчиках. Если мы бросим ошибку (throw) из обработчика (.then), то промис будет считаться отклонённым, и управление перейдёт к ближайшему обработчику ошибок.
Пример:
	new Promise((resolve, reject) => {
		resolve("ок");
	}).then((result) => {
		throw new Error("Ошибка!"); // генерируем ошибку
	}).catch(alert); // Error: Ошибка!
Это происходит для всех ошибок, не только для тех, которые вызваны оператором throw. Например, программная ошибка:
	new Promise((resolve, reject) => {
		resolve("ок");
	}).then((result) => {
		blabla(); // нет такой функции
	}).catch(alert); // ReferenceError: blabla is not defined
Финальный .catch перехватывает как промисы, в которых вызван reject, так и случайные ошибки в обработчиках.

Пробрасывание ошибок.
Как мы уже заметили, .catch ведёт себя как try..catch. Мы можем иметь столько обработчиков .then, сколько мы хотим, и затем использовать один .catch в конце, чтобы перехватить ошибки из всех обработчиков.
В обычном try..catch мы можем проанализировать ошибку и повторно пробросить дальше, если не можем её обработать. То же самое возможно для промисов.
Если мы пробросим (throw) ошибку внутри блока .catch, то управление перейдёт к следующему ближайшему обработчику ошибок. А если мы обработаем ошибку и завершим работу обработчика нормально, то продолжит работу ближайший успешный обработчик .then.
В примере ниже .catch успешно обрабатывает ошибку:
	// the execution: catch -> then
	new Promise((resolve, reject) => {
		throw new Error("Ошибка!");
	}).catch(function(error) {
		alert("Ошибка обработана, продолжить работу");
	}).then(() => alert("Управление перейдёт в следующий then"));
Здесь блок .catch завершается нормально. Поэтому вызывается следующий успешный обработчик .then.
В примере ниже мы видим другую ситуацию с блоком .catch. Обработчик (*) перехватывает ошибку и не может обработать её (например, он знает как обработать только URIError), поэтому ошибка пробрасывается далее:
	// the execution: catch -> catch -> then
	new Promise((resolve, reject) => {
		throw new Error("Ошибка!");
	}).catch(function(error) { // (*)
		if (error instanceof URIError) { // обрабатываем ошибку
		} else {
			alert("Не могу обработать ошибку");
			throw error; // пробрасывает эту или другую ошибку в следующий catch
		}
	}).then(function() {
		/* не выполнится */
	}).catch(error => { // (**)
		alert(`Неизвестная ошибка: ${error}`);
		// ничего не возвращаем => выполнение продолжается в нормальном режиме
	});
Управление переходит от первого блока .catch (*) к следующему (**), вниз по цепочке.

Необработанные ошибки.
Что произойдёт, если ошибка не будет обработана? Например, мы просто забыли добавить .catch в конец цепочки, как здесь:
	new Promise(function() {
		noSuchFunction(); // Ошибка (нет такой функции)
	}).then(() => { // обработчики .then, один или более
	}); // без .catch в самом конце!
В случае ошибки выполнение должно перейти к ближайшему обработчику ошибок. Но в примере выше нет никакого обработчика. Поэтому ошибка как бы "застревает", её некому обработать.
На практике, как и при обычных необработанных ошибках в коде, это означает, что что-то пошло сильно не так.
Что происходит, когда обычная ошибка не перехвачена try..catch? Скрипт умирает с сообщением в консоли. Похожее происходит и в случае необработанной ошибки промиса.
JS-движок отслеживает такие ситуации и генерирует в этом случае глобальную ошибку. Вы можете увидеть её в консоли, если запустите пример выше.
В браузере мы можем поймать такие ошибки, используя событие unhandledrejection:
	window.addEventListener('unhandledrejection', function(event) {
		// объект события имеет два специальных свойства:
		alert(event.promise); // [object Promise] - промис, который сгенерировал ошибку
		alert(event.reason); // Error: Ошибка! - объект ошибки, которая не была обработана
	});
	new Promise(function() {
		throw new Error("Ошибка!");
	}); // нет обработчика ошибок
Это событие является частью стандарта HTML ['https://html.spec.whatwg.org/multipage/webappapis.html#unhandled-promise-rejections'].
Если происходит ошибка, и отсутствует её обработчик, то генерируется событие unhandledrejection, и соответствующий объект event содержит информацию об ошибке.
Обычно такие ошибки неустранимы, поэтому лучше всего – информировать пользователя о проблеме и, возможно, отправить информацию об ошибке на сервер.
В не-браузерных средах, таких как Node.js, есть другие способы отслеживания необработанных ошибок.

Итого:
- .catch перехватывает все виды ошибок в промисах: будь то вызов reject() или ошибка, брошенная в обработчике при помощи throw.
- .then также перехватывает ошибки таким же образом, если задан второй аргумент (который является обработчиком ошибок).
- Необходимо размещать .catch там, где мы хотим обработать ошибки и знаем, как это сделать. Обработчик может проанализировать ошибку (могут быть полезны пользовательские классы ошибок) и пробросить её, если ничего не знает о ней (возможно, это программная ошибка).
- Можно и совсем не использовать .catch, если нет нормального способа восстановиться после ошибки.
- В любом случае нам следует использовать обработчик события unhandledrejection (для браузеров и аналог для других окружений), чтобы отслеживать необработанные ошибки и информировать о них пользователя (и, возможно, наш сервер), благодаря чему наше приложение никогда не будет "просто умирать".

Задачи: 1+-
1. Ошибка в setTimeout.
Что вы думаете? Выполнится ли .catch? Поясните свой ответ.
	new Promise(function(resolve, reject) {
		setTimeout(() => {
			throw new Error("Whoops!");
		}, 1000);
	}).catch(alert);
решение:
// catch не выполнится, скрипт умрёт в консоли...
Ответ: нет, не выполнится:
Как было сказано в главе, здесь присутствует "скрытый" try..catch вокруг кода функции. Поэтому обрабатываются все синхронные ошибки.
В данном примере ошибка генерируется не по ходу выполнения кода, а позже. Поэтому промис не может обработать её.
/** rihard (2 месяца назад)
Почему ошибка не перехватывается?
Дело не в том, что существует мифический «скрытый try..catch», а в том что функция executor(resolve, reject) выполняется строго синхронно, а чтобы поймать ошибку или отправить дальше нужно использовать resolve reject функции. Промис так устроен. Но тогда вы спросите меня почему Промисы генерируемые fetch срабатывают ?)) Потому что executor функция выполняется за нас под капотом, и нам нужно всего лишь обработать ее then, в отличие от кастомного промиса создаваемого нами.
Исходя из выше сказанного можно сделать вывод. Не придумывать мифические «скрытый try..catch», а сказать что синхронные ошибки в функции executor Промис поймает, асинхронные только через reject при условии что Промис кастомный нами созданный, а не API браузерный fetch. */

#1.11.5. Promise API, статические методы промисов.
15.5.25 - https://learn.javascript.ru/promise-api
В классе Promise есть 6 статических методов. Давайте познакомимся с ними.

Promise.all
Допустим, нам нужно запустить множество промисов параллельно и дождаться, пока все они выполнятся.
Например, параллельно загрузить несколько файлов и обработать результат, когда он готов. Для этого как раз и пригодится Promise.all.
Синтаксис:
	let promise = Promise.all(iterable);
Метод Promise.all принимает массив промисов (может принимать любой перебираемый объект, но обычно используется массив) и возвращает новый промис. 
Новый промис завершится, когда завершится весь переданный список промисов, и его результатом будет массив их результатов.
Например, Promise.all, представленный ниже, выполнится спустя 3 секунды, его результатом будет массив [1, 2, 3]:
	Promise.all([
		new Promise(resolve => setTimeout(() => resolve(1), 3000)), // 1
		new Promise(resolve => setTimeout(() => resolve(2), 2000)), // 2
		new Promise(resolve => setTimeout(() => resolve(3), 1000))  // 3
	]).then(alert); // когда все промисы выполнятся, результат будет [1,2,3], каждый промис даёт элемент массива
Обратите внимание, что порядок элементов массива в точности соответствует порядку исходных промисов. Даже если первый промис будет выполняться дольше всех, его результат всё равно будет первым в массиве.
Часто применяемый трюк – пропустить массив данных через map-функцию, которая для каждого элемента создаст задачу-промис, и затем обернуть получившийся массив в Promise.all.
Например, если у нас есть массив ссылок, то мы можем загрузить их вот так:
	let urls = [
		'https://api.github.com/users/iliakan',
		'https://api.github.com/users/remy',
		'https://api.github.com/users/jeresig'
	];
	let requests = urls.map(url => fetch(url)); // Преобразуем каждый URL в промис, возвращённый fetch
	Promise.all(requests) // Promise.all будет ожидать выполнения всех промисов
		.then(responses => responses.forEach(
			response => alert(`${response.url}: ${response.status}`)
		));
А вот пример побольше, с получением информации о пользователях GitHub по их логинам из массива (мы могли бы получать массив товаров по их идентификаторам, логика та же):
	let names = ['iliakan', 'remy', 'jeresig'];
	let requests = names.map(name => fetch(`https://api.github.com/users/${name}`));
	Promise.all(requests)
		.then(responses => { // все промисы успешно завершены
			for (let response of responses) alert(`${response.url}: ${response.status}`); // покажет 200 для каждой ссылки
			return responses;
		})
		.then(responses => Promise.all(responses.map(r => r.json()))) // преобразовать массив ответов response в response.json(), чтобы прочитать содержимое каждого
		.then(users => users.forEach(user => alert(user.name))); // все JSON-ответы обработаны, users - массив с результатами
Если любой из промисов завершится с ошибкой, то промис, возвращённый Promise.all, немедленно завершается с этой ошибкой.
Например:
	Promise.all([
		new Promise((resolve, reject) => setTimeout(() => resolve(1), 1000)),
		new Promise((resolve, reject) => setTimeout(() => reject(new Error("Ошибка!")), 2000)),
		new Promise((resolve, reject) => setTimeout(() => resolve(3), 3000))
	]).catch(alert); // Error: Ошибка!
Здесь второй промис завершится с ошибкой через 2 секунды. Это приведёт к немедленной ошибке в Promise.all, так что выполнится .catch: ошибка этого промиса становится ошибкой всего Promise.all.

В случае ошибки, остальные результаты игнорируются.
Если один промис завершается с ошибкой, то весь Promise.all завершается с ней, полностью забывая про остальные промисы в списке. Их результаты игнорируются.
Например, если сделано несколько вызовов fetch, как в примере выше, и один не прошёл, то остальные будут всё ещё выполняться, но Promise.all за ними уже не смотрит. Скорее всего, они так или иначе завершатся, но их результаты будут проигнорированы.
Promise.all ничего не делает для их отмены, так как в промисах вообще нет концепции "отмены". В главе Fetch: прерывание запроса ['https://learn.javascript.ru/fetch-abort'] мы рассмотрим AbortController, который помогает с этим, но он не является частью Promise API.

Promise.all(iterable) разрешает передавать не-промисы в iterable (перебираемом объекте).
Обычно, Promise.all(...) принимает перебираемый объект промисов (чаще всего массив). Но если любой из этих объектов не является промисом, он передаётся в итоговый массив "как есть".
Например, здесь результат: [1, 2, 3]
	Promise.all([
		new Promise((resolve, reject) => {
			setTimeout(() => resolve(1), 1000)
		}),
		2,
		3
	]).then(alert); // 1, 2, 3
Таким образом, мы можем передавать уже готовые значения, которые не являются промисами, в Promise.all, иногда это бывает удобно.

Promise.allSettled.
// Эта возможность была добавлена в язык недавно. В старых браузерах может понадобиться полифил.
Синтаксис:
	let promise = Promise.allSettled(iterable);
Promise.all завершается с ошибкой, если она возникает в любом из переданных промисов. Это подходит для ситуаций «всё или ничего», когда нам нужны все результаты для продолжения:
	Promise.all([
		fetch('/template.html'),
		fetch('/style.css'),
		fetch('/data.json')
	]).then(render); // методу render нужны результаты всех fetch
Метод Promise.allSettled всегда ждёт завершения всех промисов. В массиве результатов будет
	{status:"fulfilled", value:результат} // для успешных завершений,
	{status:"rejected", reason:ошибка} // для ошибок.
Например, мы хотели бы загрузить информацию о множестве пользователей. Даже если в каком-то запросе ошибка, нас всё равно интересуют остальные.
Используем для этого Promise.allSettled:
	let urls = [
		'https://api.github.com/users/iliakan',
		'https://api.github.com/users/remy',
		'https://no-such-url'
	];
	let res = [];
	Promise.allSettled(urls.map(url => fetch(url)))
		.then(results => { // (*)
			results.forEach((result, num) => {
				if (result.status == "fulfilled") {
					res.push(`${urls[num]}: ${result.value.status}`);
				}
				if (result.status == "rejected") {
					res.push(`${urls[num]}: ${result.reason}`);
				}
			});
			// console.log(results);
		});
	// console.log(res);
Массив results в строке (*) будет таким:
	[
		{status: 'fulfilled', value: ...объект ответа...},
		{status: 'fulfilled', value: ...объект ответа...},
		{status: 'rejected', reason: ...объект ошибки...}
	]
То есть, для каждого промиса у нас есть его статус и значение/ошибка.
	console.log(res): []
		0: "https://api.github.com/users/iliakan: 200"
		1: "https://api.github.com/users/remy: 200"
		2: "https://no-such-url: TypeError: Failed to fetch"
		length: 3
		[[Prototype]]: Array(0)
	console.log(results): (3) [{…}, {…}, {…}]
		0: {status: 'fulfilled', value: Response}
		1: {status: 'fulfilled', value: Response}
		2: {status: 'rejected', reason: TypeError: Failed to fetch at 'http://127.0.0.1:5500/js/main1-10-11.js:110:36' at Array.map (…)}
		length: 3
		[[Prototype]]: Array(0)

Полифил.
Если браузер не поддерживает Promise.allSettled, для него легко сделать полифил:
	if(!Promise.allSettled) {
		Promise.allSettled = function(promises) {
			return Promise.all(promises.map(p => Promise.resolve(p)
				.then(value => ({
					status: 'fulfilled',
					value: value
				}), error => ({
					status: 'rejected',
					reason: error
				}))
			));
		};
	}
В этом коде promises.map берёт аргументы, превращает их в промисы (на всякий случай) и добавляет каждому обработчик .then.
Этот обработчик превращает успешный результат value в {state:'fulfilled', value: value}, а ошибку error в {state:'rejected', reason: error}. Это как раз и есть формат результатов Promise.allSettled.
Затем мы можем использовать Promise.allSettled, чтобы получить результаты всех промисов, даже если при выполнении какого-то возникнет ошибка.

Promise.race
Метод очень похож на Promise.all, но ждёт только первый выполненный промис, из которого берёт результат (или ошибку).
Синтаксис:
	let promise = Promise.race(iterable);
Например, тут результат будет 1:
	Promise.race([
		new Promise((resolve, reject) => setTimeout(() => resolve(1), 1000)),
		new Promise((resolve, reject) => setTimeout(() => reject(new Error("Ошибка!")), 2000)),
		new Promise((resolve, reject) => setTimeout(() => resolve(3), 3000))
	]).then(alert); // 1
Быстрее всех выполнился первый промис, он и дал результат. После этого остальные промисы игнорируются.

Promise.any
Метод очень похож на Promise.race, но ждёт только первый успешно выполненный промис, из которого берёт результат.
Если ни один из переданных промисов не завершится успешно, тогда возвращённый объект Promise будет отклонён с помощью AggregateError – специального объекта ошибок, который хранит все ошибки промисов в своём свойстве errors.
Синтаксис:
	let promise = Promise.any(iterable);
Например, здесь, результатом будет 1:
	Promise.any([
		new Promise((resolve, reject) => setTimeout(() => reject(new Error("Ошибка!")), 1000)),
		new Promise((resolve, reject) => setTimeout(() => resolve(1), 2000)),
		new Promise((resolve, reject) => setTimeout(() => resolve(3), 3000))
	]).then(alert); // 1
Первый промис в этом примере был самым быстрым, но он был отклонён, поэтому результатом стал второй. После того, как первый успешно выполненный промис "выйграет гонку", все дальнейшие результаты будут проигнорированы.
Вот пример, в котором все промисы отклоняются:
	Promise.any([
		new Promise((resolve, reject) => setTimeout(() => reject(new Error("Ошибка!")), 1000)),
		new Promise((resolve, reject) => setTimeout(() => reject(new Error("Ещё одна ошибка!")), 2000))
	]).catch(error => {
		console.log(error.constructor.name); // AggregateError
		console.log(error.errors[0]); // Error: Ошибка!
		console.log(error.errors[1]); // Error: Ещё одна ошибка!
	});
Как вы можете видеть, объекты ошибок для отклонённых промисов доступны в свойстве errors объекта AggregateError.
// если какой-либо из промисов в any() выполнится успешно, то catch не сработает.

Promise.resolve/reject
Методы Promise.resolve и Promise.reject редко используются в современном коде, так как синтаксис async/await (мы рассмотрим его чуть позже) делает их, в общем-то, не нужными. Мы рассмотрим их здесь для полноты картины, а также для тех, кто по каким-то причинам не может использовать async/await.

Promise.resolve(value) // создаёт успешно выполненный промис с результатом value.
То же самое, что:
	let promise = new Promise(resolve => resolve(value));
Этот метод используют для совместимости: когда ожидается, что функция возвратит именно промис.
Например, функция loadCached ниже загружает URL и запоминает (кеширует) его содержимое. При будущих вызовах с тем же URL он тут же читает предыдущее содержимое из кеша, но использует Promise.resolve, чтобы сделать из него промис, для того, чтобы возвращаемое значение всегда было промисом:
	let cache = new Map();
	function loadCached(url) {
		if (cache.has(url)) {
			return Promise.resolve(cache.get(url)); // (*)
		}
		return fetch(url)
			.then(response => response.text())
			.then(text => {
				cache.set(url,text);
				return text;
			});
	}
Мы можем писать loadCached(url).then(…), потому что функция loadCached всегда возвращает промис. Мы всегда можем использовать .then после loadCached. Это и есть цель использования Promise.resolve в строке (*).

Promise.reject
Promise.reject(error) // создаёт промис, завершённый с ошибкой error.
То же самое, что:
	let promise = new Promise((resolve, reject) => reject(error));
На практике этот метод почти никогда не используется.

Итого:
Мы ознакомились с шестью статическими методами класса Promise:
	1. Promise.all(promises) – ожидает выполнения всех промисов и возвращает массив с результатами. Если любой из указанных промисов вернёт ошибку, то результатом работы Promise.all будет эта ошибка, результаты остальных промисов будут игнорироваться.
	2. Promise.allSettled(promises) /*(добавлен недавно)*/ – ждёт, пока все промисы завершатся и возвращает их результаты в виде массива с объектами, у каждого объекта два свойства:
		status: "fulfilled", если выполнен успешно, или "rejected", если ошибка,
		value: результат, если успешно, или reason: ошибка, если нет.
	3. Promise.race(promises) – ожидает первый выполненный промис, который становится его результатом, остальные игнорируются.
	4. Promise.any(promises) (добавлен недавно) – ожидает первый успешно выполненный промис, который становится его результатом, остальные игнорируются. Если все переданные промисы отклонены, AggregateError становится ошибкой Promise.any.
	5. Promise.resolve(value) – возвращает успешно выполнившийся промис с результатом value.
	6. Promise.reject(error) – возвращает промис с ошибкой error.
Из всех перечисленных методов, самый часто используемый – это, пожалуй, Promise.all.









#1.11.6. Промисификация
#1.11.7. Микрозадачи
#1.11.8. Async/await

#1.12. Генераторы, продвинутая итерация
#1.12.1. Генераторы
#1.12.2. Асинхронные итераторы и генераторы

#1.13. Модули
#1.13.1. Модули, введение
#1.13.2. Экспорт и импорт
#1.13.3. Динамические импорты

#1.14. Разное
#1.14.1. Proxy и Reflect
#1.14.2. Eval: выполнение строки кода
#1.14.3. Каррирование
#1.14.4. Ссылочный тип
#1.14.5. Побитовые операторы
#1.14.6. BigInt
#1.14.7. Юникод, внутреннее устройство строк
#1.14.8. Intl: интернационализация в JavaScript
#1.14.9. WeakRef и FinalizationRegistry




